LCPredict(
  (lin1): Linear(in_features=8, out_features=16, bias=True)
  (sig1): ReLU()
  (drp1): Dropout(p=0.3, inplace=False)
  (lin2): Linear(in_features=16, out_features=8, bias=True)
  (sig2): ReLU()
  (drp2): Dropout(p=0.2, inplace=False)
  (lin3): Linear(in_features=8, out_features=1, bias=True)
  (sig3): ReLU()
)
optimizer : adam, lr : 0.002
epochs : 100
batch size : 8
loss : [0.06109705567359924, 0.027981717139482498, 0.04613595828413963, 0.036001868546009064, 0.007391277700662613, 0.00600004056468606, 0.023222647607326508, 0.001838173484429717, 0.0020525753498077393, 0.004597477149218321, 0.008424797095358372, 0.004392550326883793, 0.0021662579383701086, 0.0026663453318178654, 0.0039781564846634865, 0.002017649356275797, 0.0011118082329630852, 0.0038323644548654556, 0.0019336713012307882, 0.0014591598883271217, 0.0018851193599402905, 0.006385923828929663, 0.0008092014468275011, 0.001019380521029234, 0.0009270627051591873, 0.0025940295308828354, 0.0007633008062839508, 0.002712202724069357, 0.002398096490651369, 0.001047199941240251, 0.0013135324697941542, 0.0034048971720039845, 0.00214298814535141, 0.002572359051555395, 0.001207004301249981, 0.00120180391240865, 0.00249581690877676, 0.0011459304951131344, 0.0007515075849369168, 0.0015492571983486414, 0.00299492827616632, 0.0026695001870393753, 0.0011537140235304832, 0.006388042122125626, 0.002795930253341794, 0.003429761854931712, 0.0011107909958809614, 0.005766780115664005, 0.0018098028376698494, 0.0019267259631305933, 0.0033314027823507786, 0.002074201125651598, 0.0027167305815964937, 0.006349565461277962, 0.0005284096696414053, 0.0016903996001929045, 0.002854736987501383, 0.0012963588815182447, 0.00220239395275712, 0.003999810200184584, 0.010633256286382675, 0.001634083455428481, 0.004799248650670052, 0.0016974917380139232, 0.005135387182235718, 0.0014536491362378001, 0.002273268299177289, 0.002653316594660282, 0.004631309770047665, 0.004378206096589565, 0.006061282008886337, 0.0018903935560956597, 0.00398265291005373, 0.0012727240100502968, 0.0024441885761916637, 0.0016447696834802628, 0.003221075050532818, 0.0024039011914283037, 0.0011162941809743643, 0.00386608112603426, 0.0012215389870107174, 0.004065025132149458, 0.0015211377758532763, 0.0021122463513165712, 0.002866114489734173, 0.0018730065785348415, 0.0008172614616341889, 0.0015032589435577393, 0.0008342775981873274, 0.0033321750815957785, 0.0020373528823256493, 0.001327610109001398, 0.0016647153533995152, 0.008630652911961079, 0.0015518383588641882, 0.004306575283408165, 0.0014827600680291653, 0.0014364693779498339, 0.0032097692601382732, 0.002049687784165144]
error_abs : [0.07109254598617554, 0.02207469940185547, 0.010963916778564453, 0.01649266481399536, 0.04266482591629028, 0.028388023376464844, 0.011308073997497559, 0.03166306018829346, 0.013426542282104492, 0.11413013935089111, 0.12764281034469604, 0.03167736530303955, 0.0016826987266540527, 0.018444180488586426, 0.025845706462860107, 0.01961684226989746, 0.01847076416015625, 0.1629813313484192, 0.0012874007225036621, 0.004865884780883789, 0.0482180118560791, 0.02466440200805664, 0.001586318016052246, 0.13979113101959229, 0.27199533581733704, 0.026361703872680664, 0.044702887535095215, 0.028442859649658203, 0.000792384147644043, 0.07002443075180054, 0.0462038516998291, 0.019049644470214844, 0.01339346170425415, 0.01522207260131836, 0.02378290891647339, 0.021426916122436523, 0.016650259494781494, 0.02137291431427002, 0.07029551267623901, 0.04922759532928467, 0.02505183219909668, 0.03232014179229736, 0.01810401678085327, 0.020614802837371826, 0.022092878818511963, 0.03255647420883179, 0.03846496343612671, 0.009042203426361084, 0.010932624340057373, 0.015356242656707764, 0.06237971782684326, 0.012597620487213135, 0.06274223327636719, 0.0991407036781311, 0.06695771217346191, 0.03914809226989746, 0.038879573345184326, 0.04492473602294922, 0.000651240348815918, 0.007125437259674072, 0.04220771789550781, 0.010470807552337646, 0.0468636155128479, 0.018513917922973633, 0.048640668392181396, 0.040068626403808594, 0.05948299169540405, 0.04650205373764038, 0.010518908500671387, 0.044204771518707275, 0.0016557574272155762, 0.02708911895751953, 0.04506891965866089, 0.08554917573928833, 0.0026540756225585938, 0.025611042976379395, 0.08313268423080444, 0.06565004587173462, 0.06033825874328613, 0.032295405864715576, 0.03244292736053467, 0.08039414882659912, 0.03454780578613281, 0.011718392372131348, 0.010445475578308105, 0.022191345691680908, 0.049050331115722656, 0.030916273593902588, 0.045451462268829346, 0.0642358660697937, 0.05177885293960571, 0.00822603702545166, 0.017416000366210938, 0.00228726863861084, 0.0008258819580078125, 0.0011670589447021484, 0.05650240182876587, 0.02128782868385315, 0.031666696071624756, 0.05491197109222412, 0.04710608720779419, 0.0081290602684021, 0.044672250747680664, 0.10320818424224854, 0.030085504055023193, 0.0243455171585083, 0.0026732683181762695, 0.010206937789916992, 0.004629254341125488, 0.025136470794677734, 0.009208858013153076, 0.3203126788139343, 0.04927116632461548, 0.035318851470947266, 0.09386777877807617, 0.06211531162261963, 0.0006356239318847656, 0.00010454654693603516, 0.007134795188903809, 0.014914453029632568, 0.2099342942237854, 2.5510787963867188e-05, 0.021091699600219727, 0.00924527645111084, 0.09466785192489624, 0.032865703105926514, 0.01783090829849243, 0.03980112075805664, 0.036332666873931885, 0.011166393756866455, 0.012034296989440918, 0.010589957237243652, 0.022896647453308105, 0.003152012825012207, 0.017237067222595215, 0.1090996265411377, 0.01069629192352295, 0.04678237438201904, 0.004159092903137207, 0.051398515701293945, 0.02004110813140869, 0.08425375819206238, 0.004033327102661133, 0.061719655990600586, 0.08310043811798096, 0.0042182207107543945, 0.15833209455013275, 0.011475145816802979, 0.0018497109413146973, 0.030120015144348145, 0.00822383165359497, 0.012448012828826904, 0.01743936538696289, 0.04674410820007324, 0.0003535151481628418, 0.017214715480804443, 0.06214272975921631, 0.006399571895599365, 0.03163313865661621, 0.036921024322509766, 0.01084059476852417, 0.03213769197463989, 0.03452497720718384, 0.004583954811096191, 0.022167742252349854, 0.0003262758255004883, 0.0099220871925354, 0.013704657554626465, 0.024889647960662842, 0.010025203227996826, 0.02015763521194458, 0.05230194330215454, 0.04635262489318848, 0.11211001873016357, 0.016791939735412598, 0.015767157077789307, 0.020002543926239014, 0.00779569149017334, 0.08928126096725464, 0.026140451431274414, 0.23708641529083252, 0.04388916492462158, 0.010053873062133789, 0.13266044855117798, 0.03394371271133423, 0.18598884344100952, 0.014175474643707275, 0.04188328981399536, 0.028714358806610107, 0.00966411828994751, 0.005846560001373291, 0.008605420589447021, 0.017007112503051758, 0.018209308385849, 0.030435562133789062, 0.029726266860961914, 0.039100825786590576, 0.026290178298950195, 0.002218902111053467, 0.08201640844345093, 0.04314589500427246, 0.0672038197517395, 0.0035260915756225586, 0.0028839707374572754, 0.03492844104766846, 0.030620276927947998, 0.025657236576080322, 0.004436671733856201, 0.04509890079498291, 0.0038957595825195312, 0.027432739734649658, 0.04136174917221069, 0.014131426811218262, 0.03799784183502197, 0.036597251892089844, 0.028493225574493408, 0.013695597648620605, 0.008967220783233643, 0.011322259902954102, 0.024956047534942627, 0.022323787212371826, 0.07477313280105591, 0.03209418058395386, 0.03332763910293579, 0.01908254623413086, 0.041005730628967285, 0.08781945705413818, 0.0649881362915039, 0.018462300300598145, 0.05942028760910034, 0.0009773969650268555, 0.053382933139801025, 0.007138490676879883, 0.0017021894454956055, 0.0004849433898925781, 0.03484314680099487, 0.008844852447509766, 0.023753225803375244, 0.02654653787612915, 0.034078896045684814, 0.03729391098022461, 0.055249571800231934, 0.04029977321624756, 0.016814351081848145, 0.015686511993408203, 0.004620373249053955, 0.008274078369140625, 0.06639325618743896, 0.05301463603973389, 0.029255151748657227, 0.007145047187805176, 0.004438638687133789, 0.02871805429458618, 0.02273082733154297, 0.03033900260925293, 0.04690486192703247, 0.0186845064163208, 0.02478998899459839, 0.027106940746307373, 0.0271187424659729, 0.03787684440612793, 0.054266273975372314, 0.016808688640594482, 0.0209505558013916, 0.016778171062469482, 0.07106178998947144, 0.01851034164428711, 0.02074563503265381, 0.06266999244689941, 0.009281754493713379, 0.04251903295516968, 0.08161205053329468, 0.11378192901611328, 0.021801471710205078, 0.027803480625152588, 0.04591822624206543, 0.013464927673339844, 0.018639445304870605, 0.007743954658508301, 0.018677890300750732, 0.0630069375038147, 0.04073452949523926, 0.04597896337509155, 0.054118990898132324, 0.027220189571380615, 0.015571773052215576, 0.006382286548614502, 0.007610917091369629, 0.0185280442237854, 0.0044751763343811035, 0.0009825825691223145, 0.06359493732452393, 0.0032033324241638184, 0.044076383113861084, 0.08442503213882446, 0.0032036304473876953, 0.026459991931915283, 0.0826311707496643, 0.022743403911590576, 0.13955724239349365, 0.0672910213470459, 0.028106331825256348, 0.0171164870262146, 0.0059566497802734375, 0.12976115942001343, 0.04208117723464966, 0.041728317737579346, 0.042899906635284424, 0.012955427169799805, 0.019547462463378906, 0.040197134017944336, 0.033817946910858154, 0.0030080080032348633, 0.018317699432373047, 0.0101509690284729, 0.023827552795410156, 0.010892331600189209, 0.027642786502838135, 0.0009442567825317383, 0.031120896339416504, 0.055890440940856934, 0.03152650594711304, 0.022142410278320312, 0.0495988130569458, 0.01795041561126709, 0.03520023822784424, 0.019647181034088135, 0.03813141584396362, 0.0078105926513671875, 0.04169589281082153, 0.027663767337799072, 0.006952345371246338, 0.02230137586593628, 0.003913760185241699, 0.013411641120910645, 0.008638381958007812, 0.007306396961212158, 0.045716822147369385, 0.022230982780456543, 0.0012913346290588379, 0.01436525583267212, 0.008144676685333252, 0.0006833672523498535, 0.081057608127594, 0.04950588941574097, 0.0016683340072631836, 0.023807764053344727, 0.04633891582489014, 0.009343862533569336, 0.03388941287994385, 0.012123167514801025, 0.019868671894073486, 0.002895832061767578, 0.007969439029693604, 0.03253459930419922, 0.01347053050994873, 0.008441448211669922, 0.05062103271484375, 0.01853001117706299, 0.08897078037261963, 0.07982587814331055, 0.0029639005661010742, 0.007007718086242676, 0.07752925157546997, 0.036484718322753906, 0.11046788096427917, 0.04748505353927612, 0.016734659671783447, 0.0007795095443725586, 0.03819233179092407, 0.013241350650787354, 0.013934612274169922, 0.015245139598846436, 0.031750380992889404, 0.032259464263916016, 0.0013139843940734863, 0.020228028297424316, 0.0601421594619751, 0.0160142183303833, 0.007661283016204834, 0.04055511951446533, 0.009509563446044922, 0.0018327832221984863, 0.07570463418960571, 0.3044978082180023, 0.03186124563217163, 0.01183474063873291, 0.053619325160980225, 0.02114790678024292, 0.04157710075378418, 0.02272564172744751, 0.01895153522491455, 0.008241713047027588, 0.07069557905197144, 0.04783731698989868, 0.02681910991668701, 0.02865302562713623, 0.01671159267425537, 0.016750693321228027, 0.06228452920913696, 0.011099696159362793, 0.058908939361572266, 0.026230812072753906, 0.15761947631835938, 0.036116957664489746, 0.06781446933746338, 5.418062210083008e-05, 0.0025339126586914062, 0.029895484447479248, 0.014913856983184814, 0.07400953769683838, 0.004215836524963379, 0.0046367645263671875, 0.12837904691696167, 0.05323845148086548, 0.014748573303222656, 0.021014809608459473, 0.0020224452018737793, 0.0682452917098999, 0.009517371654510498, 0.005588650703430176, 0.033782899379730225, 0.08797138929367065, 0.021683216094970703, 0.011102855205535889, 0.06358915567398071, 0.036116719245910645, 0.00688856840133667, 0.004555225372314453, 0.04771161079406738, 0.15582680702209473, 0.004254639148712158, 0.00718998908996582, 0.006937205791473389, 0.03975468873977661, 8.159875869750977e-05, 0.090190589427948, 0.003196895122528076, 0.0034549832344055176, 0.05945602059364319, 0.03099137544631958, 0.021079719066619873, 0.011430919170379639, 0.0024157166481018066, 0.00576406717300415, 0.052895963191986084, 0.06860250234603882, 0.05154061317443848, 0.012165069580078125, 0.018191635608673096, 0.015468597412109375, 0.023899197578430176, 0.05396425724029541, 0.05561470985412598, 0.04176020622253418, 0.007509052753448486, 0.062163352966308594, 0.04080355167388916, 0.029540657997131348, 0.012513339519500732, 0.07126784324645996, 0.03532230854034424, 0.02539736032485962, 0.04672473669052124, 0.10330331325531006, 0.007357418537139893, 0.016090750694274902, 0.013270258903503418, 0.009073972702026367, 0.001872718334197998, 0.06268137693405151, 0.00629580020904541, 0.05456662178039551, 0.06939685344696045, 0.05431187152862549, 0.027773380279541016, 0.050100862979888916, 0.04272937774658203, 0.05270051956176758, 0.012732267379760742, 0.02655315399169922, 0.005675137042999268, 0.02084815502166748, 0.032975852489471436, 0.026645779609680176, 0.03723067045211792, 0.015013396739959717, 0.08098042011260986, 0.018193602561950684, 0.005384206771850586, 0.04898703098297119, 0.007362782955169678, 0.004561007022857666, 0.037189602851867676, 0.013002097606658936, 0.04122644662857056, 0.10230779647827148, 0.04030972719192505, 0.04514378309249878, 0.020135700702667236]
error_signed : [0.07109254598617554, -0.02207469940185547, -0.010963916778564453, -0.01649266481399536, -0.04266482591629028, -0.028388023376464844, 0.011308073997497559, -0.03166306018829346, 0.013426542282104492, 0.11413013935089111, -0.12764281034469604, 0.03167736530303955, -0.0016826987266540527, 0.018444180488586426, 0.025845706462860107, -0.01961684226989746, 0.01847076416015625, 0.1629813313484192, 0.0012874007225036621, -0.004865884780883789, 0.0482180118560791, 0.02466440200805664, 0.001586318016052246, -0.13979113101959229, 0.27199533581733704, 0.026361703872680664, 0.044702887535095215, 0.028442859649658203, 0.000792384147644043, -0.07002443075180054, 0.0462038516998291, -0.019049644470214844, 0.01339346170425415, -0.01522207260131836, -0.02378290891647339, -0.021426916122436523, 0.016650259494781494, 0.02137291431427002, 0.07029551267623901, -0.04922759532928467, -0.02505183219909668, -0.03232014179229736, 0.01810401678085327, 0.020614802837371826, -0.022092878818511963, 0.03255647420883179, -0.03846496343612671, -0.009042203426361084, -0.010932624340057373, 0.015356242656707764, -0.06237971782684326, -0.012597620487213135, 0.06274223327636719, 0.0991407036781311, -0.06695771217346191, 0.03914809226989746, 0.038879573345184326, 0.04492473602294922, -0.000651240348815918, -0.007125437259674072, 0.04220771789550781, 0.010470807552337646, -0.0468636155128479, -0.018513917922973633, 0.048640668392181396, -0.040068626403808594, 0.05948299169540405, 0.04650205373764038, 0.010518908500671387, -0.044204771518707275, -0.0016557574272155762, -0.02708911895751953, 0.04506891965866089, -0.08554917573928833, 0.0026540756225585938, -0.025611042976379395, 0.08313268423080444, 0.06565004587173462, -0.06033825874328613, 0.032295405864715576, -0.03244292736053467, 0.08039414882659912, -0.03454780578613281, 0.011718392372131348, -0.010445475578308105, 0.022191345691680908, 0.049050331115722656, -0.030916273593902588, 0.045451462268829346, 0.0642358660697937, 0.05177885293960571, 0.00822603702545166, 0.017416000366210938, 0.00228726863861084, -0.0008258819580078125, 0.0011670589447021484, -0.05650240182876587, 0.02128782868385315, -0.031666696071624756, -0.05491197109222412, 0.04710608720779419, -0.0081290602684021, -0.044672250747680664, 0.10320818424224854, 0.030085504055023193, -0.0243455171585083, -0.0026732683181762695, 0.010206937789916992, 0.004629254341125488, 0.025136470794677734, -0.009208858013153076, 0.3203126788139343, 0.04927116632461548, 0.035318851470947266, -0.09386777877807617, -0.06211531162261963, -0.0006356239318847656, -0.00010454654693603516, -0.007134795188903809, 0.014914453029632568, -0.2099342942237854, 2.5510787963867188e-05, 0.021091699600219727, 0.00924527645111084, 0.09466785192489624, -0.032865703105926514, 0.01783090829849243, 0.03980112075805664, -0.036332666873931885, 0.011166393756866455, 0.012034296989440918, -0.010589957237243652, -0.022896647453308105, -0.003152012825012207, 0.017237067222595215, 0.1090996265411377, -0.01069629192352295, -0.04678237438201904, -0.004159092903137207, -0.051398515701293945, 0.02004110813140869, -0.08425375819206238, -0.004033327102661133, -0.061719655990600586, -0.08310043811798096, -0.0042182207107543945, 0.15833209455013275, 0.011475145816802979, 0.0018497109413146973, 0.030120015144348145, -0.00822383165359497, -0.012448012828826904, -0.01743936538696289, -0.04674410820007324, 0.0003535151481628418, 0.017214715480804443, 0.06214272975921631, 0.006399571895599365, 0.03163313865661621, 0.036921024322509766, 0.01084059476852417, 0.03213769197463989, 0.03452497720718384, 0.004583954811096191, -0.022167742252349854, 0.0003262758255004883, 0.0099220871925354, -0.013704657554626465, 0.024889647960662842, -0.010025203227996826, -0.02015763521194458, -0.05230194330215454, 0.04635262489318848, -0.11211001873016357, 0.016791939735412598, 0.015767157077789307, -0.020002543926239014, -0.00779569149017334, -0.08928126096725464, 0.026140451431274414, -0.23708641529083252, 0.04388916492462158, -0.010053873062133789, -0.13266044855117798, 0.03394371271133423, 0.18598884344100952, 0.014175474643707275, 0.04188328981399536, 0.028714358806610107, -0.00966411828994751, 0.005846560001373291, -0.008605420589447021, -0.017007112503051758, -0.018209308385849, -0.030435562133789062, 0.029726266860961914, 0.039100825786590576, 0.026290178298950195, -0.002218902111053467, 0.08201640844345093, -0.04314589500427246, 0.0672038197517395, 0.0035260915756225586, 0.0028839707374572754, 0.03492844104766846, -0.030620276927947998, 0.025657236576080322, 0.004436671733856201, -0.04509890079498291, -0.0038957595825195312, 0.027432739734649658, 0.04136174917221069, 0.014131426811218262, 0.03799784183502197, 0.036597251892089844, 0.028493225574493408, 0.013695597648620605, 0.008967220783233643, -0.011322259902954102, 0.024956047534942627, -0.022323787212371826, 0.07477313280105591, 0.03209418058395386, -0.03332763910293579, 0.01908254623413086, 0.041005730628967285, -0.08781945705413818, -0.0649881362915039, -0.018462300300598145, 0.05942028760910034, 0.0009773969650268555, -0.053382933139801025, -0.007138490676879883, -0.0017021894454956055, -0.0004849433898925781, -0.03484314680099487, -0.008844852447509766, -0.023753225803375244, 0.02654653787612915, 0.034078896045684814, 0.03729391098022461, 0.055249571800231934, 0.04029977321624756, -0.016814351081848145, -0.015686511993408203, 0.004620373249053955, 0.008274078369140625, -0.06639325618743896, -0.05301463603973389, 0.029255151748657227, -0.007145047187805176, -0.004438638687133789, 0.02871805429458618, -0.02273082733154297, 0.03033900260925293, 0.04690486192703247, -0.0186845064163208, 0.02478998899459839, 0.027106940746307373, -0.0271187424659729, 0.03787684440612793, 0.054266273975372314, -0.016808688640594482, -0.0209505558013916, 0.016778171062469482, -0.07106178998947144, 0.01851034164428711, -0.02074563503265381, 0.06266999244689941, -0.009281754493713379, 0.04251903295516968, 0.08161205053329468, 0.11378192901611328, -0.021801471710205078, -0.027803480625152588, 0.04591822624206543, -0.013464927673339844, -0.018639445304870605, -0.007743954658508301, 0.018677890300750732, 0.0630069375038147, -0.04073452949523926, 0.04597896337509155, -0.054118990898132324, 0.027220189571380615, -0.015571773052215576, 0.006382286548614502, 0.007610917091369629, -0.0185280442237854, 0.0044751763343811035, -0.0009825825691223145, -0.06359493732452393, 0.0032033324241638184, 0.044076383113861084, -0.08442503213882446, -0.0032036304473876953, -0.026459991931915283, 0.0826311707496643, -0.022743403911590576, 0.13955724239349365, -0.0672910213470459, -0.028106331825256348, -0.0171164870262146, -0.0059566497802734375, 0.12976115942001343, -0.04208117723464966, 0.041728317737579346, 0.042899906635284424, 0.012955427169799805, -0.019547462463378906, 0.040197134017944336, 0.033817946910858154, -0.0030080080032348633, -0.018317699432373047, -0.0101509690284729, 0.023827552795410156, -0.010892331600189209, 0.027642786502838135, -0.0009442567825317383, -0.031120896339416504, -0.055890440940856934, 0.03152650594711304, -0.022142410278320312, -0.0495988130569458, 0.01795041561126709, 0.03520023822784424, 0.019647181034088135, -0.03813141584396362, 0.0078105926513671875, 0.04169589281082153, -0.027663767337799072, -0.006952345371246338, 0.02230137586593628, -0.003913760185241699, -0.013411641120910645, -0.008638381958007812, 0.007306396961212158, -0.045716822147369385, -0.022230982780456543, 0.0012913346290588379, 0.01436525583267212, -0.008144676685333252, 0.0006833672523498535, 0.081057608127594, 0.04950588941574097, -0.0016683340072631836, 0.023807764053344727, 0.04633891582489014, -0.009343862533569336, 0.03388941287994385, 0.012123167514801025, 0.019868671894073486, 0.002895832061767578, 0.007969439029693604, -0.03253459930419922, 0.01347053050994873, 0.008441448211669922, 0.05062103271484375, -0.01853001117706299, 0.08897078037261963, -0.07982587814331055, 0.0029639005661010742, -0.007007718086242676, 0.07752925157546997, 0.036484718322753906, 0.11046788096427917, -0.04748505353927612, -0.016734659671783447, -0.0007795095443725586, 0.03819233179092407, 0.013241350650787354, -0.013934612274169922, -0.015245139598846436, -0.031750380992889404, 0.032259464263916016, -0.0013139843940734863, -0.020228028297424316, -0.0601421594619751, -0.0160142183303833, 0.007661283016204834, 0.04055511951446533, 0.009509563446044922, 0.0018327832221984863, 0.07570463418960571, 0.3044978082180023, 0.03186124563217163, -0.01183474063873291, 0.053619325160980225, 0.02114790678024292, 0.04157710075378418, 0.02272564172744751, 0.01895153522491455, 0.008241713047027588, 0.07069557905197144, -0.04783731698989868, -0.02681910991668701, -0.02865302562713623, 0.01671159267425537, -0.016750693321228027, -0.06228452920913696, 0.011099696159362793, -0.058908939361572266, 0.026230812072753906, 0.15761947631835938, -0.036116957664489746, -0.06781446933746338, -5.418062210083008e-05, -0.0025339126586914062, 0.029895484447479248, 0.014913856983184814, 0.07400953769683838, 0.004215836524963379, -0.0046367645263671875, -0.12837904691696167, 0.05323845148086548, -0.014748573303222656, 0.021014809608459473, 0.0020224452018737793, -0.0682452917098999, -0.009517371654510498, -0.005588650703430176, -0.033782899379730225, 0.08797138929367065, 0.021683216094970703, 0.011102855205535889, 0.06358915567398071, -0.036116719245910645, -0.00688856840133667, -0.004555225372314453, -0.04771161079406738, 0.15582680702209473, -0.004254639148712158, -0.00718998908996582, -0.006937205791473389, 0.03975468873977661, -8.159875869750977e-05, -0.090190589427948, 0.003196895122528076, 0.0034549832344055176, -0.05945602059364319, 0.03099137544631958, -0.021079719066619873, 0.011430919170379639, -0.0024157166481018066, -0.00576406717300415, 0.052895963191986084, 0.06860250234603882, -0.05154061317443848, 0.012165069580078125, -0.018191635608673096, -0.015468597412109375, 0.023899197578430176, -0.05396425724029541, -0.05561470985412598, -0.04176020622253418, 0.007509052753448486, -0.062163352966308594, -0.04080355167388916, 0.029540657997131348, 0.012513339519500732, 0.07126784324645996, 0.03532230854034424, -0.02539736032485962, -0.04672473669052124, 0.10330331325531006, 0.007357418537139893, -0.016090750694274902, 0.013270258903503418, 0.009073972702026367, -0.001872718334197998, -0.06268137693405151, -0.00629580020904541, -0.05456662178039551, 0.06939685344696045, 0.05431187152862549, -0.027773380279541016, 0.050100862979888916, 0.04272937774658203, 0.05270051956176758, 0.012732267379760742, 0.02655315399169922, -0.005675137042999268, -0.02084815502166748, 0.032975852489471436, -0.026645779609680176, 0.03723067045211792, -0.015013396739959717, -0.08098042011260986, 0.018193602561950684, 0.005384206771850586, 0.04898703098297119, -0.007362782955169678, 0.004561007022857666, 0.037189602851867676, -0.013002097606658936, 0.04122644662857056, -0.10230779647827148, -0.04030972719192505, 0.04514378309249878, 0.020135700702667236]
error_mean : 3.512004700303078
error_mse : 0.1233417701495091
error_max : 32.03126788139343
error_min : 0.0025510787963867188