LCPredict(
  (lin1): Linear(in_features=8, out_features=16, bias=True)
  (sig1): Sigmoid()
  (drp1): Dropout(p=0.3, inplace=False)
  (lin2): Linear(in_features=16, out_features=8, bias=True)
  (sig2): Sigmoid()
  (drp2): Dropout(p=0.2, inplace=False)
  (lin3): Linear(in_features=8, out_features=1, bias=True)
  (sig3): Sigmoid()
)
optimizer : adam, lr : 0.002
epochs : 100
batch size : 8
loss : [0.03453480824828148, 0.04800897836685181, 0.10638394951820374, 0.03134727478027344, 0.037646692246198654, 0.021965257823467255, 0.011037593707442284, 0.015305629931390285, 0.012299847789108753, 0.011880804784595966, 0.016799161210656166, 0.014143241569399834, 0.012149364687502384, 0.014295085333287716, 0.018431734293699265, 0.004838139750063419, 0.0045739151537418365, 0.014802745543420315, 0.014170635491609573, 0.006102332845330238, 0.01249010395258665, 0.008618953637778759, 0.004775112960487604, 0.0034213620238006115, 0.007809062954038382, 0.0028023752383887768, 0.006767286919057369, 0.0031641563400626183, 0.005429031327366829, 0.002532630693167448, 0.0017587835900485516, 0.008927002549171448, 0.004304036498069763, 0.008133615367114544, 0.005558636970818043, 0.0029889140278100967, 0.009664718061685562, 0.0028475550934672356, 0.0052926503121852875, 0.0018939300207421184, 0.00048384617548435926, 0.005578598938882351, 0.0027625709772109985, 0.0019351342925801873, 0.004286794923245907, 0.0018730825977399945, 0.0041735973209142685, 0.0013682558201253414, 0.00644703209400177, 0.010126451961696148, 0.007348410319536924, 0.0037405313923954964, 0.007078228518366814, 0.002834134502336383, 0.005399052053689957, 0.0031850214581936598, 0.003050914965569973, 0.0015945655759423971, 0.00388646824285388, 0.006399190053343773, 0.003741168649867177, 0.008521695621311665, 0.0011959056137129664, 0.0020478656515479088, 0.0010749478824436665, 0.0014762766659259796, 0.004983410704880953, 0.003539356403052807, 0.002792889252305031, 0.0022806059569120407, 0.0015299993101507425, 0.005658523179590702, 0.004527963697910309, 0.0023874654434621334, 0.002385887550190091, 0.0034159915521740913, 0.0027882494032382965, 0.0042485687881708145, 0.0019365826155990362, 0.000707290368154645, 0.001986979739740491, 0.00224715331569314, 0.005641855299472809, 0.002348430221900344, 0.004362789914011955, 0.0032966856379061937, 0.0027837450616061687, 0.0015779570676386356, 0.0012786276638507843, 0.0038613344077020884, 0.0024859404657036066, 0.007122297305613756, 0.002791968872770667, 0.0026879715733230114, 0.0012074648402631283, 0.005522607825696468, 0.004304953850805759, 0.0035523870028555393, 0.0019769230857491493, 0.007759659085422754]
error_abs : [0.054435908794403076, 0.05586397647857666, 0.05588817596435547, 0.0215032696723938, 0.026203632354736328, 0.03781408071517944, 0.010953068733215332, 0.01718008518218994, 0.02425384521484375, 0.0959365963935852, 0.23113003373146057, 0.08497494459152222, 0.015267670154571533, 0.026844799518585205, 0.03513216972351074, 0.05282717943191528, 0.029713749885559082, 0.14986515045166016, 0.036907851696014404, 0.033840954303741455, 0.03817480802536011, 0.05910593271255493, 0.031283795833587646, 0.11356157064437866, 0.2853895127773285, 0.0853797197341919, 0.011656105518341064, 0.0022107958793640137, 0.012655854225158691, 0.05072963237762451, 0.04336512088775635, 0.008932054042816162, 0.04375147819519043, 0.0036011338233947754, 0.09991052746772766, 0.01172703504562378, 0.0185854434967041, 0.07137304544448853, 0.03878283500671387, 0.06000983715057373, 0.0006501674652099609, 0.004298865795135498, 0.007053792476654053, 0.08612430095672607, 0.0027939677238464355, 0.015823006629943848, 0.07400751113891602, 0.04079258441925049, 0.01519709825515747, 0.04831212759017944, 0.056267738342285156, 0.0007976293563842773, 0.1344386339187622, 0.09927886724472046, 0.04718130826950073, 0.009239256381988525, 0.02824026346206665, 0.03996884822845459, 0.05647081136703491, 0.0012532472610473633, 0.029306113719940186, 0.005297839641571045, 0.05244338512420654, 0.021133840084075928, 0.016871750354766846, 0.008973777294158936, 0.1265457272529602, 0.0051787495613098145, 0.07779678702354431, 0.0487360954284668, 0.04059922695159912, 0.06875306367874146, 0.003914833068847656, 0.03409624099731445, 0.0395512580871582, 0.05266445875167847, 0.07292097806930542, 0.10194790363311768, 0.06456929445266724, 0.06416630744934082, 0.031777262687683105, 0.06596225500106812, 0.05307048559188843, 0.00661015510559082, 0.02322918176651001, 0.028875112533569336, 0.031240880489349365, 0.028120100498199463, 0.05495178699493408, 0.00114518404006958, 0.025251448154449463, 0.02154916524887085, 0.006822943687438965, 0.02984452247619629, 0.012443006038665771, 0.04574328660964966, 0.1251828670501709, 0.19558176398277283, 0.03674358129501343, 0.017694175243377686, 0.02786046266555786, 0.019980788230895996, 0.009695231914520264, 0.03650277853012085, 0.06656312942504883, 0.02757042646408081, 0.009895622730255127, 0.012135207653045654, 0.0064234137535095215, 0.016639888286590576, 0.02321845293045044, 0.7808707356452942, 0.02236497402191162, 0.08177202939987183, 0.07614874839782715, 0.0011655688285827637, 0.02473825216293335, 0.008364975452423096, 0.009720027446746826, 0.04010879993438721, 0.05501431226730347, 0.042895615100860596, 0.03910672664642334, 0.003950059413909912, 0.24666297435760498, 0.004975438117980957, 0.055012404918670654, 0.006142675876617432, 0.0061258673667907715, 0.00793445110321045, 0.03968000411987305, 0.018359065055847168, 0.0019782185554504395, 0.03859347105026245, 0.01566094160079956, 0.16370022296905518, 0.04382753372192383, 0.06206226348876953, 0.055997610092163086, 0.010228931903839111, 0.04582834243774414, 0.09693726897239685, 0.01621222496032715, 0.022039592266082764, 0.07718002796173096, 0.0195082426071167, 0.4081896096467972, 0.021692872047424316, 0.02697843313217163, 0.13708502054214478, 0.041354596614837646, 0.03492534160614014, 0.12464910745620728, 0.05410182476043701, 0.03328359127044678, 0.017697930335998535, 0.03621906042098999, 0.043807029724121094, 0.027365565299987793, 0.03157287836074829, 0.05297422409057617, 0.041176557540893555, 0.07054996490478516, 0.004838347434997559, 0.0011293292045593262, 0.035557687282562256, 0.04957079887390137, 0.0060961246490478516, 0.018162548542022705, 0.015688598155975342, 0.009136319160461426, 0.01651853322982788, 0.18294519186019897, 0.02241957187652588, 0.01626354455947876, 0.059733033180236816, 0.00973200798034668, 0.0431705117225647, 0.007060527801513672, 0.04101681709289551, 0.0822809636592865, 0.114285409450531, 0.002585172653198242, 0.004149794578552246, 0.005488753318786621, 0.20978498458862305, 0.03221487998962402, 0.019378602504730225, 0.019679486751556396, 0.1177559494972229, 0.03146862983703613, 0.05983304977416992, 0.04060828685760498, 0.004781216382980347, 0.0302773118019104, 0.04205554723739624, 0.06764161586761475, 0.01665365695953369, 0.03754323720932007, 0.08170801401138306, 0.022582054138183594, 0.01201331615447998, 0.0030298233032226562, 0.07172083854675293, 0.09677475690841675, 0.0078544020652771, 0.19554084539413452, 0.05943465232849121, 0.08571332693099976, 0.03412318229675293, 0.03610420227050781, 0.00138169527053833, 0.05145162343978882, 0.003448784351348877, 0.021842777729034424, 0.01311647891998291, 0.011069953441619873, 0.03337627649307251, 0.03684443235397339, 0.08702999353408813, 0.021781504154205322, 0.05004394054412842, 0.003993332386016846, 0.001165628433227539, 0.04755198955535889, 0.00669628381729126, 0.03338980674743652, 0.04091924428939819, 0.009310781955718994, 0.052790939807891846, 0.004318177700042725, 0.032168447971343994, 0.037582218647003174, 0.047411322593688965, 0.05746239423751831, 0.04390686750411987, 0.0615231990814209, 0.039707720279693604, 0.0824400782585144, 0.0353853702545166, 0.006352365016937256, 0.055190205574035645, 0.08423924446105957, 0.033510446548461914, 0.010424792766571045, 0.019541621208190918, 0.03670299053192139, 0.00031280517578125, 0.021603286266326904, 0.013729095458984375, 0.035937726497650146, 0.007433950901031494, 0.02085179090499878, 0.019354641437530518, 0.02008068561553955, 0.1261921525001526, 0.0002384185791015625, 0.06236672401428223, 0.04114830493927002, 0.024907410144805908, 0.006359755992889404, 0.001432657241821289, 0.042112886905670166, 0.020755350589752197, 0.05701035261154175, 0.07050293684005737, 0.013424217700958252, 0.015126168727874756, 0.0895429253578186, 0.004862606525421143, 0.06877106428146362, 0.020084381103515625, 0.006460428237915039, 0.04408913850784302, 0.03490948677062988, 0.05203729867935181, 0.09789431095123291, 0.01162809133529663, 0.012180924415588379, 0.029578685760498047, 0.0693325400352478, 0.016720473766326904, 0.0618060827255249, 0.0455891489982605, 0.043535470962524414, 0.01356053352355957, 0.030557453632354736, 0.028851211071014404, 0.04017317295074463, 0.015193641185760498, 0.03657734394073486, 0.047662556171417236, 0.018134713172912598, 0.08333361148834229, 0.00816267728805542, 0.014659345149993896, 0.03518939018249512, 0.044836223125457764, 0.05563986301422119, 0.09300893545150757, 0.06489747762680054, 0.007739365100860596, 0.06193745136260986, 0.007952094078063965, 0.1626153588294983, 0.026310980319976807, 0.06690919399261475, 0.010313212871551514, 0.03649449348449707, 0.009426772594451904, 0.003017425537109375, 0.17439788579940796, 0.12632882595062256, 0.025862395763397217, 0.0062479376792907715, 0.035929739475250244, 0.05115896463394165, 0.006136059761047363, 0.006920456886291504, 0.040490686893463135, 0.06298720836639404, 0.0028359293937683105, 0.004092991352081299, 0.03273332118988037, 0.010178148746490479, 0.04267072677612305, 0.033378660678863525, 0.02202785015106201, 0.02722787857055664, 0.0313795804977417, 0.0011475682258605957, 0.01070094108581543, 0.03444945812225342, 0.0026608705520629883, 0.03627419471740723, 0.012544214725494385, 0.0071939826011657715, 0.02434372901916504, 0.07641845941543579, 0.013296723365783691, 0.07262915372848511, 0.005284011363983154, 0.053610801696777344, 0.013999581336975098, 0.1309947967529297, 0.010475754737854004, 0.03211796283721924, 0.024269402027130127, 0.13459515571594238, 0.077761709690094, 0.09181350469589233, 0.08457142114639282, 0.026293575763702393, 0.015156447887420654, 0.029502511024475098, 0.0165560245513916, 0.006325244903564453, 0.015123844146728516, 0.01507866382598877, 0.17213457822799683, 0.07603591680526733, 0.016098320484161377, 0.005628824234008789, 0.03377753496170044, 0.016823530197143555, 0.09265092015266418, 0.033860206604003906, 0.07599908113479614, 0.024811983108520508, 0.024986684322357178, 0.041268885135650635, 0.004518032073974609, 0.020194530487060547, 0.03426426649093628, 0.008407890796661377, 0.010007977485656738, 0.027878642082214355, 0.19558709859848022, 0.034770190715789795, 0.012215852737426758, 0.05669373273849487, 0.007227063179016113, 0.011934638023376465, 0.040308237075805664, 0.1390012502670288, 0.012965142726898193, 0.029810786247253418, 0.024487018585205078, 0.04162132740020752, 0.018684864044189453, 0.056852638721466064, 0.021755874156951904, 0.03579068183898926, 0.03078627586364746, 0.027514755725860596, 0.04463702440261841, 0.060915589332580566, 0.04539257287979126, 0.025296270847320557, 0.008153080940246582, 0.01508265733718872, 0.03207439184188843, 0.0185089111328125, 0.23652863502502441, 0.013613224029541016, 0.013098657131195068, 0.015078425407409668, 0.03643602132797241, 0.009961247444152832, 0.01673668622970581, 0.04448169469833374, 0.03230530023574829, 0.0039000511169433594, 0.08948588371276855, 0.05627638101577759, 0.023365497589111328, 0.042101919651031494, 0.09137660264968872, 0.0016331672668457031, 0.045074641704559326, 0.008752584457397461, 0.007998108863830566, 0.1874726414680481, 0.04793596267700195, 0.03169053792953491, 0.05045396089553833, 0.0027626752853393555, 0.06749135255813599, 0.020476043224334717, 0.05785703659057617, 0.33521366119384766, 0.016535401344299316, 0.07270723581314087, 0.24821048974990845, 0.02202785015106201, 0.01648038625717163, 0.03927546739578247, 0.016669392585754395, 0.010839223861694336, 0.03752675652503967, 0.027496755123138428, 0.025128304958343506, 0.10824239253997803, 0.03117150068283081, 0.038153231143951416, 0.01845097541809082, 0.1358662247657776, 0.03412598371505737, 0.017021238803863525, 0.006166636943817139, 0.06737691164016724, 0.05677461624145508, 0.023082733154296875, 0.11721646785736084, 0.008128941059112549, 0.003117382526397705, 0.06261569261550903, 0.04847043752670288, 0.032953739166259766, 0.09123456478118896, 0.12536221742630005, 0.029794931411743164, 0.030245065689086914, 0.018503010272979736, 0.01539236307144165, 0.03639107942581177, 0.06563788652420044, 0.014938771724700928, 0.03461331129074097, 0.06567603349685669, 0.03787451982498169, 0.02481001615524292, 0.026405930519104004, 0.009087741374969482, 0.10289818048477173, 0.0414738655090332, 0.01267927885055542, 0.022046685218811035, 0.014513850212097168, 0.05637085437774658, 0.027378618717193604, 0.0359533429145813, 0.01719844341278076, 0.09496384859085083, 0.04557216167449951, 0.03495901823043823, 0.058879971504211426, 0.013468563556671143, 0.04010361433029175, 0.018286406993865967, 0.1530923843383789, 0.03665512800216675, 0.0411565899848938, 0.018339574337005615, 0.00587540864944458, 0.005519509315490723, 0.06235986948013306, 0.04708510637283325, 0.055108487606048584, 0.023707091808319092]
error_signed : [0.054435908794403076, 0.05586397647857666, -0.05588817596435547, -0.0215032696723938, -0.026203632354736328, -0.03781408071517944, 0.010953068733215332, -0.01718008518218994, -0.02425384521484375, 0.0959365963935852, -0.23113003373146057, 0.08497494459152222, 0.015267670154571533, 0.026844799518585205, 0.03513216972351074, -0.05282717943191528, -0.029713749885559082, 0.14986515045166016, 0.036907851696014404, -0.033840954303741455, -0.03817480802536011, 0.05910593271255493, 0.031283795833587646, -0.11356157064437866, 0.2853895127773285, -0.0853797197341919, -0.011656105518341064, 0.0022107958793640137, -0.012655854225158691, 0.05072963237762451, 0.04336512088775635, -0.008932054042816162, -0.04375147819519043, 0.0036011338233947754, -0.09991052746772766, -0.01172703504562378, 0.0185854434967041, 0.07137304544448853, 0.03878283500671387, 0.06000983715057373, -0.0006501674652099609, -0.004298865795135498, 0.007053792476654053, -0.08612430095672607, 0.0027939677238464355, -0.015823006629943848, -0.07400751113891602, -0.04079258441925049, -0.01519709825515747, -0.04831212759017944, -0.056267738342285156, 0.0007976293563842773, 0.1344386339187622, 0.09927886724472046, 0.04718130826950073, -0.009239256381988525, 0.02824026346206665, 0.03996884822845459, 0.05647081136703491, 0.0012532472610473633, 0.029306113719940186, 0.005297839641571045, -0.05244338512420654, -0.021133840084075928, 0.016871750354766846, 0.008973777294158936, -0.1265457272529602, 0.0051787495613098145, -0.07779678702354431, 0.0487360954284668, -0.04059922695159912, -0.06875306367874146, 0.003914833068847656, -0.03409624099731445, 0.0395512580871582, -0.05266445875167847, 0.07292097806930542, 0.10194790363311768, -0.06456929445266724, 0.06416630744934082, -0.031777262687683105, 0.06596225500106812, 0.05307048559188843, 0.00661015510559082, 0.02322918176651001, 0.028875112533569336, 0.031240880489349365, -0.028120100498199463, -0.05495178699493408, 0.00114518404006958, 0.025251448154449463, 0.02154916524887085, 0.006822943687438965, 0.02984452247619629, 0.012443006038665771, -0.04574328660964966, 0.1251828670501709, 0.19558176398277283, 0.03674358129501343, -0.017694175243377686, 0.02786046266555786, 0.019980788230895996, -0.009695231914520264, 0.03650277853012085, 0.06656312942504883, 0.02757042646408081, -0.009895622730255127, 0.012135207653045654, 0.0064234137535095215, 0.016639888286590576, 0.02321845293045044, 0.7808707356452942, 0.02236497402191162, 0.08177202939987183, -0.07614874839782715, 0.0011655688285827637, -0.02473825216293335, 0.008364975452423096, 0.009720027446746826, -0.04010879993438721, -0.05501431226730347, -0.042895615100860596, 0.03910672664642334, 0.003950059413909912, 0.24666297435760498, -0.004975438117980957, 0.055012404918670654, 0.006142675876617432, 0.0061258673667907715, -0.00793445110321045, 0.03968000411987305, 0.018359065055847168, -0.0019782185554504395, 0.03859347105026245, 0.01566094160079956, 0.16370022296905518, 0.04382753372192383, -0.06206226348876953, 0.055997610092163086, 0.010228931903839111, -0.04582834243774414, -0.09693726897239685, -0.01621222496032715, -0.022039592266082764, 0.07718002796173096, 0.0195082426071167, 0.4081896096467972, 0.021692872047424316, -0.02697843313217163, 0.13708502054214478, -0.041354596614837646, -0.03492534160614014, 0.12464910745620728, -0.05410182476043701, 0.03328359127044678, -0.017697930335998535, 0.03621906042098999, -0.043807029724121094, 0.027365565299987793, 0.03157287836074829, -0.05297422409057617, 0.041176557540893555, 0.07054996490478516, 0.004838347434997559, -0.0011293292045593262, -0.035557687282562256, 0.04957079887390137, -0.0060961246490478516, 0.018162548542022705, -0.015688598155975342, -0.009136319160461426, 0.01651853322982788, 0.18294519186019897, -0.02241957187652588, -0.01626354455947876, 0.059733033180236816, 0.00973200798034668, -0.0431705117225647, -0.007060527801513672, 0.04101681709289551, -0.0822809636592865, 0.114285409450531, -0.002585172653198242, 0.004149794578552246, -0.005488753318786621, 0.20978498458862305, 0.03221487998962402, 0.019378602504730225, 0.019679486751556396, -0.1177559494972229, 0.03146862983703613, -0.05983304977416992, -0.04060828685760498, -0.004781216382980347, -0.0302773118019104, 0.04205554723739624, 0.06764161586761475, -0.01665365695953369, 0.03754323720932007, 0.08170801401138306, -0.022582054138183594, 0.01201331615447998, 0.0030298233032226562, 0.07172083854675293, 0.09677475690841675, -0.0078544020652771, 0.19554084539413452, 0.05943465232849121, 0.08571332693099976, 0.03412318229675293, -0.03610420227050781, -0.00138169527053833, -0.05145162343978882, -0.003448784351348877, -0.021842777729034424, 0.01311647891998291, 0.011069953441619873, 0.03337627649307251, 0.03684443235397339, 0.08702999353408813, 0.021781504154205322, 0.05004394054412842, -0.003993332386016846, -0.001165628433227539, 0.04755198955535889, 0.00669628381729126, -0.03338980674743652, 0.04091924428939819, -0.009310781955718994, 0.052790939807891846, -0.004318177700042725, -0.032168447971343994, -0.037582218647003174, 0.047411322593688965, -0.05746239423751831, 0.04390686750411987, -0.0615231990814209, -0.039707720279693604, -0.0824400782585144, 0.0353853702545166, 0.006352365016937256, 0.055190205574035645, 0.08423924446105957, 0.033510446548461914, -0.010424792766571045, -0.019541621208190918, -0.03670299053192139, 0.00031280517578125, -0.021603286266326904, 0.013729095458984375, 0.035937726497650146, -0.007433950901031494, -0.02085179090499878, -0.019354641437530518, -0.02008068561553955, 0.1261921525001526, -0.0002384185791015625, 0.06236672401428223, -0.04114830493927002, -0.024907410144805908, 0.006359755992889404, -0.001432657241821289, 0.042112886905670166, -0.020755350589752197, -0.05701035261154175, -0.07050293684005737, -0.013424217700958252, -0.015126168727874756, 0.0895429253578186, 0.004862606525421143, 0.06877106428146362, 0.020084381103515625, 0.006460428237915039, -0.04408913850784302, 0.03490948677062988, 0.05203729867935181, 0.09789431095123291, 0.01162809133529663, 0.012180924415588379, 0.029578685760498047, 0.0693325400352478, -0.016720473766326904, 0.0618060827255249, -0.0455891489982605, 0.043535470962524414, -0.01356053352355957, -0.030557453632354736, -0.028851211071014404, 0.04017317295074463, 0.015193641185760498, -0.03657734394073486, 0.047662556171417236, 0.018134713172912598, 0.08333361148834229, 0.00816267728805542, 0.014659345149993896, -0.03518939018249512, 0.044836223125457764, 0.05563986301422119, 0.09300893545150757, 0.06489747762680054, -0.007739365100860596, 0.06193745136260986, -0.007952094078063965, 0.1626153588294983, -0.026310980319976807, 0.06690919399261475, 0.010313212871551514, 0.03649449348449707, 0.009426772594451904, 0.003017425537109375, 0.17439788579940796, 0.12632882595062256, 0.025862395763397217, 0.0062479376792907715, 0.035929739475250244, -0.05115896463394165, 0.006136059761047363, 0.006920456886291504, -0.040490686893463135, -0.06298720836639404, -0.0028359293937683105, 0.004092991352081299, 0.03273332118988037, 0.010178148746490479, -0.04267072677612305, -0.033378660678863525, -0.02202785015106201, 0.02722787857055664, -0.0313795804977417, -0.0011475682258605957, -0.01070094108581543, 0.03444945812225342, 0.0026608705520629883, -0.03627419471740723, -0.012544214725494385, -0.0071939826011657715, 0.02434372901916504, -0.07641845941543579, -0.013296723365783691, 0.07262915372848511, 0.005284011363983154, 0.053610801696777344, 0.013999581336975098, 0.1309947967529297, 0.010475754737854004, 0.03211796283721924, 0.024269402027130127, -0.13459515571594238, 0.077761709690094, 0.09181350469589233, 0.08457142114639282, 0.026293575763702393, -0.015156447887420654, -0.029502511024475098, -0.0165560245513916, 0.006325244903564453, 0.015123844146728516, -0.01507866382598877, 0.17213457822799683, 0.07603591680526733, 0.016098320484161377, 0.005628824234008789, 0.03377753496170044, 0.016823530197143555, 0.09265092015266418, -0.033860206604003906, 0.07599908113479614, -0.024811983108520508, 0.024986684322357178, 0.041268885135650635, -0.004518032073974609, 0.020194530487060547, -0.03426426649093628, 0.008407890796661377, 0.010007977485656738, 0.027878642082214355, -0.19558709859848022, 0.034770190715789795, 0.012215852737426758, 0.05669373273849487, -0.007227063179016113, 0.011934638023376465, 0.040308237075805664, 0.1390012502670288, 0.012965142726898193, -0.029810786247253418, 0.024487018585205078, 0.04162132740020752, -0.018684864044189453, 0.056852638721466064, 0.021755874156951904, 0.03579068183898926, -0.03078627586364746, 0.027514755725860596, -0.04463702440261841, -0.060915589332580566, 0.04539257287979126, -0.025296270847320557, 0.008153080940246582, 0.01508265733718872, -0.03207439184188843, -0.0185089111328125, 0.23652863502502441, -0.013613224029541016, 0.013098657131195068, -0.015078425407409668, 0.03643602132797241, -0.009961247444152832, 0.01673668622970581, 0.04448169469833374, 0.03230530023574829, -0.0039000511169433594, -0.08948588371276855, -0.05627638101577759, -0.023365497589111328, -0.042101919651031494, -0.09137660264968872, -0.0016331672668457031, -0.045074641704559326, -0.008752584457397461, -0.007998108863830566, 0.1874726414680481, -0.04793596267700195, 0.03169053792953491, 0.05045396089553833, 0.0027626752853393555, -0.06749135255813599, -0.020476043224334717, -0.05785703659057617, 0.33521366119384766, -0.016535401344299316, 0.07270723581314087, 0.24821048974990845, 0.02202785015106201, 0.01648038625717163, -0.03927546739578247, 0.016669392585754395, 0.010839223861694336, -0.03752675652503967, 0.027496755123138428, -0.025128304958343506, 0.10824239253997803, 0.03117150068283081, -0.038153231143951416, -0.01845097541809082, -0.1358662247657776, 0.03412598371505737, -0.017021238803863525, -0.006166636943817139, 0.06737691164016724, 0.05677461624145508, 0.023082733154296875, -0.11721646785736084, -0.008128941059112549, 0.003117382526397705, -0.06261569261550903, 0.04847043752670288, 0.032953739166259766, 0.09123456478118896, 0.12536221742630005, -0.029794931411743164, -0.030245065689086914, -0.018503010272979736, 0.01539236307144165, 0.03639107942581177, 0.06563788652420044, 0.014938771724700928, -0.03461331129074097, 0.06567603349685669, -0.03787451982498169, -0.02481001615524292, 0.026405930519104004, -0.009087741374969482, 0.10289818048477173, 0.0414738655090332, -0.01267927885055542, 0.022046685218811035, 0.014513850212097168, 0.05637085437774658, 0.027378618717193604, 0.0359533429145813, 0.01719844341278076, 0.09496384859085083, 0.04557216167449951, 0.03495901823043823, 0.058879971504211426, 0.013468563556671143, -0.04010361433029175, -0.018286406993865967, 0.1530923843383789, -0.03665512800216675, 0.0411565899848938, 0.018339574337005615, -0.00587540864944458, -0.005519509315490723, -0.06235986948013306, -0.04708510637283325, 0.055108487606048584, -0.023707091808319092]
error_mean : 4.482806006073952
error_mse : 0.20095549688092695
error_max : 78.08707356452942
error_min : 0.02384185791015625