LCPredict(
  (lin1): Linear(in_features=8, out_features=16, bias=True)
  (sig1): ReLU()
  (drp1): Dropout(p=0.3, inplace=False)
  (lin2): Linear(in_features=16, out_features=8, bias=True)
  (sig2): ReLU()
  (drp2): Dropout(p=0.2, inplace=False)
  (lin3): Linear(in_features=8, out_features=1, bias=True)
  (sig3): ReLU()
)
optimizer : adam, lr : 0.002
epochs : 100
batch size : 8
loss : [0.18703371286392212, 0.0335947647690773, 0.028101392090320587, 0.02754771150648594, 0.015486454591155052, 0.015351391397416592, 0.012595023028552532, 0.0075618065893650055, 0.010460689663887024, 0.01680300198495388, 0.010072987526655197, 0.017660178244113922, 0.012128401547670364, 0.003818229306489229, 0.00829364825040102, 0.0034988548140972853, 0.005502413026988506, 0.003347070189192891, 0.004959622863680124, 0.0023307304363697767, 0.0026596805546432734, 0.0011490114266052842, 0.004558204207569361, 0.0020160595886409283, 0.0008504943107254803, 0.0022202064283192158, 0.001879053539596498, 0.0046530659310519695, 0.0012175865704193711, 0.0006264414405450225, 0.003789204638451338, 0.0016755186952650547, 0.0021852124482393265, 0.0025282097049057484, 0.0018765756394714117, 0.003805746091529727, 0.0023818698246032, 0.0010521768126636744, 0.0025099243503063917, 0.0035147059243172407, 0.0007013085414655507, 0.002813265658915043, 0.0023067560978233814, 0.001099202549085021, 0.0017988511826843023, 0.004619944840669632, 0.0017529858741909266, 0.003305858001112938, 0.001822680700570345, 0.0016752954106777906, 0.0026171100325882435, 0.0011406237026676536, 0.000984230893664062, 0.002444579964503646, 0.0009443801827728748, 0.0016021010233089328, 0.0015416642418131232, 0.0021311247255653143, 0.0023686501663178205, 0.0015899905702099204, 0.0041971392929553986, 0.0028642171528190374, 0.001849298132583499, 0.0007824297645129263, 0.0019820607267320156, 0.0014832147862762213, 0.00143919768743217, 0.001618427224457264, 0.0019217866938561201, 0.0030361907556653023, 0.0031547225080430508, 0.0008811265579424798, 0.0026349909603595734, 0.0026349001564085484, 0.0021311130840331316, 0.0018324892735108733, 0.0010291796643286943, 0.0012229378335177898, 0.0014699287712574005, 0.001029251841828227, 0.0030678054317831993, 0.0024949267972260714, 0.001997129525989294, 0.002659463556483388, 0.0037912013940513134, 0.0016858442686498165, 0.0022095218300819397, 0.00353828864172101, 0.002718566916882992, 0.0016853963024914265, 0.0015055987751111388, 0.0014353718142956495, 0.0015989411622285843, 0.002635960467159748, 0.0016520238714292645, 0.003061308292672038, 0.0009095733985304832, 0.0024171629920601845, 0.0012552074622362852, 0.0021127716172486544]
error_abs : [0.007877469062805176, 0.013066589832305908, 0.0355566143989563, 0.00932532548904419, 0.007832527160644531, 0.0002643465995788574, 0.007617056369781494, 0.00789874792098999, 0.052056312561035156, 0.05458265542984009, 0.2138960361480713, 0.019965827465057373, 0.006080329418182373, 0.03428316116333008, 0.014016270637512207, 0.015421688556671143, 0.011571526527404785, 0.17461609840393066, 0.021819353103637695, 0.02619403600692749, 0.0005799531936645508, 0.04901915788650513, 0.011116862297058105, 0.03024214506149292, 0.14432266354560852, 0.04125398397445679, 0.04464918375015259, 0.058395981788635254, 0.0033833980560302734, 0.01921069622039795, 0.012800037860870361, 0.010816633701324463, 0.012372791767120361, 0.008840680122375488, 0.0886872410774231, 0.03989535570144653, 0.03364288806915283, 0.006700575351715088, 0.010354459285736084, 0.001070857048034668, 0.04332900047302246, 0.004684507846832275, 0.006120741367340088, 0.028163671493530273, 0.03231525421142578, 0.013235032558441162, 0.022362470626831055, 0.03565192222595215, 0.01643240451812744, 0.03091222047805786, 0.0032810568809509277, 0.0028235912322998047, 0.08014345169067383, 0.11911404132843018, 0.10876655578613281, 0.011777400970458984, 0.012383103370666504, 0.019027113914489746, 0.011533737182617188, 0.02461951971054077, 0.025169789791107178, 0.015478551387786865, 0.02311497926712036, 0.004842102527618408, 0.025060176849365234, 0.015259623527526855, 0.02705460786819458, 0.059510231018066406, 0.058151185512542725, 0.01347261667251587, 0.006066858768463135, 0.010897338390350342, 0.00988858938217163, 0.0866193175315857, 0.00834190845489502, 0.04090613126754761, 0.0855787992477417, 0.05124121904373169, 0.034107089042663574, 0.05660414695739746, 0.01834249496459961, 0.004730582237243652, 0.01609867811203003, 0.011424839496612549, 0.017013251781463623, 0.01816082000732422, 0.032254815101623535, 0.049381136894226074, 0.005176246166229248, 0.014832556247711182, 0.035471558570861816, 0.029571831226348877, 0.037876665592193604, 0.04916352033615112, 0.02871549129486084, 0.004903554916381836, 0.015433788299560547, 0.11860969662666321, 0.018897712230682373, 0.02169215679168701, 0.0015544295310974121, 0.0497855544090271, 0.008746564388275146, 0.07045221328735352, 0.1201888918876648, 0.0356404185295105, 0.02218693494796753, 0.017498672008514404, 0.022594869136810303, 0.03407001495361328, 0.07593894004821777, 0.09747034311294556, 0.000732719898223877, 0.04846829175949097, 0.0025631189346313477, 0.00704115629196167, 0.002040386199951172, 0.013203322887420654, 0.010335683822631836, 0.0024449825286865234, 0.013245880603790283, 0.011684298515319824, 0.03238934278488159, 0.02968984842300415, 0.2573847770690918, 0.003349781036376953, 0.02398085594177246, 0.03558593988418579, 0.013638019561767578, 0.018402814865112305, 0.04118013381958008, 0.01874685287475586, 0.0025140047073364258, 0.046658992767333984, 0.030671775341033936, 0.15898174047470093, 0.017247021198272705, 0.020954370498657227, 0.05462074279785156, 0.014412283897399902, 0.021573662757873535, 0.07244282960891724, 0.011736869812011719, 0.019032716751098633, 0.0030408501625061035, 0.0017932653427124023, 0.16004960238933563, 0.07996273040771484, 0.016567587852478027, 0.018301784992218018, 0.011103987693786621, 0.015808284282684326, 0.04610145092010498, 0.0334773063659668, 0.029897034168243408, 0.03840458393096924, 0.03552204370498657, 0.021954894065856934, 0.023383796215057373, 0.04446566104888916, 0.029650986194610596, 0.06745076179504395, 0.039252638816833496, 0.029259324073791504, 0.04391300678253174, 0.010798513889312744, 0.045330047607421875, 0.06673049926757812, 0.009216487407684326, 0.011964619159698486, 0.01733344793319702, 0.01671767234802246, 0.030398666858673096, 0.012035965919494629, 0.014139115810394287, 0.013197064399719238, 0.016252636909484863, 0.011658430099487305, 0.029262006282806396, 0.0164872407913208, 0.188082754611969, 0.05918252468109131, 0.026393651962280273, 0.03762167692184448, 0.009392499923706055, 0.2093573808670044, 0.02656346559524536, 0.06792151927947998, 0.02414560317993164, 0.05841726064682007, 0.01005011796951294, 7.665157318115234e-05, 0.019222736358642578, 0.03704392910003662, 0.04707038402557373, 0.010862112045288086, 0.04778105020523071, 0.020712435245513916, 0.01576697826385498, 0.08432871103286743, 0.02073192596435547, 0.023681342601776123, 0.043255388736724854, 0.019933462142944336, 0.0014851093292236328, 0.022741496562957764, 0.017643332481384277, 0.016630828380584717, 0.01659756898880005, 0.01706916093826294, 0.024925410747528076, 0.015541791915893555, 0.00226515531539917, 0.04241681098937988, 0.03980076313018799, 0.00017684698104858398, 0.032454729080200195, 0.008508741855621338, 0.012545764446258545, 0.11454987525939941, 0.01936495304107666, 0.031138598918914795, 0.06231498718261719, 0.0023082494735717773, 0.05739182233810425, 0.044084906578063965, 0.08413326740264893, 0.011191844940185547, 0.02044469118118286, 0.032116830348968506, 0.018144607543945312, 0.008535802364349365, 0.044217467308044434, 0.050737977027893066, 0.05636727809906006, 0.03174823522567749, 0.02847951650619507, 0.001728653907775879, 0.08482187986373901, 7.301568984985352e-05, 0.02538686990737915, 0.1312273144721985, 0.019565463066101074, 0.014169514179229736, 0.0433812141418457, 0.022533655166625977, 0.006979525089263916, 0.05139130353927612, 0.011893987655639648, 0.017136216163635254, 0.03503543138504028, 0.009928345680236816, 0.08246862888336182, 0.02948927879333496, 0.03748708963394165, 0.029445528984069824, 0.026576876640319824, 0.02881646156311035, 0.03578823804855347, 0.01182466745376587, 0.05017745494842529, 0.007869064807891846, 0.019579648971557617, 0.04513663053512573, 0.0347781777381897, 0.032158851623535156, 0.0299108624458313, 0.07449018955230713, 0.06242060661315918, 0.006037652492523193, 0.05497986078262329, 0.0963892936706543, 0.04204314947128296, 0.03759610652923584, 0.05712693929672241, 0.017673850059509277, 0.07202249765396118, 0.04842209815979004, 0.01944369077682495, 0.0395125150680542, 0.0488547682762146, 0.0070607662200927734, 0.01455831527709961, 0.012768745422363281, 0.027531683444976807, 0.009282410144805908, 0.020288288593292236, 0.010574519634246826, 0.045959413051605225, 0.019555330276489258, 0.04339176416397095, 0.23085081577301025, 0.0058689117431640625, 0.09047943353652954, 0.029801368713378906, 0.0330161452293396, 0.006678640842437744, 0.0201646089553833, 0.02717345952987671, 0.01412433385848999, 0.023364663124084473, 0.03364342451095581, 0.025549769401550293, 0.008840799331665039, 0.05615663528442383, 0.007756292819976807, 0.010690689086914062, 0.027637779712677002, 0.0032483935356140137, 0.023768842220306396, 0.010195493698120117, 0.0057266950607299805, 0.20864486694335938, 0.022549808025360107, 0.03986763954162598, 0.0055817365646362305, 0.0112534761428833, 0.03309011459350586, 0.030629515647888184, 0.018883228302001953, 0.030791044235229492, 0.010725796222686768, 0.0395277738571167, 0.04637742042541504, 0.04226428270339966, 0.033629655838012695, 0.016605377197265625, 0.031961023807525635, 0.01603865623474121, 0.04043799638748169, 0.014527082443237305, 0.032954394817352295, 0.0011618733406066895, 0.039824485778808594, 0.036345601081848145, 0.03830921649932861, 0.0073566436767578125, 0.025766849517822266, 0.0056476593017578125, 0.015435516834259033, 0.02819037437438965, 0.013430953025817871, 0.0959133505821228, 0.0015897750854492188, 0.06956636905670166, 0.013815760612487793, 0.01729583740234375, 0.053410470485687256, 0.0007562041282653809, 0.004377603530883789, 0.11307734251022339, 0.012979567050933838, 0.04113191366195679, 0.004859030246734619, 0.03373062610626221, 0.025582849979400635, 0.0584222674369812, 0.02582228183746338, 0.02912580966949463, 0.015484988689422607, 0.05704665184020996, 0.021996736526489258, 0.007201075553894043, 0.014979422092437744, 0.037250638008117676, 0.16495856642723083, 0.0748634934425354, 0.06735372543334961, 0.010335147380828857, 0.009959697723388672, 0.07998555898666382, 0.012566745281219482, 0.012529850006103516, 0.039703309535980225, 0.046874284744262695, 0.015551269054412842, 0.025245308876037598, 0.021424591541290283, 0.08702331781387329, 0.020765304565429688, 0.09187549352645874, 0.008080005645751953, 0.04605209827423096, 0.11292439699172974, 0.051570773124694824, 0.0045185089111328125, 0.03072988986968994, 0.02993154525756836, 0.03671753406524658, 0.02626115083694458, 0.028191983699798584, 0.028226494789123535, 0.01121741533279419, 0.050058186054229736, 0.006833076477050781, 0.05791717767715454, 0.03885328769683838, 0.04184001684188843, 0.028657376766204834, 0.010314404964447021, 0.03154939413070679, 0.0008458495140075684, 0.018681585788726807, 0.012474119663238525, 0.008790075778961182, 0.010160505771636963, 0.04828786849975586, 0.07710045576095581, 0.03827422857284546, 0.01445460319519043, 0.01970905065536499, 0.07294774055480957, 0.010593891143798828, 0.01120305061340332, 0.047410428524017334, 0.006812334060668945, 0.04617863893508911, 0.0937851071357727, 0.0003628730773925781, 0.023948192596435547, 0.00502091646194458, 0.001809537410736084, 0.06022220849990845, 0.013772070407867432, 0.01411670446395874, 0.05192673206329346, 0.012947678565979004, 0.049556851387023926, 0.04600954055786133, 0.029574573040008545, 0.2716068625450134, 0.035990118980407715, 0.02445584535598755, 0.05986279249191284, 0.02878469228744507, 0.04006218910217285, 0.04021263122558594, 0.02738887071609497, 0.0029036998748779297, 0.09857666492462158, 0.0212211012840271, 0.04972785711288452, 0.06039917469024658, 0.017370939254760742, 0.003905057907104492, 0.06262713670730591, 0.08227294683456421, 0.007476627826690674, 0.06693536043167114, 0.004359185695648193, 0.02400672435760498, 0.015541374683380127, 0.0160178542137146, 0.04378390312194824, 0.0032219290733337402, 0.017734527587890625, 0.01964503526687622, 0.014383554458618164, 0.006068706512451172, 0.048493921756744385, 0.12120622396469116, 0.05153000354766846, 0.029295265674591064, 0.032370805740356445, 0.18178540468215942, 0.04904991388320923, 0.013676464557647705, 0.027746081352233887, 0.01692807674407959, 0.016382694244384766, 0.007375836372375488, 0.012834608554840088, 0.012113034725189209, 0.004392445087432861, 0.052826523780822754, 0.04078853130340576, 0.03678625822067261, 0.024758875370025635, 0.11365801095962524, 0.020948410034179688, 0.025349318981170654, 0.009880900382995605, 0.018423080444335938, 0.07235890626907349, 0.010341107845306396, 0.019373059272766113, 0.022140026092529297, 0.05060017108917236, 0.016720592975616455, 0.04053640365600586, 0.0416409969329834, 0.0054669976234436035, 0.005095243453979492, 0.046707987785339355, 0.016640901565551758, 0.04637688398361206, 0.051119327545166016, 0.01450258493423462, 0.028770864009857178, 0.03801625967025757]
error_signed : [-0.007877469062805176, -0.013066589832305908, 0.0355566143989563, -0.00932532548904419, -0.007832527160644531, -0.0002643465995788574, -0.007617056369781494, 0.00789874792098999, 0.052056312561035156, -0.05458265542984009, -0.2138960361480713, -0.019965827465057373, 0.006080329418182373, 0.03428316116333008, -0.014016270637512207, -0.015421688556671143, -0.011571526527404785, 0.17461609840393066, 0.021819353103637695, 0.02619403600692749, -0.0005799531936645508, 0.04901915788650513, -0.011116862297058105, -0.03024214506149292, 0.14432266354560852, 0.04125398397445679, 0.04464918375015259, 0.058395981788635254, 0.0033833980560302734, -0.01921069622039795, 0.012800037860870361, 0.010816633701324463, -0.012372791767120361, -0.008840680122375488, 0.0886872410774231, 0.03989535570144653, 0.03364288806915283, -0.006700575351715088, 0.010354459285736084, -0.001070857048034668, -0.04332900047302246, -0.004684507846832275, -0.006120741367340088, -0.028163671493530273, -0.03231525421142578, -0.013235032558441162, -0.022362470626831055, -0.03565192222595215, -0.01643240451812744, 0.03091222047805786, 0.0032810568809509277, -0.0028235912322998047, 0.08014345169067383, 0.11911404132843018, 0.10876655578613281, -0.011777400970458984, -0.012383103370666504, 0.019027113914489746, -0.011533737182617188, -0.02461951971054077, -0.025169789791107178, 0.015478551387786865, 0.02311497926712036, -0.004842102527618408, -0.025060176849365234, -0.015259623527526855, -0.02705460786819458, 0.059510231018066406, -0.058151185512542725, 0.01347261667251587, -0.006066858768463135, 0.010897338390350342, 0.00988858938217163, -0.0866193175315857, -0.00834190845489502, 0.04090613126754761, 0.0855787992477417, 0.05124121904373169, -0.034107089042663574, 0.05660414695739746, -0.01834249496459961, 0.004730582237243652, -0.01609867811203003, -0.011424839496612549, -0.017013251781463623, 0.01816082000732422, 0.032254815101623535, 0.049381136894226074, -0.005176246166229248, 0.014832556247711182, -0.035471558570861816, 0.029571831226348877, 0.037876665592193604, 0.04916352033615112, 0.02871549129486084, 0.004903554916381836, -0.015433788299560547, -0.11860969662666321, -0.018897712230682373, 0.02169215679168701, 0.0015544295310974121, 0.0497855544090271, -0.008746564388275146, 0.07045221328735352, 0.1201888918876648, 0.0356404185295105, -0.02218693494796753, -0.017498672008514404, 0.022594869136810303, 0.03407001495361328, 0.07593894004821777, 0.09747034311294556, 0.000732719898223877, 0.04846829175949097, 0.0025631189346313477, -0.00704115629196167, 0.002040386199951172, 0.013203322887420654, 0.010335683822631836, -0.0024449825286865234, 0.013245880603790283, 0.011684298515319824, 0.03238934278488159, 0.02968984842300415, 0.2573847770690918, 0.003349781036376953, -0.02398085594177246, 0.03558593988418579, 0.013638019561767578, 0.018402814865112305, 0.04118013381958008, 0.01874685287475586, -0.0025140047073364258, 0.046658992767333984, -0.030671775341033936, 0.15898174047470093, 0.017247021198272705, -0.020954370498657227, 0.05462074279785156, -0.014412283897399902, 0.021573662757873535, -0.07244282960891724, -0.011736869812011719, 0.019032716751098633, -0.0030408501625061035, -0.0017932653427124023, 0.16004960238933563, -0.07996273040771484, 0.016567587852478027, -0.018301784992218018, 0.011103987693786621, 0.015808284282684326, 0.04610145092010498, 0.0334773063659668, 0.029897034168243408, 0.03840458393096924, -0.03552204370498657, -0.021954894065856934, 0.023383796215057373, 0.04446566104888916, 0.029650986194610596, 0.06745076179504395, 0.039252638816833496, 0.029259324073791504, -0.04391300678253174, 0.010798513889312744, 0.045330047607421875, 0.06673049926757812, 0.009216487407684326, -0.011964619159698486, 0.01733344793319702, 0.01671767234802246, 0.030398666858673096, 0.012035965919494629, -0.014139115810394287, 0.013197064399719238, -0.016252636909484863, 0.011658430099487305, -0.029262006282806396, -0.0164872407913208, 0.188082754611969, 0.05918252468109131, -0.026393651962280273, -0.03762167692184448, -0.009392499923706055, 0.2093573808670044, -0.02656346559524536, 0.06792151927947998, 0.02414560317993164, -0.05841726064682007, -0.01005011796951294, -7.665157318115234e-05, -0.019222736358642578, 0.03704392910003662, -0.04707038402557373, 0.010862112045288086, 0.04778105020523071, 0.020712435245513916, -0.01576697826385498, -0.08432871103286743, -0.02073192596435547, 0.023681342601776123, 0.043255388736724854, 0.019933462142944336, -0.0014851093292236328, 0.022741496562957764, -0.017643332481384277, 0.016630828380584717, 0.01659756898880005, 0.01706916093826294, 0.024925410747528076, 0.015541791915893555, -0.00226515531539917, 0.04241681098937988, -0.03980076313018799, -0.00017684698104858398, 0.032454729080200195, 0.008508741855621338, 0.012545764446258545, 0.11454987525939941, -0.01936495304107666, 0.031138598918914795, 0.06231498718261719, 0.0023082494735717773, 0.05739182233810425, 0.044084906578063965, -0.08413326740264893, -0.011191844940185547, 0.02044469118118286, 0.032116830348968506, 0.018144607543945312, 0.008535802364349365, -0.044217467308044434, -0.050737977027893066, 0.05636727809906006, -0.03174823522567749, -0.02847951650619507, 0.001728653907775879, -0.08482187986373901, -7.301568984985352e-05, 0.02538686990737915, -0.1312273144721985, 0.019565463066101074, -0.014169514179229736, -0.0433812141418457, 0.022533655166625977, -0.006979525089263916, 0.05139130353927612, 0.011893987655639648, 0.017136216163635254, 0.03503543138504028, 0.009928345680236816, 0.08246862888336182, 0.02948927879333496, 0.03748708963394165, -0.029445528984069824, 0.026576876640319824, 0.02881646156311035, 0.03578823804855347, -0.01182466745376587, 0.05017745494842529, -0.007869064807891846, -0.019579648971557617, 0.04513663053512573, 0.0347781777381897, -0.032158851623535156, 0.0299108624458313, -0.07449018955230713, 0.06242060661315918, -0.006037652492523193, 0.05497986078262329, 0.0963892936706543, 0.04204314947128296, 0.03759610652923584, -0.05712693929672241, -0.017673850059509277, -0.07202249765396118, 0.04842209815979004, 0.01944369077682495, 0.0395125150680542, 0.0488547682762146, -0.0070607662200927734, 0.01455831527709961, -0.012768745422363281, 0.027531683444976807, 0.009282410144805908, 0.020288288593292236, -0.010574519634246826, 0.045959413051605225, 0.019555330276489258, 0.04339176416397095, 0.23085081577301025, 0.0058689117431640625, 0.09047943353652954, -0.029801368713378906, 0.0330161452293396, 0.006678640842437744, 0.0201646089553833, 0.02717345952987671, -0.01412433385848999, 0.023364663124084473, 0.03364342451095581, 0.025549769401550293, 0.008840799331665039, 0.05615663528442383, -0.007756292819976807, 0.010690689086914062, 0.027637779712677002, 0.0032483935356140137, -0.023768842220306396, 0.010195493698120117, 0.0057266950607299805, 0.20864486694335938, 0.022549808025360107, 0.03986763954162598, 0.0055817365646362305, -0.0112534761428833, -0.03309011459350586, 0.030629515647888184, 0.018883228302001953, -0.030791044235229492, 0.010725796222686768, 0.0395277738571167, 0.04637742042541504, 0.04226428270339966, 0.033629655838012695, -0.016605377197265625, -0.031961023807525635, 0.01603865623474121, -0.04043799638748169, 0.014527082443237305, -0.032954394817352295, -0.0011618733406066895, 0.039824485778808594, 0.036345601081848145, 0.03830921649932861, -0.0073566436767578125, 0.025766849517822266, -0.0056476593017578125, 0.015435516834259033, 0.02819037437438965, 0.013430953025817871, 0.0959133505821228, 0.0015897750854492188, 0.06956636905670166, -0.013815760612487793, 0.01729583740234375, -0.053410470485687256, -0.0007562041282653809, -0.004377603530883789, 0.11307734251022339, 0.012979567050933838, 0.04113191366195679, -0.004859030246734619, 0.03373062610626221, 0.025582849979400635, 0.0584222674369812, 0.02582228183746338, -0.02912580966949463, 0.015484988689422607, 0.05704665184020996, 0.021996736526489258, 0.007201075553894043, 0.014979422092437744, 0.037250638008117676, 0.16495856642723083, 0.0748634934425354, -0.06735372543334961, 0.010335147380828857, -0.009959697723388672, 0.07998555898666382, -0.012566745281219482, 0.012529850006103516, 0.039703309535980225, 0.046874284744262695, -0.015551269054412842, 0.025245308876037598, 0.021424591541290283, 0.08702331781387329, 0.020765304565429688, 0.09187549352645874, -0.008080005645751953, 0.04605209827423096, 0.11292439699172974, 0.051570773124694824, -0.0045185089111328125, 0.03072988986968994, 0.02993154525756836, -0.03671753406524658, 0.02626115083694458, 0.028191983699798584, 0.028226494789123535, -0.01121741533279419, 0.050058186054229736, -0.006833076477050781, -0.05791717767715454, 0.03885328769683838, -0.04184001684188843, -0.028657376766204834, 0.010314404964447021, -0.03154939413070679, 0.0008458495140075684, -0.018681585788726807, 0.012474119663238525, -0.008790075778961182, 0.010160505771636963, 0.04828786849975586, 0.07710045576095581, 0.03827422857284546, -0.01445460319519043, -0.01970905065536499, 0.07294774055480957, -0.010593891143798828, -0.01120305061340332, -0.047410428524017334, 0.006812334060668945, 0.04617863893508911, -0.0937851071357727, -0.0003628730773925781, -0.023948192596435547, -0.00502091646194458, -0.001809537410736084, 0.06022220849990845, 0.013772070407867432, 0.01411670446395874, 0.05192673206329346, -0.012947678565979004, -0.049556851387023926, 0.04600954055786133, -0.029574573040008545, 0.2716068625450134, -0.035990118980407715, 0.02445584535598755, 0.05986279249191284, 0.02878469228744507, 0.04006218910217285, 0.04021263122558594, 0.02738887071609497, 0.0029036998748779297, -0.09857666492462158, -0.0212211012840271, -0.04972785711288452, 0.06039917469024658, 0.017370939254760742, -0.003905057907104492, 0.06262713670730591, 0.08227294683456421, 0.007476627826690674, 0.06693536043167114, -0.004359185695648193, 0.02400672435760498, 0.015541374683380127, -0.0160178542137146, 0.04378390312194824, -0.0032219290733337402, 0.017734527587890625, -0.01964503526687622, -0.014383554458618164, -0.006068706512451172, 0.048493921756744385, 0.12120622396469116, 0.05153000354766846, 0.029295265674591064, 0.032370805740356445, 0.18178540468215942, 0.04904991388320923, 0.013676464557647705, 0.027746081352233887, 0.01692807674407959, -0.016382694244384766, 0.007375836372375488, -0.012834608554840088, -0.012113034725189209, -0.004392445087432861, 0.052826523780822754, 0.04078853130340576, 0.03678625822067261, 0.024758875370025635, 0.11365801095962524, 0.020948410034179688, 0.025349318981170654, -0.009880900382995605, 0.018423080444335938, 0.07235890626907349, 0.010341107845306396, 0.019373059272766113, 0.022140026092529297, 0.05060017108917236, -0.016720592975616455, -0.04053640365600586, 0.0416409969329834, 0.0054669976234436035, -0.005095243453979492, -0.046707987785339355, -0.016640901565551758, 0.04637688398361206, -0.051119327545166016, -0.01450258493423462, 0.028770864009857178, 0.03801625967025757]
error_mean : 3.447085264325142
error_mse : 0.11882396819527534
error_max : 27.160686254501343
error_min : 0.0073015689849853516