LCPredict(
  (lin1): Linear(in_features=8, out_features=16, bias=True)
  (sig1): Sigmoid()
  (drp1): Dropout(p=0.3, inplace=False)
  (lin2): Linear(in_features=16, out_features=8, bias=True)
  (sig2): Sigmoid()
  (drp2): Dropout(p=0.2, inplace=False)
  (lin3): Linear(in_features=8, out_features=1, bias=True)
  (sig3): Sigmoid()
)
optimizer : adam, lr : 0.002
epochs : 100
batch size : 8
loss : [0.12508925795555115, 0.09333692491054535, 0.03391261026263237, 0.10278533399105072, 0.013305909931659698, 0.04342074692249298, 0.009270227514207363, 0.028815628960728645, 0.0234398003667593, 0.0237004142254591, 0.010222428478300571, 0.020042506977915764, 0.013031119480729103, 0.009727400727570057, 0.0178980715572834, 0.0179542675614357, 0.015577864833176136, 0.015375073067843914, 0.004295624326914549, 0.0033145779743790627, 0.006224845536053181, 0.01292650867253542, 0.009878754615783691, 0.005645529367029667, 0.009142251685261726, 0.008408883586525917, 0.005149384029209614, 0.008465947583317757, 0.003682294860482216, 0.014491986483335495, 0.005712875165045261, 0.010357365012168884, 0.005647121928632259, 0.00956379622220993, 0.004390664864331484, 0.0023596296086907387, 0.00382820563390851, 0.002123389858752489, 0.006095415446907282, 0.0015202213544398546, 0.003047133795917034, 0.0022997551131993532, 0.003271312452852726, 0.004560757894068956, 0.00525994598865509, 0.0035705824848264456, 0.005835751071572304, 0.0011376184411346912, 0.013187410309910774, 0.0029707809444516897, 0.004656913690268993, 0.003765970468521118, 0.0046164714731276035, 0.005570201203227043, 0.0044251298531889915, 0.0017453697510063648, 0.005448922514915466, 0.0049656229093670845, 0.0005286593222990632, 0.002979895332828164, 0.006353872828185558, 0.006294661201536655, 0.0013969140127301216, 0.005711364094167948, 0.0012343209236860275, 0.0027714341413229704, 0.003535063471645117, 0.003619980067014694, 0.0033633538987487555, 0.0012548149097710848, 0.0014989478513598442, 0.0031084944494068623, 0.001840058946982026, 0.0037119677290320396, 0.0022826846688985825, 0.0014681280590593815, 0.004494654014706612, 0.0014112865319475532, 0.002816637046635151, 0.0011957419337704778, 0.0038477482739835978, 0.0014276729198172688, 0.0016290615312755108, 0.0012475342955440283, 0.0012722061946988106, 0.0026482040993869305, 0.0012688213028013706, 0.0012965204659849405, 0.002131655113771558, 0.00314351636916399, 0.0018380829133093357, 0.0015362140256911516, 0.0018558405572548509, 0.00024230784038081765, 0.0013880208134651184, 0.005175429861992598, 0.0009042051387950778, 0.0016028342070057988, 0.001559920608997345, 0.0015348531305789948]
error_abs : [0.013672947883605957, 0.01964658498764038, 0.015853464603424072, 0.002536773681640625, 0.004095494747161865, 0.029592931270599365, 0.01603013277053833, 0.0262831449508667, 0.018943428993225098, 0.09062880277633667, 0.19457530975341797, 0.07922995090484619, 0.02007240056991577, 0.06153827905654907, 0.013345181941986084, 0.057310640811920166, 0.00811314582824707, 0.1253381371498108, 0.03328979015350342, 0.04338693618774414, 0.09387928247451782, 0.021490514278411865, 0.001198887825012207, 0.009473919868469238, 0.31741657853126526, 0.0897449254989624, 0.002569735050201416, 0.018490910530090332, 0.01715219020843506, 0.03023397922515869, 0.034489572048187256, 0.006196558475494385, 0.03601330518722534, 0.044580817222595215, 0.06720247864723206, 0.02848351001739502, 0.049811363220214844, 0.05198490619659424, 0.05930906534194946, 0.05733388662338257, 0.04087549448013306, 0.007979512214660645, 0.03603792190551758, 0.02039557695388794, 0.030993223190307617, 0.05383974313735962, 0.05946207046508789, 0.05226379632949829, 0.009396910667419434, 0.02672278881072998, 0.09634053707122803, 0.030119597911834717, 0.16052323579788208, 0.10116565227508545, 0.03848832845687866, 0.03409844636917114, 0.03033226728439331, 0.030446290969848633, 0.001664280891418457, 0.04645806550979614, 0.04045522212982178, 0.02366006374359131, 0.028917551040649414, 0.0007888078689575195, 0.06795579195022583, 0.036468327045440674, 0.05559748411178589, 0.09203511476516724, 0.020570576190948486, 0.025683104991912842, 0.061369240283966064, 0.010725736618041992, 0.021506011486053467, 0.07529246807098389, 0.02285069227218628, 0.0062566399574279785, 0.13133245706558228, 0.0884392261505127, 0.09164595603942871, 0.012265622615814209, 0.07575976848602295, 0.022516191005706787, 0.01144951581954956, 0.015354275703430176, 0.17260980606079102, 0.0115814208984375, 0.07005375623703003, 0.010295510292053223, 0.034300804138183594, 0.02519446611404419, 0.03245967626571655, 0.03407013416290283, 0.04144096374511719, 0.0074440836906433105, 0.004631400108337402, 0.04321664571762085, 0.23017501831054688, 0.02464693784713745, 0.04519987106323242, 0.04671493172645569, 0.03136485815048218, 0.0059209465980529785, 0.0017881393432617188, 0.2277626395225525, 0.09544545412063599, 0.05327075719833374, 0.023225486278533936, 0.009611904621124268, 0.021444261074066162, 0.07267874479293823, 0.0603371262550354, 0.7322378158569336, 0.012749135494232178, 0.010999500751495361, 0.04894411563873291, 0.008941650390625, 0.030554354190826416, 0.010318160057067871, 0.04796236753463745, 0.0039041638374328613, 0.029139816761016846, 0.005109608173370361, 0.0131416916847229, 0.0282323956489563, 0.15964412689208984, 0.013636171817779541, 0.009051024913787842, 0.020835399627685547, 0.0213700532913208, 0.006456971168518066, 0.009592592716217041, 0.004497051239013672, 0.0006974339485168457, 0.004053056240081787, 0.05397772789001465, 0.03952229022979736, 0.010669827461242676, 0.001228630542755127, 0.08199191093444824, 0.058676719665527344, 0.004805386066436768, 0.11755532026290894, 0.009106159210205078, 0.03903406858444214, 0.056070029735565186, 0.03480970859527588, 0.6472524255514145, 0.03985708951950073, 0.10015732049942017, 0.05863022804260254, 0.06345880031585693, 0.0011652112007141113, 0.046669602394104004, 0.098990797996521, 0.019654273986816406, 0.025193333625793457, 0.015004754066467285, 0.0612831711769104, 0.024442732334136963, 0.03353351354598999, 0.008258581161499023, 0.03712576627731323, 0.005673766136169434, 0.00174027681350708, 0.0247458815574646, 0.012479007244110107, 0.04112505912780762, 0.07316434383392334, 0.0026129484176635742, 0.04140669107437134, 0.043688178062438965, 0.00915437936782837, 0.0993075966835022, 0.03694421052932739, 0.036901891231536865, 0.019791066646575928, 0.0399172306060791, 0.03620445728302002, 0.030552327632904053, 0.05192148685455322, 0.2214820384979248, 0.08428066968917847, 0.04210090637207031, 0.03174710273742676, 0.013073384761810303, 0.051133573055267334, 0.043774306774139404, 0.026076853275299072, 0.016546130180358887, 0.042654573917388916, 0.06614726781845093, 0.10477876663208008, 0.011655688285827637, 0.06136801838874817, 0.015087902545928955, 0.0179559588432312, 0.08514672517776489, 0.03183281421661377, 0.01212453842163086, 0.17442047595977783, 0.034578561782836914, 0.021775901317596436, 0.0037366151809692383, 0.010879337787628174, 0.023944497108459473, 0.0669325590133667, 0.059203147888183594, 0.009559273719787598, 0.01735985279083252, 0.05450314283370972, 0.009341120719909668, 0.051182568073272705, 0.06802940368652344, 0.031777262687683105, 0.007179975509643555, 0.025983214378356934, 0.05104619264602661, 0.05902290344238281, 0.012674272060394287, 0.02824479341506958, 0.020572185516357422, 0.04211324453353882, 0.017012476921081543, 0.0474814772605896, 0.14009225368499756, 0.08770978450775146, 0.20645815134048462, 0.03612983226776123, 0.032008349895477295, 0.02132236957550049, 0.04746067523956299, 0.028911948204040527, 0.031868815422058105, 0.01489555835723877, 0.061700403690338135, 0.21300560235977173, 0.017072200775146484, 0.009791254997253418, 0.039772093296051025, 0.00273740291595459, 0.028151750564575195, 0.04894822835922241, 0.1170080304145813, 0.027792155742645264, 0.01839601993560791, 0.041261494159698486, 0.02314549684524536, 0.0339888334274292, 0.01845937967300415, 0.020124316215515137, 0.004607081413269043, 0.04433637857437134, 0.03588974475860596, 0.022210001945495605, 0.048288822174072266, 0.09740126132965088, 0.03145819902420044, 0.025174856185913086, 0.020160973072052002, 0.005794346332550049, 0.05498766899108887, 0.03896617889404297, 0.11596018075942993, 0.00760340690612793, 0.030352473258972168, 0.06933611631393433, 0.014206469058990479, 0.035598933696746826, 0.017255842685699463, 0.01139599084854126, 0.00868213176727295, 0.03467506170272827, 0.04913508892059326, 0.00853818655014038, 0.0326848030090332, 0.006670236587524414, 0.01934868097305298, 0.10862290859222412, 0.05981642007827759, 0.03430372476577759, 0.08886879682540894, 0.022008836269378662, 0.06836050748825073, 0.01699984073638916, 0.040791213512420654, 0.06145298480987549, 0.04855698347091675, 0.08777999877929688, 0.05294555425643921, 0.016944408416748047, 0.07089567184448242, 0.052432745695114136, 0.07966071367263794, 0.09376281499862671, 0.007384061813354492, 0.02064460515975952, 0.060286104679107666, 0.07547783851623535, 0.03174114227294922, 0.12271910905838013, 0.04719400405883789, 0.013118267059326172, 0.012250661849975586, 0.037880122661590576, 0.1186724305152893, 0.03100341558456421, 0.0481719970703125, 0.05062592029571533, 0.03592276573181152, 0.04978311061859131, 0.015119016170501709, 0.10194486379623413, 0.04416835308074951, 0.025535643100738525, 0.05098849534988403, 0.042771339416503906, 0.08376520872116089, 0.04637068510055542, 0.0010723471641540527, 0.049162864685058594, 0.040017008781433105, 0.026709258556365967, 0.055869460105895996, 0.03763139247894287, 0.06878155469894409, 0.00019866228103637695, 0.0650714635848999, 0.10010474920272827, 0.012325108051300049, 0.0372353196144104, 0.036700427532196045, 0.02677386999130249, 0.015915989875793457, 0.05619096755981445, 0.008764564990997314, 0.007071316242218018, 0.03503596782684326, 0.0005693435668945312, 0.02879089117050171, 0.051727890968322754, 0.025905489921569824, 0.018794238567352295, 0.022622406482696533, 0.0384291410446167, 0.10523068904876709, 0.0444374680519104, 0.023998498916625977, 0.022294223308563232, 0.1039724349975586, 0.034786224365234375, 0.21888214349746704, 0.259163498878479, 0.028910279273986816, 0.12435322999954224, 0.0549355149269104, 0.013987183570861816, 0.00854426622390747, 0.03347998857498169, 0.07469171285629272, 0.11810177564620972, 0.08051002025604248, 0.019188880920410156, 0.05925852060317993, 0.08892351388931274, 0.006535053253173828, 0.25707390904426575, 0.14015614986419678, 0.024923086166381836, 0.04743832349777222, 0.048673272132873535, 0.006435990333557129, 0.008791804313659668, 0.06128197908401489, 0.006087958812713623, 0.048594772815704346, 0.014085114002227783, 0.014620959758758545, 0.1734544038772583, 0.02054011821746826, 0.011593937873840332, 0.08183377981185913, 0.03231304883956909, 0.02066594362258911, 0.035165369510650635, 0.11460214853286743, 0.022439897060394287, 0.03425109386444092, 0.009771943092346191, 0.03370833396911621, 0.03634065389633179, 0.03241521120071411, 0.05859166383743286, 0.013192236423492432, 0.046988844871520996, 0.01014775037765503, 0.01579737663269043, 0.016207873821258545, 0.05141913890838623, 0.06450194120407104, 0.0009806156158447266, 0.03260904550552368, 0.08892571926116943, 0.07785266637802124, 0.006811738014221191, 0.09254193305969238, 0.04038339853286743, 0.024321675300598145, 0.04403311014175415, 0.029874444007873535, 0.054174959659576416, 0.07265377044677734, 0.07669317722320557, 0.06764346361160278, 0.016455411911010742, 0.049409568309783936, 0.01975083351135254, 0.039730191230773926, 0.11938983201980591, 0.042253971099853516, 0.04507416486740112, 0.05530959367752075, 0.037829697132110596, 0.08502691984176636, 0.005412757396697998, 0.017968595027923584, 0.08156174421310425, 0.07740336656570435, 0.1370563507080078, 0.0442776083946228, 0.03780019283294678, 0.16650056838989258, 0.04805588722229004, 0.2358185052871704, 0.0033313632011413574, 0.09273475408554077, 0.02777940034866333, 0.028338968753814697, 0.04760104417800903, 0.001192927360534668, 0.24741971492767334, 0.020823299884796143, 0.04850572347640991, 0.1308061182498932, 0.027649343013763428, 0.022492051124572754, 0.013981163501739502, 0.053871870040893555, 0.03224247694015503, 0.08135241270065308, 0.042336881160736084, 0.02302628755569458, 0.01812565326690674, 0.0372011661529541, 0.055803894996643066, 0.0020390748977661133, 0.0009185075759887695, 0.08862483501434326, 0.02670753002166748, 0.0467076301574707, 0.053635478019714355, 0.10824203491210938, 0.057627081871032715, 0.02852332592010498, 0.01339113712310791, 0.14069485664367676, 0.03158372640609741, 4.214048385620117e-05, 0.06637215614318848, 0.00211179256439209, 0.014641761779785156, 0.036328136920928955, 0.025313496589660645, 0.016776978969573975, 0.07899713516235352, 0.033985018730163574, 0.003209710121154785, 0.020193934440612793, 0.024402320384979248, 0.052541494369506836, 0.011434376239776611, 0.03365534543991089, 0.0042685866355896, 0.008298754692077637, 0.02803868055343628, 0.01063472032546997, 0.03402477502822876, 0.0028342604637145996, 0.03978759050369263, 0.04697716236114502, 0.02442532777786255, 0.08535516262054443, 0.03154563903808594, 0.008504271507263184, 0.03772580623626709, 0.043104350566864014, 0.016290903091430664, 0.030047059059143066, 0.04849344491958618, 0.022357165813446045, 0.07706111669540405]
error_signed : [-0.013672947883605957, 0.01964658498764038, -0.015853464603424072, -0.002536773681640625, -0.004095494747161865, 0.029592931270599365, -0.01603013277053833, -0.0262831449508667, 0.018943428993225098, 0.09062880277633667, 0.19457530975341797, 0.07922995090484619, -0.02007240056991577, 0.06153827905654907, 0.013345181941986084, -0.057310640811920166, 0.00811314582824707, 0.1253381371498108, -0.03328979015350342, 0.04338693618774414, -0.09387928247451782, 0.021490514278411865, -0.001198887825012207, -0.009473919868469238, 0.31741657853126526, 0.0897449254989624, -0.002569735050201416, 0.018490910530090332, -0.01715219020843506, 0.03023397922515869, 0.034489572048187256, 0.006196558475494385, -0.03601330518722534, -0.044580817222595215, -0.06720247864723206, -0.02848351001739502, 0.049811363220214844, -0.05198490619659424, 0.05930906534194946, 0.05733388662338257, -0.04087549448013306, -0.007979512214660645, 0.03603792190551758, -0.02039557695388794, -0.030993223190307617, -0.05383974313735962, -0.05946207046508789, -0.05226379632949829, 0.009396910667419434, -0.02672278881072998, -0.09634053707122803, -0.030119597911834717, 0.16052323579788208, 0.10116565227508545, 0.03848832845687866, 0.03409844636917114, -0.03033226728439331, 0.030446290969848633, 0.001664280891418457, 0.04645806550979614, 0.04045522212982178, 0.02366006374359131, -0.028917551040649414, -0.0007888078689575195, -0.06795579195022583, 0.036468327045440674, -0.05559748411178589, 0.09203511476516724, -0.020570576190948486, 0.025683104991912842, 0.061369240283966064, -0.010725736618041992, 0.021506011486053467, -0.07529246807098389, 0.02285069227218628, -0.0062566399574279785, 0.13133245706558228, 0.0884392261505127, -0.09164595603942871, -0.012265622615814209, 0.07575976848602295, -0.022516191005706787, -0.01144951581954956, 0.015354275703430176, -0.17260980606079102, 0.0115814208984375, 0.07005375623703003, 0.010295510292053223, 0.034300804138183594, -0.02519446611404419, -0.03245967626571655, 0.03407013416290283, 0.04144096374511719, -0.0074440836906433105, 0.004631400108337402, -0.04321664571762085, 0.23017501831054688, 0.02464693784713745, 0.04519987106323242, -0.04671493172645569, 0.03136485815048218, -0.0059209465980529785, 0.0017881393432617188, 0.2277626395225525, 0.09544545412063599, 0.05327075719833374, -0.023225486278533936, -0.009611904621124268, 0.021444261074066162, 0.07267874479293823, 0.0603371262550354, 0.7322378158569336, 0.012749135494232178, 0.010999500751495361, -0.04894411563873291, -0.008941650390625, -0.030554354190826416, 0.010318160057067871, -0.04796236753463745, -0.0039041638374328613, -0.029139816761016846, -0.005109608173370361, -0.0131416916847229, -0.0282323956489563, 0.15964412689208984, 0.013636171817779541, 0.009051024913787842, -0.020835399627685547, 0.0213700532913208, 0.006456971168518066, 0.009592592716217041, -0.004497051239013672, -0.0006974339485168457, 0.004053056240081787, -0.05397772789001465, 0.03952229022979736, -0.010669827461242676, -0.001228630542755127, 0.08199191093444824, 0.058676719665527344, -0.004805386066436768, -0.11755532026290894, 0.009106159210205078, -0.03903406858444214, 0.056070029735565186, -0.03480970859527588, 0.6472524255514145, -0.03985708951950073, -0.10015732049942017, -0.05863022804260254, 0.06345880031585693, 0.0011652112007141113, 0.046669602394104004, -0.098990797996521, -0.019654273986816406, -0.025193333625793457, 0.015004754066467285, -0.0612831711769104, -0.024442732334136963, -0.03353351354598999, 0.008258581161499023, 0.03712576627731323, -0.005673766136169434, 0.00174027681350708, -0.0247458815574646, 0.012479007244110107, 0.04112505912780762, 0.07316434383392334, 0.0026129484176635742, 0.04140669107437134, 0.043688178062438965, 0.00915437936782837, 0.0993075966835022, -0.03694421052932739, 0.036901891231536865, 0.019791066646575928, 0.0399172306060791, -0.03620445728302002, -0.030552327632904053, 0.05192148685455322, 0.2214820384979248, 0.08428066968917847, -0.04210090637207031, -0.03174710273742676, -0.013073384761810303, 0.051133573055267334, 0.043774306774139404, 0.026076853275299072, 0.016546130180358887, -0.042654573917388916, -0.06614726781845093, -0.10477876663208008, -0.011655688285827637, -0.06136801838874817, -0.015087902545928955, 0.0179559588432312, 0.08514672517776489, 0.03183281421661377, -0.01212453842163086, 0.17442047595977783, -0.034578561782836914, -0.021775901317596436, -0.0037366151809692383, 0.010879337787628174, 0.023944497108459473, -0.0669325590133667, 0.059203147888183594, -0.009559273719787598, 0.01735985279083252, -0.05450314283370972, 0.009341120719909668, 0.051182568073272705, -0.06802940368652344, 0.031777262687683105, 0.007179975509643555, 0.025983214378356934, -0.05104619264602661, -0.05902290344238281, -0.012674272060394287, 0.02824479341506958, 0.020572185516357422, 0.04211324453353882, 0.017012476921081543, 0.0474814772605896, 0.14009225368499756, -0.08770978450775146, 0.20645815134048462, 0.03612983226776123, -0.032008349895477295, -0.02132236957550049, -0.04746067523956299, 0.028911948204040527, -0.031868815422058105, 0.01489555835723877, -0.061700403690338135, 0.21300560235977173, -0.017072200775146484, -0.009791254997253418, -0.039772093296051025, -0.00273740291595459, -0.028151750564575195, 0.04894822835922241, 0.1170080304145813, -0.027792155742645264, -0.01839601993560791, 0.041261494159698486, 0.02314549684524536, 0.0339888334274292, 0.01845937967300415, -0.020124316215515137, -0.004607081413269043, -0.04433637857437134, 0.03588974475860596, -0.022210001945495605, 0.048288822174072266, 0.09740126132965088, -0.03145819902420044, 0.025174856185913086, -0.020160973072052002, 0.005794346332550049, 0.05498766899108887, 0.03896617889404297, 0.11596018075942993, -0.00760340690612793, -0.030352473258972168, -0.06933611631393433, 0.014206469058990479, 0.035598933696746826, 0.017255842685699463, -0.01139599084854126, 0.00868213176727295, 0.03467506170272827, 0.04913508892059326, -0.00853818655014038, -0.0326848030090332, -0.006670236587524414, -0.01934868097305298, -0.10862290859222412, -0.05981642007827759, -0.03430372476577759, 0.08886879682540894, -0.022008836269378662, 0.06836050748825073, -0.01699984073638916, 0.040791213512420654, -0.06145298480987549, 0.04855698347091675, -0.08777999877929688, 0.05294555425643921, 0.016944408416748047, -0.07089567184448242, -0.052432745695114136, -0.07966071367263794, 0.09376281499862671, -0.007384061813354492, 0.02064460515975952, -0.060286104679107666, -0.07547783851623535, 0.03174114227294922, 0.12271910905838013, 0.04719400405883789, 0.013118267059326172, 0.012250661849975586, -0.037880122661590576, 0.1186724305152893, -0.03100341558456421, 0.0481719970703125, 0.05062592029571533, 0.03592276573181152, -0.04978311061859131, -0.015119016170501709, 0.10194486379623413, 0.04416835308074951, 0.025535643100738525, 0.05098849534988403, 0.042771339416503906, -0.08376520872116089, 0.04637068510055542, 0.0010723471641540527, -0.049162864685058594, -0.040017008781433105, 0.026709258556365967, -0.055869460105895996, -0.03763139247894287, 0.06878155469894409, 0.00019866228103637695, -0.0650714635848999, -0.10010474920272827, -0.012325108051300049, -0.0372353196144104, 0.036700427532196045, -0.02677386999130249, 0.015915989875793457, 0.05619096755981445, 0.008764564990997314, -0.007071316242218018, 0.03503596782684326, 0.0005693435668945312, 0.02879089117050171, 0.051727890968322754, -0.025905489921569824, 0.018794238567352295, 0.022622406482696533, -0.0384291410446167, 0.10523068904876709, 0.0444374680519104, 0.023998498916625977, 0.022294223308563232, -0.1039724349975586, 0.034786224365234375, 0.21888214349746704, 0.259163498878479, -0.028910279273986816, -0.12435322999954224, -0.0549355149269104, -0.013987183570861816, -0.00854426622390747, 0.03347998857498169, 0.07469171285629272, 0.11810177564620972, 0.08051002025604248, 0.019188880920410156, -0.05925852060317993, -0.08892351388931274, -0.006535053253173828, 0.25707390904426575, -0.14015614986419678, 0.024923086166381836, -0.04743832349777222, -0.048673272132873535, 0.006435990333557129, -0.008791804313659668, 0.06128197908401489, 0.006087958812713623, 0.048594772815704346, -0.014085114002227783, 0.014620959758758545, -0.1734544038772583, -0.02054011821746826, 0.011593937873840332, 0.08183377981185913, -0.03231304883956909, 0.02066594362258911, -0.035165369510650635, 0.11460214853286743, 0.022439897060394287, 0.03425109386444092, 0.009771943092346191, -0.03370833396911621, 0.03634065389633179, 0.03241521120071411, 0.05859166383743286, 0.013192236423492432, -0.046988844871520996, 0.01014775037765503, -0.01579737663269043, -0.016207873821258545, -0.05141913890838623, -0.06450194120407104, -0.0009806156158447266, 0.03260904550552368, -0.08892571926116943, 0.07785266637802124, 0.006811738014221191, -0.09254193305969238, -0.04038339853286743, 0.024321675300598145, -0.04403311014175415, 0.029874444007873535, -0.054174959659576416, 0.07265377044677734, 0.07669317722320557, 0.06764346361160278, -0.016455411911010742, 0.049409568309783936, -0.01975083351135254, 0.039730191230773926, -0.11938983201980591, -0.042253971099853516, 0.04507416486740112, 0.05530959367752075, 0.037829697132110596, 0.08502691984176636, 0.005412757396697998, 0.017968595027923584, 0.08156174421310425, -0.07740336656570435, -0.1370563507080078, -0.0442776083946228, -0.03780019283294678, 0.16650056838989258, -0.04805588722229004, 0.2358185052871704, 0.0033313632011413574, 0.09273475408554077, 0.02777940034866333, -0.028338968753814697, -0.04760104417800903, -0.001192927360534668, 0.24741971492767334, -0.020823299884796143, -0.04850572347640991, -0.1308061182498932, -0.027649343013763428, 0.022492051124572754, -0.013981163501739502, -0.053871870040893555, -0.03224247694015503, 0.08135241270065308, -0.042336881160736084, -0.02302628755569458, 0.01812565326690674, -0.0372011661529541, -0.055803894996643066, -0.0020390748977661133, -0.0009185075759887695, -0.08862483501434326, 0.02670753002166748, -0.0467076301574707, 0.053635478019714355, 0.10824203491210938, -0.057627081871032715, 0.02852332592010498, 0.01339113712310791, 0.14069485664367676, 0.03158372640609741, 4.214048385620117e-05, 0.06637215614318848, -0.00211179256439209, -0.014641761779785156, -0.036328136920928955, -0.025313496589660645, -0.016776978969573975, -0.07899713516235352, 0.033985018730163574, 0.003209710121154785, -0.020193934440612793, 0.024402320384979248, 0.052541494369506836, 0.011434376239776611, -0.03365534543991089, -0.0042685866355896, 0.008298754692077637, 0.02803868055343628, 0.01063472032546997, 0.03402477502822876, 0.0028342604637145996, 0.03978759050369263, -0.04697716236114502, 0.02442532777786255, 0.08535516262054443, -0.03154563903808594, 0.008504271507263184, -0.03772580623626709, 0.043104350566864014, 0.016290903091430664, 0.030047059059143066, 0.04849344491958618, 0.022357165813446045, 0.07706111669540405]
error_mean : 4.807617428898811
error_mse : 0.23113185342651613
error_max : 73.22378158569336
error_min : 0.004214048385620117