LCPredict(
  (lin1): Linear(in_features=8, out_features=16, bias=True)
  (sig1): ReLU()
  (drp1): Dropout(p=0.3, inplace=False)
  (lin2): Linear(in_features=16, out_features=8, bias=True)
  (sig2): ReLU()
  (drp2): Dropout(p=0.2, inplace=False)
  (lin3): Linear(in_features=8, out_features=1, bias=True)
  (sig3): ReLU()
)
optimizer : adam, lr : 0.002
epochs : 100
batch size : 8
loss : [0.05385982245206833, 0.0284422617405653, 0.09515892714262009, 0.028970571234822273, 0.05416017770767212, 0.008976677432656288, 0.025115907192230225, 0.014436673372983932, 0.009518940933048725, 0.005665137432515621, 0.027757298201322556, 0.004343838896602392, 0.00638957042247057, 0.004080835729837418, 0.008965314365923405, 0.011687900871038437, 0.006169590167701244, 0.012253206223249435, 0.0034930664114654064, 0.0024599325843155384, 0.002064746106043458, 0.002810670528560877, 0.0008442429825663567, 0.002520838286727667, 0.001589945750311017, 0.001928379526361823, 0.004092923365533352, 0.0013406805228441954, 0.0022145097609609365, 0.0018879519775509834, 0.00327555020339787, 0.0016544178361073136, 0.003948318772017956, 0.005546264350414276, 0.0018887748010456562, 0.0016385617200285196, 0.0018382725538685918, 0.0017010685987770557, 0.002665309701114893, 0.003490268252789974, 0.003568810410797596, 0.0014613568782806396, 0.004467511083930731, 0.001079196692444384, 0.0008382822852581739, 0.0024929691571742296, 0.001729179872199893, 0.0015869593480601907, 0.0013170796446502209, 0.003269592998549342, 0.0008773175068199635, 0.0030402657575905323, 0.006738804280757904, 0.004525910597294569, 0.003471145872026682, 0.0016415286809206009, 0.002084332751110196, 0.0024244890082627535, 0.0035117268562316895, 0.006440881639719009, 0.0034330689813941717, 0.004680290352553129, 0.0017871711170300841, 0.0028832301031798124, 0.0035685435868799686, 0.0038441820070147514, 0.005686124786734581, 0.001641457318328321, 0.0014167248737066984, 0.0007579761440865695, 0.0036655848380178213, 0.0029020956717431545, 0.0030498243868350983, 0.005071091465651989, 0.004982427228242159, 0.004570952616631985, 0.0019601613748818636, 0.004690660163760185, 0.002689732238650322, 0.00188426673412323, 0.0014168636407703161, 0.002343625295907259, 0.0004848024109378457, 0.0005474317586049438, 0.0016658876556903124, 0.0017414530739188194, 0.004756184294819832, 0.0018504250328987837, 0.0021715634502470493, 0.00304915988817811, 0.0006804957520216703, 0.0011484632268548012, 0.005012182984501123, 0.0022220085375010967, 0.0030739984940737486, 0.0017757760360836983, 0.0014944240683689713, 0.0023956461809575558, 0.0025905994698405266, 0.000350718735717237]
error_abs : [0.028510212898254395, 0.01754051446914673, 0.008420884609222412, 0.005275368690490723, 0.02700561285018921, 0.028875231742858887, 0.04255211353302002, 0.03365063667297363, 0.022523105144500732, 0.04393124580383301, 0.002839386463165283, 0.03487366437911987, 0.031226515769958496, 0.06143981218338013, 0.02939438819885254, 0.04990297555923462, 0.01229637861251831, 0.1771705150604248, 0.02623063325881958, 0.04969966411590576, 0.04438894987106323, 0.015045762062072754, 0.05500370264053345, 0.05279743671417236, 0.041325539350509644, 0.004815042018890381, 0.033395469188690186, 0.011402368545532227, 0.021017074584960938, 0.0024219751358032227, 0.05227470397949219, 0.020246922969818115, 6.556510925292969e-06, 0.024309873580932617, 0.1972408890724182, 0.014948129653930664, 0.02003026008605957, 0.0228615403175354, 0.021437644958496094, 0.014299273490905762, 0.015057027339935303, 0.03570747375488281, 0.03873330354690552, 0.011754870414733887, 0.04451024532318115, 0.05499422550201416, 0.007199645042419434, 0.004424154758453369, 0.07808142900466919, 0.05999785661697388, 0.07512396574020386, 0.021444320678710938, 0.02048468589782715, 0.033586204051971436, 0.12973201274871826, 0.06290197372436523, 0.00779414176940918, 0.069485604763031, 0.08076995611190796, 0.0014491081237792969, 0.012140274047851562, 0.0076950788497924805, 0.0029840469360351562, 0.0019408464431762695, 0.0100136399269104, 0.032300353050231934, 0.005153000354766846, 0.0344548225402832, 0.10731172561645508, 0.04007214307785034, 0.004730582237243652, 0.044654130935668945, 0.0028812289237976074, 0.17310866713523865, 0.03987932205200195, 0.06387919187545776, 0.14661568403244019, 0.059310078620910645, 0.03944343328475952, 0.03881430625915527, 0.007000088691711426, 0.05689507722854614, 0.0017107725143432617, 0.05260348320007324, 0.03181648254394531, 0.05100053548812866, 0.06974214315414429, 0.058692753314971924, 0.0348055362701416, 0.045015573501586914, 0.003903508186340332, 0.014504969120025635, 0.05560493469238281, 0.023188471794128418, 0.047157883644104004, 0.0292205810546875, 0.021182537078857422, 0.08781695365905762, 0.006932318210601807, 0.14962255954742432, 0.008793234825134277, 0.024797797203063965, 0.02380239963531494, 0.14710640907287598, 0.08450192213058472, 0.010841846466064453, 0.002492547035217285, 0.0029177069664001465, 0.030238330364227295, 0.023687124252319336, 0.07403123378753662, 0.7496829628944397, 0.010060429573059082, 0.04172712564468384, 0.026031553745269775, 0.04053759574890137, 0.011732816696166992, 0.022706270217895508, 0.012567341327667236, 0.00928795337677002, 0.02392357587814331, 0.0206415057182312, 0.03831130266189575, 0.014778554439544678, 0.11430144309997559, 0.054567158222198486, 0.03383219242095947, 0.032249271869659424, 0.005702495574951172, 0.022593677043914795, 0.03747683763504028, 0.009927511215209961, 0.004375338554382324, 0.09247934818267822, 0.040326595306396484, 0.1079854965209961, 0.03412270545959473, 0.0009672641754150391, 0.08920234441757202, 0.03373533487319946, 0.036546945571899414, 0.0787588357925415, 0.024295032024383545, 0.0728381872177124, 0.005721330642700195, 0.03514772653579712, 0.0036352425813674927, 0.024425268173217773, 0.025399088859558105, 0.07158541679382324, 0.06370049715042114, 0.02446538209915161, 0.06683379411697388, 0.03278052806854248, 0.01506054401397705, 0.03233671188354492, 0.020907163619995117, 0.011766374111175537, 0.007948517799377441, 0.032406628131866455, 0.07549113035202026, 0.0635979175567627, 0.003753483295440674, 0.022541522979736328, 0.05501002073287964, 0.008180975914001465, 0.04451686143875122, 0.03813987970352173, 0.009757816791534424, 0.012538254261016846, 0.01786571741104126, 0.017541110515594482, 0.09276992082595825, 0.0386127233505249, 0.014458954334259033, 0.005225956439971924, 0.020684540271759033, 0.016637682914733887, 0.039032936096191406, 0.009801924228668213, 0.10822582244873047, 0.049475669860839844, 0.007442474365234375, 0.06213998794555664, 0.0010874271392822266, 0.06097865104675293, 0.02012646198272705, 0.062135279178619385, 0.038566410541534424, 0.004896283149719238, 0.0017257332801818848, 0.039277613162994385, 0.038978397846221924, 0.02554529905319214, 0.06382560729980469, 0.0030420422554016113, 0.051055848598480225, 0.045952796936035156, 0.028137147426605225, 0.05411028861999512, 0.02565532922744751, 0.0016470551490783691, 0.041760802268981934, 0.004771590232849121, 0.030991077423095703, 0.025014162063598633, 0.038710951805114746, 0.03605484962463379, 0.04272562265396118, 0.013781845569610596, 0.014558792114257812, 0.06987476348876953, 0.023882746696472168, 0.06909018754959106, 0.03839468955993652, 0.03922879695892334, 0.019214093685150146, 0.0011448264122009277, 0.024504482746124268, 0.11044955253601074, 0.0010880827903747559, 0.042548179626464844, 0.035426974296569824, 0.010774493217468262, 0.08202201128005981, 0.0028724074363708496, 0.10630512237548828, 0.016880035400390625, 0.022127389907836914, 0.013434290885925293, 0.004443824291229248, 0.011619269847869873, 0.029403984546661377, 0.00369870662689209, 0.0031821727752685547, 0.07977226376533508, 0.012630701065063477, 0.031305789947509766, 0.043786585330963135, 0.028780817985534668, 0.062249183654785156, 0.008343756198883057, 0.04842931032180786, 0.004114091396331787, 0.20376089215278625, 0.0319862961769104, 0.0033845901489257812, 0.03596150875091553, 0.008916974067687988, 0.044228553771972656, 0.01662963628768921, 0.020643532276153564, 0.10038286447525024, 0.013243436813354492, 2.5212764739990234e-05, 0.00989919900894165, 0.0023227334022521973, 0.07697749137878418, 0.011142313480377197, 0.017738819122314453, 0.031566083431243896, 0.03586626052856445, 0.1421622633934021, 0.011597156524658203, 0.011861026287078857, 0.009829282760620117, 0.012124478816986084, 0.03454756736755371, 0.09030646085739136, 0.008771538734436035, 0.05938732624053955, 0.1338532567024231, 0.08484792709350586, 0.03409755229949951, 0.06837058067321777, 0.0059844255447387695, 0.06053048372268677, 0.007875978946685791, 0.03598511219024658, 0.040466368198394775, 0.03678053617477417, 0.050482988357543945, 0.054071784019470215, 0.024188876152038574, 0.03044760227203369, 0.007042586803436279, 0.013242244720458984, 0.005527079105377197, 0.04127013683319092, 0.0046250224113464355, 0.004929959774017334, 0.013031423091888428, 0.03405642509460449, 0.0597798228263855, 0.0065765380859375, 0.026301980018615723, 0.008022964000701904, 0.010145783424377441, 0.017886638641357422, 0.0008228421211242676, 0.03675687313079834, 0.007230639457702637, 0.0036254525184631348, 0.038956642150878906, 0.05418521165847778, 0.007123708724975586, 0.013293087482452393, 0.05286276340484619, 0.046361446380615234, 0.014827430248260498, 0.031357526779174805, 0.054090142250061035, 0.1684170961380005, 0.027478694915771484, 0.009791314601898193, 0.011010289192199707, 0.03384596109390259, 0.05559903383255005, 0.0021709799766540527, 0.025129735469818115, 0.007032990455627441, 0.041636884212493896, 0.03867381811141968, 0.04496753215789795, 0.01033395528793335, 0.012439191341400146, 0.014902889728546143, 0.06359374523162842, 0.007684826850891113, 0.03756362199783325, 0.0006399750709533691, 0.011874616146087646, 0.0033152103424072266, 0.04400467872619629, 0.0017521381378173828, 0.007373690605163574, 0.032762110233306885, 0.005674123764038086, 0.006753981113433838, 0.009642601013183594, 0.04945707321166992, 0.020222485065460205, 0.038207411766052246, 0.023292899131774902, 0.00903940200805664, 0.012166261672973633, 0.00738149881362915, 0.003779292106628418, 0.02620333433151245, 0.04348474740982056, 0.011896073818206787, 0.12293773889541626, 0.045219600200653076, 0.009534180164337158, 0.02712249755859375, 0.06388521194458008, 0.04466921091079712, 0.041049420833587646, 0.01866447925567627, 0.07447105646133423, 0.06136113405227661, 0.0016155838966369629, 0.04330986738204956, 0.010225951671600342, 0.07061415910720825, 0.09382635354995728, 0.015173554420471191, 0.024515092372894287, 0.01840376853942871, 0.06526404619216919, 0.019282221794128418, 0.0009552836418151855, 0.028235971927642822, 0.04855763912200928, 0.019700944423675537, 0.01481938362121582, 0.024041056632995605, 0.04805940389633179, 0.029214203357696533, 0.0024875998497009277, 0.020059049129486084, 0.025455713272094727, 0.05401712656021118, 0.041450321674346924, 0.4640015661716461, 0.0008426904678344727, 0.013578414916992188, 0.0062680840492248535, 0.07651573419570923, 0.011416494846343994, 0.01805400848388672, 0.03626251220703125, 0.03913480043411255, 0.05743598937988281, 0.000758826732635498, 0.08014672994613647, 0.028698265552520752, 0.09713363647460938, 0.0013478398323059082, 0.019421875476837158, 0.029881775379180908, 0.01912105083465576, 0.035588860511779785, 0.08115959167480469, 0.04718494415283203, 0.04026240110397339, 0.048902809619903564, 0.02837294340133667, 0.010158181190490723, 0.0018028020858764648, 0.05739307403564453, 0.02239704132080078, 0.036257803440093994, 0.04922127723693848, 0.018414795398712158, 0.02213883399963379, 0.03469443321228027, 0.04794794321060181, 0.07092183828353882, 0.004908204078674316, 0.026200413703918457, 0.014673888683319092, 0.0827627182006836, 0.008138895034790039, 0.040874481201171875, 0.00806570053100586, 0.0034850239753723145, 0.018012642860412598, 0.012909352779388428, 0.028108417987823486, 0.12234210968017578, 0.019712209701538086, 0.06207871437072754, 0.1159510612487793, 0.035057902336120605, 0.00519561767578125, 0.02699941396713257, 0.01869487762451172, 0.01526486873626709, 0.04322320222854614, 0.059370219707489014, 0.006846487522125244, 0.04533040523529053, 0.0728413462638855, 0.022857666015625, 0.06032156944274902, 0.10213339328765869, 0.011875152587890625, 0.028540194034576416, 0.004349946975708008, 0.05501151084899902, 0.034528255462646484, 0.013911962509155273, 0.001816868782043457, 0.04146534204483032, 0.060485899448394775, 0.024053871631622314, 0.03190106153488159, 0.09368467330932617, 0.08338946104049683, 0.10021835565567017, 0.02412790060043335, 0.02998638153076172, 0.025955915451049805, 0.08206218481063843, 0.011834442615509033, 0.02187800407409668, 0.025577783584594727, 0.0363427996635437, 0.040346384048461914, 0.022404372692108154, 0.006030857563018799, 0.010946035385131836, 0.017808616161346436, 0.05397987365722656, 0.02990347146987915, 0.08762615919113159, 0.0024986863136291504, 0.05063974857330322, 0.0022963285446166992, 0.007515847682952881, 0.003362298011779785, 0.013232111930847168, 0.005419731140136719, 0.0432170033454895, 0.0012332797050476074, 0.040133655071258545, 0.006351828575134277, 0.02769690752029419, 0.02682971954345703, 0.03834569454193115, 0.02518761157989502, 0.031652092933654785, 0.14069896936416626, 0.004897594451904297, 0.04720938205718994, 0.13152003288269043, 0.024818480014801025, 0.10081005096435547, 0.03200852870941162]
error_signed : [0.028510212898254395, 0.01754051446914673, -0.008420884609222412, 0.005275368690490723, 0.02700561285018921, 0.028875231742858887, -0.04255211353302002, 0.03365063667297363, -0.022523105144500732, 0.04393124580383301, -0.002839386463165283, 0.03487366437911987, 0.031226515769958496, 0.06143981218338013, 0.02939438819885254, -0.04990297555923462, 0.01229637861251831, 0.1771705150604248, 0.02623063325881958, 0.04969966411590576, 0.04438894987106323, 0.015045762062072754, 0.05500370264053345, -0.05279743671417236, 0.041325539350509644, -0.004815042018890381, 0.033395469188690186, -0.011402368545532227, 0.021017074584960938, -0.0024219751358032227, 0.05227470397949219, 0.020246922969818115, 6.556510925292969e-06, -0.024309873580932617, 0.1972408890724182, 0.014948129653930664, -0.02003026008605957, 0.0228615403175354, 0.021437644958496094, 0.014299273490905762, 0.015057027339935303, 0.03570747375488281, 0.03873330354690552, -0.011754870414733887, 0.04451024532318115, 0.05499422550201416, 0.007199645042419434, -0.004424154758453369, -0.07808142900466919, 0.05999785661697388, -0.07512396574020386, 0.021444320678710938, 0.02048468589782715, 0.033586204051971436, 0.12973201274871826, 0.06290197372436523, -0.00779414176940918, 0.069485604763031, 0.08076995611190796, 0.0014491081237792969, 0.012140274047851562, -0.0076950788497924805, -0.0029840469360351562, -0.0019408464431762695, 0.0100136399269104, -0.032300353050231934, 0.005153000354766846, 0.0344548225402832, 0.10731172561645508, 0.04007214307785034, -0.004730582237243652, 0.044654130935668945, -0.0028812289237976074, -0.17310866713523865, 0.03987932205200195, -0.06387919187545776, 0.14661568403244019, 0.059310078620910645, -0.03944343328475952, 0.03881430625915527, 0.007000088691711426, -0.05689507722854614, 0.0017107725143432617, 0.05260348320007324, 0.03181648254394531, 0.05100053548812866, 0.06974214315414429, -0.058692753314971924, -0.0348055362701416, 0.045015573501586914, -0.003903508186340332, -0.014504969120025635, 0.05560493469238281, -0.023188471794128418, -0.047157883644104004, -0.0292205810546875, -0.021182537078857422, 0.08781695365905762, 0.006932318210601807, 0.14962255954742432, 0.008793234825134277, 0.024797797203063965, -0.02380239963531494, 0.14710640907287598, 0.08450192213058472, 0.010841846466064453, -0.002492547035217285, -0.0029177069664001465, 0.030238330364227295, 0.023687124252319336, 0.07403123378753662, 0.7496829628944397, 0.010060429573059082, 0.04172712564468384, -0.026031553745269775, 0.04053759574890137, 0.011732816696166992, -0.022706270217895508, -0.012567341327667236, -0.00928795337677002, -0.02392357587814331, -0.0206415057182312, 0.03831130266189575, 0.014778554439544678, 0.11430144309997559, 0.054567158222198486, 0.03383219242095947, 0.032249271869659424, -0.005702495574951172, 0.022593677043914795, 0.03747683763504028, -0.009927511215209961, -0.004375338554382324, -0.09247934818267822, 0.040326595306396484, 0.1079854965209961, -0.03412270545959473, -0.0009672641754150391, 0.08920234441757202, -0.03373533487319946, -0.036546945571899414, -0.0787588357925415, -0.024295032024383545, 0.0728381872177124, -0.005721330642700195, 0.03514772653579712, -0.0036352425813674927, -0.024425268173217773, -0.025399088859558105, 0.07158541679382324, 0.06370049715042114, 0.02446538209915161, 0.06683379411697388, -0.03278052806854248, 0.01506054401397705, 0.03233671188354492, 0.020907163619995117, 0.011766374111175537, 0.007948517799377441, 0.032406628131866455, 0.07549113035202026, 0.0635979175567627, 0.003753483295440674, 0.022541522979736328, -0.05501002073287964, 0.008180975914001465, 0.04451686143875122, 0.03813987970352173, -0.009757816791534424, -0.012538254261016846, 0.01786571741104126, 0.017541110515594482, 0.09276992082595825, -0.0386127233505249, -0.014458954334259033, 0.005225956439971924, 0.020684540271759033, -0.016637682914733887, 0.039032936096191406, -0.009801924228668213, 0.10822582244873047, -0.049475669860839844, -0.007442474365234375, 0.06213998794555664, -0.0010874271392822266, 0.06097865104675293, 0.02012646198272705, 0.062135279178619385, 0.038566410541534424, 0.004896283149719238, -0.0017257332801818848, -0.039277613162994385, 0.038978397846221924, -0.02554529905319214, -0.06382560729980469, 0.0030420422554016113, 0.051055848598480225, 0.045952796936035156, 0.028137147426605225, 0.05411028861999512, -0.02565532922744751, 0.0016470551490783691, 0.041760802268981934, 0.004771590232849121, -0.030991077423095703, -0.025014162063598633, -0.038710951805114746, 0.03605484962463379, -0.04272562265396118, -0.013781845569610596, 0.014558792114257812, -0.06987476348876953, -0.023882746696472168, 0.06909018754959106, 0.03839468955993652, -0.03922879695892334, -0.019214093685150146, 0.0011448264122009277, 0.024504482746124268, 0.11044955253601074, 0.0010880827903747559, 0.042548179626464844, 0.035426974296569824, 0.010774493217468262, 0.08202201128005981, -0.0028724074363708496, 0.10630512237548828, 0.016880035400390625, 0.022127389907836914, 0.013434290885925293, -0.004443824291229248, 0.011619269847869873, -0.029403984546661377, 0.00369870662689209, 0.0031821727752685547, -0.07977226376533508, -0.012630701065063477, 0.031305789947509766, -0.043786585330963135, 0.028780817985534668, 0.062249183654785156, 0.008343756198883057, 0.04842931032180786, 0.004114091396331787, -0.20376089215278625, 0.0319862961769104, -0.0033845901489257812, 0.03596150875091553, 0.008916974067687988, 0.044228553771972656, 0.01662963628768921, 0.020643532276153564, -0.10038286447525024, 0.013243436813354492, -2.5212764739990234e-05, 0.00989919900894165, 0.0023227334022521973, 0.07697749137878418, 0.011142313480377197, 0.017738819122314453, 0.031566083431243896, 0.03586626052856445, -0.1421622633934021, 0.011597156524658203, 0.011861026287078857, -0.009829282760620117, 0.012124478816986084, 0.03454756736755371, 0.09030646085739136, 0.008771538734436035, 0.05938732624053955, 0.1338532567024231, 0.08484792709350586, -0.03409755229949951, -0.06837058067321777, 0.0059844255447387695, 0.06053048372268677, 0.007875978946685791, 0.03598511219024658, 0.040466368198394775, 0.03678053617477417, -0.050482988357543945, 0.054071784019470215, -0.024188876152038574, 0.03044760227203369, 0.007042586803436279, 0.013242244720458984, -0.005527079105377197, 0.04127013683319092, 0.0046250224113464355, -0.004929959774017334, -0.013031423091888428, 0.03405642509460449, 0.0597798228263855, -0.0065765380859375, 0.026301980018615723, 0.008022964000701904, 0.010145783424377441, 0.017886638641357422, 0.0008228421211242676, 0.03675687313079834, 0.007230639457702637, 0.0036254525184631348, 0.038956642150878906, 0.05418521165847778, 0.007123708724975586, 0.013293087482452393, 0.05286276340484619, 0.046361446380615234, -0.014827430248260498, 0.031357526779174805, 0.054090142250061035, 0.1684170961380005, 0.027478694915771484, 0.009791314601898193, -0.011010289192199707, -0.03384596109390259, 0.05559903383255005, 0.0021709799766540527, -0.025129735469818115, 0.007032990455627441, 0.041636884212493896, -0.03867381811141968, -0.04496753215789795, 0.01033395528793335, -0.012439191341400146, -0.014902889728546143, 0.06359374523162842, 0.007684826850891113, 0.03756362199783325, -0.0006399750709533691, 0.011874616146087646, -0.0033152103424072266, 0.04400467872619629, -0.0017521381378173828, -0.007373690605163574, -0.032762110233306885, 0.005674123764038086, -0.006753981113433838, 0.009642601013183594, 0.04945707321166992, 0.020222485065460205, 0.038207411766052246, -0.023292899131774902, 0.00903940200805664, 0.012166261672973633, -0.00738149881362915, -0.003779292106628418, -0.02620333433151245, 0.04348474740982056, -0.011896073818206787, 0.12293773889541626, 0.045219600200653076, -0.009534180164337158, -0.02712249755859375, 0.06388521194458008, 0.04466921091079712, 0.041049420833587646, 0.01866447925567627, 0.07447105646133423, -0.06136113405227661, -0.0016155838966369629, -0.04330986738204956, -0.010225951671600342, 0.07061415910720825, 0.09382635354995728, -0.015173554420471191, -0.024515092372894287, 0.01840376853942871, 0.06526404619216919, 0.019282221794128418, 0.0009552836418151855, 0.028235971927642822, 0.04855763912200928, 0.019700944423675537, 0.01481938362121582, 0.024041056632995605, -0.04805940389633179, 0.029214203357696533, 0.0024875998497009277, 0.020059049129486084, -0.025455713272094727, 0.05401712656021118, 0.041450321674346924, 0.4640015661716461, 0.0008426904678344727, -0.013578414916992188, 0.0062680840492248535, -0.07651573419570923, -0.011416494846343994, 0.01805400848388672, 0.03626251220703125, 0.03913480043411255, 0.05743598937988281, 0.000758826732635498, -0.08014672994613647, -0.028698265552520752, -0.09713363647460938, -0.0013478398323059082, -0.019421875476837158, 0.029881775379180908, -0.01912105083465576, -0.035588860511779785, 0.08115959167480469, -0.04718494415283203, 0.04026240110397339, 0.048902809619903564, -0.02837294340133667, 0.010158181190490723, 0.0018028020858764648, 0.05739307403564453, 0.02239704132080078, 0.036257803440093994, 0.04922127723693848, -0.018414795398712158, 0.02213883399963379, 0.03469443321228027, -0.04794794321060181, 0.07092183828353882, -0.004908204078674316, 0.026200413703918457, 0.014673888683319092, 0.0827627182006836, -0.008138895034790039, 0.040874481201171875, 0.00806570053100586, 0.0034850239753723145, -0.018012642860412598, 0.012909352779388428, -0.028108417987823486, 0.12234210968017578, -0.019712209701538086, 0.06207871437072754, 0.1159510612487793, 0.035057902336120605, 0.00519561767578125, 0.02699941396713257, -0.01869487762451172, 0.01526486873626709, 0.04322320222854614, 0.059370219707489014, -0.006846487522125244, 0.04533040523529053, 0.0728413462638855, 0.022857666015625, 0.06032156944274902, -0.10213339328765869, 0.011875152587890625, 0.028540194034576416, -0.004349946975708008, 0.05501151084899902, 0.034528255462646484, 0.013911962509155273, 0.001816868782043457, -0.04146534204483032, 0.060485899448394775, -0.024053871631622314, 0.03190106153488159, -0.09368467330932617, 0.08338946104049683, 0.10021835565567017, 0.02412790060043335, 0.02998638153076172, -0.025955915451049805, 0.08206218481063843, 0.011834442615509033, 0.02187800407409668, 0.025577783584594727, 0.0363427996635437, -0.040346384048461914, -0.022404372692108154, -0.006030857563018799, 0.010946035385131836, 0.017808616161346436, 0.05397987365722656, -0.02990347146987915, -0.08762615919113159, 0.0024986863136291504, -0.05063974857330322, 0.0022963285446166992, 0.007515847682952881, 0.003362298011779785, 0.013232111930847168, -0.005419731140136719, -0.0432170033454895, -0.0012332797050476074, 0.040133655071258545, 0.006351828575134277, -0.02769690752029419, -0.02682971954345703, -0.03834569454193115, -0.02518761157989502, -0.031652092933654785, -0.14069896936416626, 0.004897594451904297, 0.04720938205718994, -0.13152003288269043, -0.024818480014801025, 0.10081005096435547, 0.03200852870941162]
error_mean : 3.753647646307946
error_mse : 0.1408987065263318
error_max : 74.96829628944397
error_min : 0.0006556510925292969