LCPredict(
  (lin1): Linear(in_features=8, out_features=16, bias=True)
  (sig1): ReLU()
  (drp1): Dropout(p=0.3, inplace=False)
  (lin2): Linear(in_features=16, out_features=8, bias=True)
  (sig2): ReLU()
  (drp2): Dropout(p=0.2, inplace=False)
  (lin3): Linear(in_features=8, out_features=1, bias=True)
  (sig3): ReLU()
)
optimizer : adam, lr : 0.002
epochs : 100
batch size : 8
loss : [0.02001754194498062, 0.025137927383184433, 0.005284849554300308, 0.012114414945244789, 0.007071041036397219, 0.013701898977160454, 0.004159835167229176, 0.007478419225662947, 0.003850731998682022, 0.003461405634880066, 0.006768310908228159, 0.002265757881104946, 0.002471801359206438, 0.005120310001075268, 0.00608997605741024, 0.0029413606971502304, 0.00528578320518136, 0.0054371654987335205, 0.0013874656287953258, 0.0019506143871694803, 0.0028032129630446434, 0.0012988257221877575, 0.0016794356051832438, 0.005179847590625286, 0.0021028488408774137, 0.0015371969202533364, 0.005084055010229349, 0.006335127167403698, 0.0004074524331372231, 0.0008276394219137728, 0.007054271642118692, 0.0018017629627138376, 0.0008382170926779509, 0.0004055988392792642, 0.001376805012114346, 0.001682387082837522, 0.0014148345217108727, 0.00277446280233562, 0.0014991438947618008, 0.0026901455130428076, 0.0003414793754927814, 0.0036257426254451275, 0.0017462663818150759, 0.0013194521889090538, 0.006008143536746502, 0.0005804999964311719, 0.0011182567104697227, 0.004245961084961891, 0.0014325352385640144, 0.0014148910995572805, 0.003285159356892109, 0.0030428548343479633, 0.0016243448480963707, 0.0008741582278162241, 0.0009349037427455187, 0.001143463421612978, 0.002016148529946804, 0.0009331830078735948, 0.0014030098682269454, 0.0007546906708739698, 0.002527921460568905, 0.00024610530817881227, 0.001741733169183135, 0.0015856168465688825, 0.0011518837418407202, 0.0010635453509166837, 0.00041127100121229887, 0.0005823451210744679, 0.0022951795253902674, 0.0008457946823909879, 0.0010225092992186546, 0.0013932831352576613, 0.0027690704446285963, 0.003116751555353403, 0.0018274595495313406, 0.0015435779932886362, 0.0026753481943160295, 0.00038257165579125285, 0.002707461128011346, 0.0013642121339216828, 0.002482063602656126, 0.006131209898740053, 0.0006159941549412906, 0.0021759949158877134, 0.003994653932750225, 0.005058595910668373, 0.0026626845356076956, 0.0020159422419965267, 0.0014614309184253216, 0.0004932727315463126, 0.0008518852409906685, 0.0017678821459412575, 0.001030387356877327, 0.0008542389841750264, 0.0010381913743913174, 0.0007046239916235209, 0.00650887843221426, 0.0013334080576896667, 0.0024045242462307215, 0.0011794151505455375]
error_abs : [0.034085214138031006, 0.027685105800628662, 0.07566946744918823, 0.0028328299522399902, 0.007653236389160156, 0.0010246038436889648, 0.025988638401031494, 0.028783142566680908, 0.015150725841522217, 0.06046903133392334, 0.12045556306838989, 0.13267141580581665, 0.017741501331329346, 0.05264848470687866, 0.005046188831329346, 0.034744203090667725, 0.04318642616271973, 0.07899236679077148, 0.006013333797454834, 0.024095475673675537, 0.027104616165161133, 0.0036927461624145508, 0.030435919761657715, 0.029062271118164062, 0.04014992713928223, 0.02946239709854126, 0.02315586805343628, 0.010809183120727539, 0.014489710330963135, 0.05432051420211792, 0.022541821002960205, 0.04060542583465576, 0.028525829315185547, 0.003685593605041504, 0.1970783770084381, 0.0010068416595458984, 0.031115233898162842, 0.008526325225830078, 0.04033321142196655, 0.028816640377044678, 0.013493239879608154, 0.01526796817779541, 0.018471360206604004, 0.03182917833328247, 0.017808854579925537, 0.037211596965789795, 0.10664665699005127, 0.0394212007522583, 0.004768013954162598, 0.027828872203826904, 0.0904882550239563, 0.024024367332458496, 0.06561613082885742, 0.09955590963363647, 0.06184333562850952, 0.00019913911819458008, 0.09508615732192993, 0.047411561012268066, 0.03521794080734253, 0.009837567806243896, 0.01417618989944458, 0.009683430194854736, 0.0005404949188232422, 0.009818315505981445, 0.00031763315200805664, 0.018745720386505127, 0.02264571189880371, 0.048370420932769775, 0.04341799020767212, 0.02381652593612671, 0.020445406436920166, 0.05184340476989746, 0.03134828805923462, 0.052345216274261475, 0.016655683517456055, 0.045920372009277344, 0.17206144332885742, 0.04323709011077881, 0.009150922298431396, 0.0730283260345459, 0.00229644775390625, 0.0066672563552856445, 0.004717588424682617, 0.012319386005401611, 0.044683992862701416, 0.011390268802642822, 0.007725417613983154, 0.008348703384399414, 0.03498959541320801, 0.01520615816116333, 0.020060718059539795, 0.001293778419494629, 0.030662953853607178, 0.030436396598815918, 0.0225982666015625, 0.039698779582977295, 0.0005843639373779297, 0.2502639591693878, 0.0022312402725219727, 0.09209543466567993, 0.049295783042907715, 0.042225003242492676, 0.0031676888465881348, 0.14160162210464478, 0.008251190185546875, 0.002883613109588623, 0.008983314037322998, 0.019362449645996094, 0.013457834720611572, 0.06256437301635742, 0.026554346084594727, 0.22592216730117798, 0.02931511402130127, 0.08053958415985107, 0.04815673828125, 0.0366053581237793, 0.015332937240600586, 0.00318223237991333, 0.01358729600906372, 0.01748979091644287, 0.033909618854522705, 0.009760737419128418, 0.018159091472625732, 0.01966780424118042, 0.09033066034317017, 0.0019121170043945312, 0.022748827934265137, 0.04822647571563721, 0.006947219371795654, 0.002110898494720459, 0.04253333806991577, 0.00826263427734375, 0.005331695079803467, 0.012807965278625488, 0.019686639308929443, 0.16558372974395752, 0.04274320602416992, 0.0270766019821167, 0.004456520080566406, 0.030675053596496582, 0.013114094734191895, 0.01187056303024292, 0.017140448093414307, 0.004647314548492432, 0.015433311462402344, 0.009341180324554443, 0.19777344167232513, 0.008872449398040771, 0.014343440532684326, 0.010293781757354736, 0.037733256816864014, 0.0008364319801330566, 0.0767548680305481, 0.031300365924835205, 0.010781526565551758, 0.011261582374572754, 0.0020389556884765625, 0.0053577423095703125, 0.013557672500610352, 0.043304622173309326, 0.026744842529296875, 0.0005922317504882812, 0.006460666656494141, 0.01725715398788452, 0.024794459342956543, 0.00943368673324585, 0.0294649600982666, 0.007013201713562012, 0.004254281520843506, 0.010893046855926514, 0.036461830139160156, 0.0014607906341552734, 0.10078239440917969, 0.07840919494628906, 0.014233589172363281, 0.0065323710441589355, 0.013940274715423584, 0.007965147495269775, 0.03250241279602051, 0.027619123458862305, 0.06726807355880737, 0.00521475076675415, 0.0025117993354797363, 0.006728827953338623, 0.00889575481414795, 0.2619094252586365, 0.016074001789093018, 0.009344637393951416, 0.02533566951751709, 0.021090388298034668, 0.03528875112533569, 0.048507750034332275, 0.02513885498046875, 0.3210243582725525, 0.03875470161437988, 0.009199559688568115, 0.04210317134857178, 0.023801743984222412, 0.007426321506500244, 0.0993087887763977, 0.005992889404296875, 0.04736495018005371, 0.005125701427459717, 0.009106278419494629, 0.0806007981300354, 0.00485074520111084, 0.05210769176483154, 0.020680248737335205, 0.06399780511856079, 0.024938344955444336, 0.0023137331008911133, 0.00974571704864502, 0.004136860370635986, 0.008064627647399902, 0.018177390098571777, 0.06997334957122803, 0.024094998836517334, 0.005394101142883301, 0.011272549629211426, 0.0004209280014038086, 0.015881776809692383, 0.04715079069137573, 0.05599212646484375, 0.020300328731536865, 0.0830763578414917, 0.00861203670501709, 0.10433831810951233, 0.007328987121582031, 0.0139082670211792, 0.03405517339706421, 0.013769090175628662, 0.007455885410308838, 0.022233963012695312, 0.04353070259094238, 0.057976484298706055, 0.17285609245300293, 0.0037746429443359375, 0.01663130521774292, 0.05131763219833374, 0.013242602348327637, 0.01934117078781128, 0.02013421058654785, 0.014103412628173828, 0.030787765979766846, 0.11209112405776978, 0.008303701877593994, 0.0024582743644714355, 0.040748417377471924, 0.03303110599517822, 0.0034357309341430664, 0.03687691688537598, 0.006773710250854492, 0.01913321018218994, 0.04336792230606079, 0.02090376615524292, 0.030954957008361816, 0.016201555728912354, 0.026700913906097412, 0.014571011066436768, 0.0010996460914611816, 0.028757572174072266, 0.0789642333984375, 0.018930375576019287, 0.015521049499511719, 0.00023674964904785156, 0.02749103307723999, 0.005215764045715332, 0.010346293449401855, 0.013765931129455566, 0.0007038116455078125, 0.04619842767715454, 0.0322185754776001, 0.03476905822753906, 0.014358580112457275, 0.023265361785888672, 0.033491551876068115, 0.027595102787017822, 0.016438603401184082, 0.025361180305480957, 0.023606479167938232, 0.026246070861816406, 0.036003828048706055, 0.010408461093902588, 0.03805720806121826, 0.021120190620422363, 0.018133997917175293, 0.0200577974319458, 0.05430489778518677, 0.04219317436218262, 0.00550919771194458, 0.004789769649505615, 0.06755995750427246, 0.007220447063446045, 0.10203295946121216, 0.022786617279052734, 0.005012094974517822, 0.0454677939414978, 0.005666196346282959, 0.009895384311676025, 0.02936387062072754, 0.06436777114868164, 0.0052484869956970215, 0.03183716535568237, 0.001866757869720459, 0.12128090858459473, 0.0171738862991333, 0.010071039199829102, 0.03297382593154907, 0.0011135339736938477, 0.03620368242263794, 0.022701561450958252, 0.07120102643966675, 0.19653648138046265, 0.01220792531967163, 0.0208854079246521, 0.015427887439727783, 0.00399935245513916, 0.025558769702911377, 0.010607302188873291, 0.03579753637313843, 0.047091901302337646, 0.035051584243774414, 0.0033786892890930176, 0.019380271434783936, 0.01848578453063965, 0.021712124347686768, 0.0800555944442749, 0.01274186372756958, 0.03401726484298706, 0.019731521606445312, 0.03238797187805176, 0.0025860071182250977, 0.027726173400878906, 0.017848968505859375, 0.006443202495574951, 0.03325432538986206, 0.009816348552703857, 0.005643606185913086, 0.02800387144088745, 0.023396551609039307, 0.045895278453826904, 0.020002424716949463, 0.01170206069946289, 0.014181137084960938, 0.016251206398010254, 0.004550933837890625, 0.0190279483795166, 0.01806056499481201, 0.018817603588104248, 0.07440412044525146, 0.016904890537261963, 0.10007309913635254, 0.008147716522216797, 0.0035379528999328613, 0.006006419658660889, 0.02387261390686035, 0.007975459098815918, 0.07137328386306763, 0.0060506463050842285, 0.1039779782295227, 0.0610508918762207, 0.02659749984741211, 0.03605836629867554, 0.04909372329711914, 0.00024455785751342773, 0.21361061930656433, 0.03830200433731079, 0.01404571533203125, 0.009484827518463135, 0.014279484748840332, 0.0014743208885192871, 0.020206570625305176, 0.0419996976852417, 0.02354496717453003, 0.040224432945251465, 0.03111821413040161, 0.0008596181869506836, 0.0423160195350647, 0.0165136456489563, 0.016266584396362305, 0.049508094787597656, 0.0011919736862182617, 0.017252981662750244, 0.04659968614578247, 0.2810947000980377, 0.05307114124298096, 0.03410470485687256, 0.03886711597442627, 0.08372539281845093, 0.0019791126251220703, 0.02484828233718872, 0.007377803325653076, 0.03749799728393555, 0.04088938236236572, 0.027258574962615967, 0.004435420036315918, 0.03378164768218994, 0.04730790853500366, 0.03527951240539551, 0.009008347988128662, 0.005347192287445068, 0.05020040273666382, 0.0003051161766052246, 0.17450380325317383, 0.0030747652053833008, 0.012894511222839355, 0.017802834510803223, 0.010368287563323975, 0.06897610425949097, 0.0061800479888916016, 0.04347032308578491, 0.0019240379333496094, 0.030681371688842773, 0.007101893424987793, 0.021187126636505127, 0.008192658424377441, 0.02157992124557495, 0.07086652517318726, 0.02450662851333618, 0.012465834617614746, 0.0726277232170105, 0.007112264633178711, 0.007542550563812256, 0.003748178482055664, 0.004873216152191162, 0.02416515350341797, 0.022221863269805908, 0.03155028820037842, 0.0002568960189819336, 0.06019115447998047, 0.2222692370414734, 0.011482179164886475, 0.10653018951416016, 0.163746178150177, 0.051832377910614014, 0.0382692813873291, 0.011878669261932373, 0.007809996604919434, 0.056594252586364746, 0.034481942653656006, 0.03022211790084839, 0.0072966814041137695, 0.07474398612976074, 0.005221366882324219, 0.07921981811523438, 0.04204779863357544, 0.013606905937194824, 0.015245616436004639, 0.07283139228820801, 5.131959915161133e-05, 0.017447292804718018, 0.0499994158744812, 0.029846549034118652, 0.019466757774353027, 0.0107344388961792, 0.0017623305320739746, 0.0017418265342712402, 0.003463149070739746, 0.012871980667114258, 0.044317781925201416, 0.12348467111587524, 0.017075181007385254, 0.013041019439697266, 0.003359079360961914, 0.043992578983306885, 0.01566624641418457, 0.021767497062683105, 0.03419959545135498, 0.006580054759979248, 0.03299295902252197, 0.03746110200881958, 0.00777965784072876, 0.010054588317871094, 0.013532042503356934, 0.0853661298751831, 0.01766151189804077, 0.01794147491455078, 0.002085566520690918, 0.0590667724609375, 0.013151884078979492, 0.0035848617553710938, 0.010960161685943604, 0.006777822971343994, 0.026285111904144287, 0.004219412803649902, 0.0026620030403137207, 0.012799859046936035, 0.008832931518554688, 0.015328288078308105, 0.004356503486633301, 0.044911980628967285, 0.06372189521789551, 0.005952000617980957, 0.10596227645874023, 0.04373663663864136, 0.09346091747283936, 0.0900198221206665, 0.05348998308181763, 0.027357637882232666, 0.00633007287979126]
error_signed : [0.034085214138031006, 0.027685105800628662, -0.07566946744918823, 0.0028328299522399902, -0.007653236389160156, -0.0010246038436889648, -0.025988638401031494, 0.028783142566680908, -0.015150725841522217, 0.06046903133392334, -0.12045556306838989, 0.13267141580581665, 0.017741501331329346, -0.05264848470687866, -0.005046188831329346, -0.034744203090667725, -0.04318642616271973, 0.07899236679077148, 0.006013333797454834, 0.024095475673675537, 0.027104616165161133, -0.0036927461624145508, 0.030435919761657715, -0.029062271118164062, 0.04014992713928223, 0.02946239709854126, 0.02315586805343628, 0.010809183120727539, -0.014489710330963135, -0.05432051420211792, 0.022541821002960205, -0.04060542583465576, -0.028525829315185547, -0.003685593605041504, -0.1970783770084381, -0.0010068416595458984, 0.031115233898162842, 0.008526325225830078, 0.04033321142196655, -0.028816640377044678, 0.013493239879608154, 0.01526796817779541, -0.018471360206604004, -0.03182917833328247, 0.017808854579925537, 0.037211596965789795, -0.10664665699005127, -0.0394212007522583, -0.004768013954162598, 0.027828872203826904, -0.0904882550239563, 0.024024367332458496, 0.06561613082885742, 0.09955590963363647, 0.06184333562850952, -0.00019913911819458008, -0.09508615732192993, -0.047411561012268066, -0.03521794080734253, 0.009837567806243896, 0.01417618989944458, 0.009683430194854736, -0.0005404949188232422, 0.009818315505981445, 0.00031763315200805664, -0.018745720386505127, 0.02264571189880371, 0.048370420932769775, 0.04341799020767212, -0.02381652593612671, 0.020445406436920166, -0.05184340476989746, 0.03134828805923462, -0.052345216274261475, -0.016655683517456055, -0.045920372009277344, 0.17206144332885742, 0.04323709011077881, -0.009150922298431396, 0.0730283260345459, -0.00229644775390625, -0.0066672563552856445, -0.004717588424682617, -0.012319386005401611, -0.044683992862701416, 0.011390268802642822, 0.007725417613983154, -0.008348703384399414, -0.03498959541320801, -0.01520615816116333, 0.020060718059539795, -0.001293778419494629, 0.030662953853607178, 0.030436396598815918, -0.0225982666015625, -0.039698779582977295, 0.0005843639373779297, -0.2502639591693878, 0.0022312402725219727, 0.09209543466567993, 0.049295783042907715, 0.042225003242492676, 0.0031676888465881348, 0.14160162210464478, 0.008251190185546875, -0.002883613109588623, -0.008983314037322998, 0.019362449645996094, 0.013457834720611572, 0.06256437301635742, 0.026554346084594727, 0.22592216730117798, 0.02931511402130127, 0.08053958415985107, -0.04815673828125, -0.0366053581237793, -0.015332937240600586, -0.00318223237991333, -0.01358729600906372, -0.01748979091644287, 0.033909618854522705, -0.009760737419128418, 0.018159091472625732, -0.01966780424118042, 0.09033066034317017, 0.0019121170043945312, -0.022748827934265137, -0.04822647571563721, -0.006947219371795654, 0.002110898494720459, -0.04253333806991577, 0.00826263427734375, -0.005331695079803467, -0.012807965278625488, 0.019686639308929443, 0.16558372974395752, -0.04274320602416992, 0.0270766019821167, -0.004456520080566406, -0.030675053596496582, -0.013114094734191895, 0.01187056303024292, -0.017140448093414307, -0.004647314548492432, -0.015433311462402344, -0.009341180324554443, 0.19777344167232513, -0.008872449398040771, 0.014343440532684326, -0.010293781757354736, -0.037733256816864014, -0.0008364319801330566, -0.0767548680305481, -0.031300365924835205, 0.010781526565551758, 0.011261582374572754, -0.0020389556884765625, -0.0053577423095703125, 0.013557672500610352, -0.043304622173309326, -0.026744842529296875, 0.0005922317504882812, -0.006460666656494141, -0.01725715398788452, -0.024794459342956543, -0.00943368673324585, 0.0294649600982666, -0.007013201713562012, 0.004254281520843506, 0.010893046855926514, 0.036461830139160156, -0.0014607906341552734, 0.10078239440917969, -0.07840919494628906, -0.014233589172363281, -0.0065323710441589355, -0.013940274715423584, -0.007965147495269775, -0.03250241279602051, 0.027619123458862305, 0.06726807355880737, 0.00521475076675415, 0.0025117993354797363, 0.006728827953338623, 0.00889575481414795, 0.2619094252586365, -0.016074001789093018, 0.009344637393951416, 0.02533566951751709, 0.021090388298034668, -0.03528875112533569, -0.048507750034332275, 0.02513885498046875, 0.3210243582725525, 0.03875470161437988, 0.009199559688568115, 0.04210317134857178, 0.023801743984222412, 0.007426321506500244, 0.0993087887763977, 0.005992889404296875, 0.04736495018005371, 0.005125701427459717, -0.009106278419494629, 0.0806007981300354, 0.00485074520111084, 0.05210769176483154, 0.020680248737335205, 0.06399780511856079, -0.024938344955444336, -0.0023137331008911133, -0.00974571704864502, -0.004136860370635986, 0.008064627647399902, -0.018177390098571777, -0.06997334957122803, 0.024094998836517334, 0.005394101142883301, 0.011272549629211426, -0.0004209280014038086, -0.015881776809692383, 0.04715079069137573, 0.05599212646484375, -0.020300328731536865, 0.0830763578414917, -0.00861203670501709, -0.10433831810951233, -0.007328987121582031, 0.0139082670211792, 0.03405517339706421, 0.013769090175628662, 0.007455885410308838, -0.022233963012695312, -0.04353070259094238, -0.057976484298706055, 0.17285609245300293, -0.0037746429443359375, -0.01663130521774292, -0.05131763219833374, 0.013242602348327637, 0.01934117078781128, -0.02013421058654785, 0.014103412628173828, -0.030787765979766846, -0.11209112405776978, -0.008303701877593994, 0.0024582743644714355, 0.040748417377471924, 0.03303110599517822, 0.0034357309341430664, 0.03687691688537598, 0.006773710250854492, 0.01913321018218994, -0.04336792230606079, -0.02090376615524292, 0.030954957008361816, 0.016201555728912354, 0.026700913906097412, -0.014571011066436768, 0.0010996460914611816, -0.028757572174072266, -0.0789642333984375, -0.018930375576019287, 0.015521049499511719, -0.00023674964904785156, 0.02749103307723999, -0.005215764045715332, 0.010346293449401855, 0.013765931129455566, 0.0007038116455078125, 0.04619842767715454, 0.0322185754776001, 0.03476905822753906, -0.014358580112457275, -0.023265361785888672, 0.033491551876068115, 0.027595102787017822, -0.016438603401184082, 0.025361180305480957, -0.023606479167938232, -0.026246070861816406, -0.036003828048706055, -0.010408461093902588, -0.03805720806121826, -0.021120190620422363, 0.018133997917175293, -0.0200577974319458, -0.05430489778518677, -0.04219317436218262, -0.00550919771194458, 0.004789769649505615, 0.06755995750427246, 0.007220447063446045, 0.10203295946121216, -0.022786617279052734, -0.005012094974517822, -0.0454677939414978, -0.005666196346282959, -0.009895384311676025, 0.02936387062072754, 0.06436777114868164, 0.0052484869956970215, 0.03183716535568237, -0.001866757869720459, 0.12128090858459473, -0.0171738862991333, 0.010071039199829102, -0.03297382593154907, -0.0011135339736938477, -0.03620368242263794, 0.022701561450958252, 0.07120102643966675, 0.19653648138046265, 0.01220792531967163, 0.0208854079246521, -0.015427887439727783, 0.00399935245513916, -0.025558769702911377, 0.010607302188873291, -0.03579753637313843, -0.047091901302337646, -0.035051584243774414, 0.0033786892890930176, -0.019380271434783936, 0.01848578453063965, 0.021712124347686768, -0.0800555944442749, -0.01274186372756958, 0.03401726484298706, 0.019731521606445312, 0.03238797187805176, -0.0025860071182250977, 0.027726173400878906, 0.017848968505859375, 0.006443202495574951, 0.03325432538986206, 0.009816348552703857, -0.005643606185913086, -0.02800387144088745, 0.023396551609039307, 0.045895278453826904, 0.020002424716949463, -0.01170206069946289, 0.014181137084960938, 0.016251206398010254, -0.004550933837890625, 0.0190279483795166, -0.01806056499481201, 0.018817603588104248, 0.07440412044525146, 0.016904890537261963, 0.10007309913635254, -0.008147716522216797, -0.0035379528999328613, 0.006006419658660889, 0.02387261390686035, 0.007975459098815918, 0.07137328386306763, 0.0060506463050842285, 0.1039779782295227, 0.0610508918762207, 0.02659749984741211, 0.03605836629867554, 0.04909372329711914, 0.00024455785751342773, 0.21361061930656433, -0.03830200433731079, -0.01404571533203125, -0.009484827518463135, -0.014279484748840332, -0.0014743208885192871, -0.020206570625305176, -0.0419996976852417, 0.02354496717453003, 0.040224432945251465, -0.03111821413040161, -0.0008596181869506836, -0.0423160195350647, -0.0165136456489563, -0.016266584396362305, 0.049508094787597656, -0.0011919736862182617, -0.017252981662750244, 0.04659968614578247, 0.2810947000980377, -0.05307114124298096, -0.03410470485687256, -0.03886711597442627, -0.08372539281845093, -0.0019791126251220703, 0.02484828233718872, -0.007377803325653076, 0.03749799728393555, 0.04088938236236572, -0.027258574962615967, -0.004435420036315918, -0.03378164768218994, -0.04730790853500366, -0.03527951240539551, -0.009008347988128662, -0.005347192287445068, -0.05020040273666382, 0.0003051161766052246, 0.17450380325317383, -0.0030747652053833008, 0.012894511222839355, -0.017802834510803223, -0.010368287563323975, -0.06897610425949097, -0.0061800479888916016, 0.04347032308578491, -0.0019240379333496094, -0.030681371688842773, 0.007101893424987793, 0.021187126636505127, -0.008192658424377441, -0.02157992124557495, -0.07086652517318726, 0.02450662851333618, 0.012465834617614746, -0.0726277232170105, -0.007112264633178711, -0.007542550563812256, 0.003748178482055664, 0.004873216152191162, 0.02416515350341797, 0.022221863269805908, -0.03155028820037842, -0.0002568960189819336, -0.06019115447998047, 0.2222692370414734, 0.011482179164886475, 0.10653018951416016, 0.163746178150177, 0.051832377910614014, -0.0382692813873291, 0.011878669261932373, 0.007809996604919434, -0.056594252586364746, 0.034481942653656006, -0.03022211790084839, -0.0072966814041137695, 0.07474398612976074, 0.005221366882324219, -0.07921981811523438, 0.04204779863357544, 0.013606905937194824, 0.015245616436004639, -0.07283139228820801, 5.131959915161133e-05, 0.017447292804718018, 0.0499994158744812, 0.029846549034118652, 0.019466757774353027, -0.0107344388961792, -0.0017623305320739746, 0.0017418265342712402, -0.003463149070739746, 0.012871980667114258, 0.044317781925201416, 0.12348467111587524, 0.017075181007385254, 0.013041019439697266, 0.003359079360961914, 0.043992578983306885, -0.01566624641418457, -0.021767497062683105, 0.03419959545135498, -0.006580054759979248, 0.03299295902252197, -0.03746110200881958, 0.00777965784072876, -0.010054588317871094, 0.013532042503356934, -0.0853661298751831, 0.01766151189804077, 0.01794147491455078, -0.002085566520690918, 0.0590667724609375, -0.013151884078979492, 0.0035848617553710938, -0.010960161685943604, 0.006777822971343994, 0.026285111904144287, 0.004219412803649902, -0.0026620030403137207, 0.012799859046936035, 0.008832931518554688, 0.015328288078308105, -0.004356503486633301, 0.044911980628967285, -0.06372189521789551, 0.005952000617980957, -0.10596227645874023, 0.04373663663864136, 0.09346091747283936, -0.0900198221206665, -0.05348998308181763, 0.027357637882232666, 0.00633007287979126]
error_mean : 3.3274935752153394
error_mse : 0.1107221349309936
error_max : 32.10243582725525
error_min : 0.005131959915161133