LCPredict(
  (lin1): Linear(in_features=8, out_features=16, bias=True)
  (sig1): ReLU()
  (drp1): Dropout(p=0.3, inplace=False)
  (lin2): Linear(in_features=16, out_features=8, bias=True)
  (sig2): ReLU()
  (drp2): Dropout(p=0.2, inplace=False)
  (lin3): Linear(in_features=8, out_features=1, bias=True)
  (sig3): ReLU()
)
optimizer : adam, lr : 0.002
epochs : 100
batch size : 8
loss : [0.020570475608110428, 0.010743971914052963, 0.00688434112817049, 0.011490197852253914, 0.018474837765097618, 0.0058492738753557205, 0.0063043381087481976, 0.001361978822387755, 0.004410816356539726, 0.005052906461060047, 0.0035876368638128042, 0.0027114935219287872, 0.003450860735028982, 0.00807955116033554, 0.002768441801890731, 0.001424651825800538, 0.0019388329237699509, 0.002218310022726655, 0.0014512700727209449, 0.00402413634583354, 0.0017693507252261043, 0.0016231097979471087, 0.005330889951437712, 0.00419568782672286, 0.001443901564925909, 0.0037082070484757423, 0.003047546837478876, 0.00262846308760345, 0.002407377352938056, 0.00039532064693048596, 0.0011742673814296722, 0.002048682887107134, 0.001120861736126244, 0.0007879241602495313, 0.0007822552579455078, 0.0006870453944429755, 0.001506479224190116, 0.0013971052831038833, 0.000998268136754632, 0.0013450556434690952, 0.0012613576836884022, 0.002107774605974555, 0.0028068888932466507, 0.0004605412541422993, 0.002223899122327566, 0.002825731411576271, 0.0023100783582776785, 0.002659185789525509, 0.0012898279819637537, 0.001948782941326499, 0.004253674298524857, 0.0038670480716973543, 0.0003832415386568755, 0.0004815987194888294, 0.0016109456773847342, 0.000368809443898499, 0.0024541958700865507, 0.0003872360393870622, 0.0009133901912719011, 0.0009182480862364173, 0.00044499835348688066, 0.005092349834740162, 0.0017754469299688935, 0.001173991011455655, 0.0003686172713059932, 0.0010640720138326287, 0.002360881306231022, 0.0015411563217639923, 0.004894467070698738, 0.0007563629187643528, 0.0032598599791526794, 0.004296370316296816, 0.0011052710469812155, 0.0015095873968675733, 0.0018127602525055408, 0.0011985722230747342, 0.0016782991588115692, 0.0022141749504953623, 0.0005623452598229051, 0.00042801833478733897, 0.005059834104031324, 0.0015714967157691717, 0.001099211280234158, 0.0039525628089904785, 0.002664723666384816, 0.0010972823947668076, 0.0014340583002194762, 0.0014676908031105995, 0.0007598988013342023, 0.0014377981424331665, 0.0050915018655359745, 0.0028181392699480057, 0.0011392197338864207, 0.002411677734926343, 0.0008557059918530285, 0.0013075359165668488, 0.0031796572729945183, 0.0018395133083686233, 0.002669381909072399, 0.0013898060424253345]
error_abs : [0.031240642070770264, 0.007444202899932861, 0.032122910022735596, 0.03660619258880615, 0.04051858186721802, 0.02080535888671875, 0.009167253971099854, 0.06514132022857666, 0.03497999906539917, 0.06560564041137695, 0.16918787360191345, 0.08281928300857544, 0.011073589324951172, 0.039635300636291504, 0.0403711199760437, 0.035177648067474365, 0.025763869285583496, 0.10623717308044434, 0.009370982646942139, 0.005437731742858887, 0.04926955699920654, 0.03776043653488159, 0.044331371784210205, 0.08593660593032837, 0.12010905146598816, 0.010431170463562012, 0.028711795806884766, 0.0233919620513916, 0.017057359218597412, 0.015969693660736084, 0.056376099586486816, 0.019335806369781494, 0.019508540630340576, 0.03152495622634888, 0.08222037553787231, 0.05277341604232788, 0.05124855041503906, 0.08129352331161499, 0.00979393720626831, 0.005469202995300293, 0.03321683406829834, 0.008496463298797607, 0.027791619300842285, 0.021620333194732666, 0.07789397239685059, 7.051229476928711e-05, 0.03484344482421875, 0.02343076467514038, 0.010195672512054443, 0.004562795162200928, 0.03456765413284302, 0.003677546977996826, 0.09885519742965698, 0.0564960241317749, 0.0664861798286438, 0.006868720054626465, 0.051843464374542236, 0.08294481039047241, 0.032966673374176025, 0.050579726696014404, 0.018065810203552246, 0.05748873949050903, 0.009045124053955078, 0.04768425226211548, 0.008762896060943604, 0.03869575262069702, 0.017501235008239746, 0.012807011604309082, 0.1326187551021576, 0.04212033748626709, 0.0037540793418884277, 0.020271778106689453, 0.07512444257736206, 0.232072651386261, 0.0008884668350219727, 0.039640069007873535, 0.09154665470123291, 0.002713620662689209, 0.004227578639984131, 0.04783332347869873, 0.002191483974456787, 0.03929787874221802, 0.01023930311203003, 0.05193537473678589, 0.02775859832763672, 0.05313390493392944, 0.014545559883117676, 0.00601273775100708, 0.033895790576934814, 0.002989053726196289, 0.06862568855285645, 0.0028092265129089355, 0.007297873497009277, 0.0032381415367126465, 0.026972472667694092, 0.0869101881980896, 0.02905583381652832, 0.12086948752403259, 0.028088927268981934, 0.011209547519683838, 0.012737572193145752, 0.019226789474487305, 0.033851027488708496, 0.09228676557540894, 0.0031273961067199707, 0.00916433334350586, 0.018228769302368164, 0.027433276176452637, 0.010596811771392822, 0.02005147933959961, 0.010568976402282715, 0.053491055965423584, 0.034082889556884766, 0.0061473846435546875, 0.049285173416137695, 0.01012510061264038, 0.023920714855194092, 0.01217949390411377, 0.02018284797668457, 0.02140939235687256, 0.0017185807228088379, 0.016280710697174072, 0.04800307750701904, 0.018760621547698975, 0.19532400369644165, 0.05969959497451782, 0.004488945007324219, 0.021920442581176758, 0.045621275901794434, 0.025863289833068848, 0.042513906955718994, 0.04114961624145508, 0.005315721035003662, 0.029242515563964844, 0.025349557399749756, 0.07484942674636841, 0.02240169048309326, 0.0012524127960205078, 0.025147080421447754, 0.00399172306060791, 0.0027280449867248535, 0.13432759046554565, 0.005065619945526123, 0.03251004219055176, 0.049786150455474854, 0.024875342845916748, 0.08355699479579926, 0.027695834636688232, 0.008174240589141846, 0.12172704935073853, 0.04997605085372925, 0.0017281174659729004, 0.031253695487976074, 0.015771985054016113, 0.014114618301391602, 0.011824846267700195, 0.01318657398223877, 0.01947098970413208, 0.0046122074127197266, 0.0005058050155639648, 0.03500312566757202, 0.03880178928375244, 0.08243578672409058, 0.05662411451339722, 0.03601431846618652, 0.033375442028045654, 0.011167824268341064, 0.028812646865844727, 0.0025764107704162598, 0.0018414855003356934, 0.019710123538970947, 0.03367960453033447, 0.029908418655395508, 0.06377530097961426, 0.007199466228485107, 0.03927767276763916, 0.018016517162322998, 0.014755606651306152, 0.030288219451904297, 0.021308302879333496, 0.17213961482048035, 0.029169082641601562, 0.015454351902008057, 0.01911187171936035, 0.02404254674911499, 0.07814931869506836, 0.002595961093902588, 0.022786498069763184, 0.0021448731422424316, 0.018709301948547363, 0.00035893917083740234, 0.011707186698913574, 0.006856858730316162, 0.020666837692260742, 0.01104193925857544, 0.0211450457572937, 0.06728637218475342, 0.029332339763641357, 0.051060378551483154, 0.04415827989578247, 0.00036895275115966797, 0.021348893642425537, 0.021760940551757812, 0.025562524795532227, 0.06810218095779419, 0.03976738452911377, 0.12136143445968628, 0.05422651767730713, 0.13880324363708496, 0.04591977596282959, 0.05316811800003052, 0.07655489444732666, 0.0014514923095703125, 0.037290215492248535, 0.013905227184295654, 0.0065683722496032715, 0.014772772789001465, 0.018739700317382812, 0.014671921730041504, 0.04765355587005615, 0.00631183385848999, 0.011659204959869385, 0.015497028827667236, 0.010746419429779053, 0.08158385753631592, 0.022086501121520996, 0.04954028129577637, 0.014919877052307129, 0.02294135093688965, 0.0069945454597473145, 0.009283065795898438, 0.047009408473968506, 0.0422358512878418, 0.021684885025024414, 0.0186769962310791, 0.02940577268600464, 0.011216223239898682, 0.03614234924316406, 0.025319278240203857, 0.015615880489349365, 0.029124557971954346, 0.03630721569061279, 0.05170363187789917, 0.04605424404144287, 0.12694251537322998, 0.012926697731018066, 0.014745950698852539, 0.03576302528381348, 0.024827301502227783, 0.012102842330932617, 0.012711763381958008, 0.035813331604003906, 0.016827523708343506, 0.002057194709777832, 0.011322438716888428, 0.08521085977554321, 0.059127867221832275, 0.004793345928192139, 0.022710442543029785, 0.004625082015991211, 0.08265829086303711, 0.025507807731628418, 0.027244389057159424, 0.027257144451141357, 0.009066462516784668, 0.03934192657470703, 0.01947718858718872, 0.09283477067947388, 0.023145318031311035, 0.009753167629241943, 0.0011644363403320312, 0.056669652462005615, 0.08028531074523926, 0.04182475805282593, 0.024810373783111572, 0.02046489715576172, 0.05232429504394531, 0.03489363193511963, 0.010989487171173096, 0.009214937686920166, 0.04669684171676636, 0.05017411708831787, 0.0466991662979126, 0.0527796745300293, 0.05360841751098633, 0.047231972217559814, 0.0074675679206848145, 0.03366571664810181, 0.04410099983215332, 0.025299251079559326, 0.0372958779335022, 0.1614254117012024, 0.019142091274261475, 0.09730702638626099, 0.01529473066329956, 0.0030042529106140137, 0.010580599308013916, 0.03517121076583862, 0.07029843330383301, 0.0006489753723144531, 0.018182218074798584, 0.034053266048431396, 0.039331018924713135, 0.01590549945831299, 0.04660236835479736, 0.008695244789123535, 0.047583937644958496, 0.026662886142730713, 0.03281885385513306, 0.04158443212509155, 0.027498483657836914, 0.11893099546432495, 0.22098815441131592, 0.022008836269378662, 0.0047882795333862305, 0.02484947443008423, 0.00018703937530517578, 0.02705693244934082, 0.006808280944824219, 0.00019669532775878906, 0.012550592422485352, 0.011186480522155762, 0.03675675392150879, 0.04739391803741455, 0.01085817813873291, 0.0030956268310546875, 0.013065814971923828, 0.029241085052490234, 0.03269249200820923, 0.015456318855285645, 0.00935518741607666, 0.0024580955505371094, 0.014621555805206299, 0.010955572128295898, 0.07618743181228638, 0.01574307680130005, 0.12133270502090454, 0.04233628511428833, 0.026822924613952637, 0.022225499153137207, 0.052258968353271484, 0.01754927635192871, 0.053842902183532715, 0.028638482093811035, 0.05366450548171997, 0.04303944110870361, 0.05717825889587402, 0.01633387804031372, 0.026365041732788086, 0.04742401838302612, 0.11652606725692749, 0.09461265802383423, 0.023864388465881348, 0.017232656478881836, 0.03346836566925049, 0.001186966896057129, 0.018245041370391846, 0.034667253494262695, 0.07561326026916504, 0.04994702339172363, 0.06760281324386597, 0.013583183288574219, 0.03231590986251831, 0.07354515790939331, 0.02166759967803955, 0.44227829575538635, 0.04842972755432129, 0.028018057346343994, 0.05938512086868286, 0.04188424348831177, 0.022188246250152588, 0.009183049201965332, 0.023660898208618164, 0.0039656758308410645, 0.05347251892089844, 0.06814146041870117, 0.005103349685668945, 0.006181776523590088, 0.033971309661865234, 0.026950299739837646, 0.11070162057876587, 0.027438700199127197, 0.000804603099822998, 0.04709768295288086, 0.2819311320781708, 0.028827786445617676, 0.06989318132400513, 0.044281959533691406, 0.045065104961395264, 0.061791181564331055, 0.019801735877990723, 0.05099165439605713, 0.029597699642181396, 0.00414043664932251, 0.006214320659637451, 0.10504227876663208, 0.021562814712524414, 0.016899704933166504, 0.07095342874526978, 0.02102440595626831, 0.013122856616973877, 0.02447056770324707, 0.04240679740905762, 0.05808830261230469, 0.009124934673309326, 0.04650193452835083, 0.06205481290817261, 0.05249696969985962, 0.003700554370880127, 0.018163442611694336, 0.036525189876556396, 0.003922581672668457, 0.02055525779724121, 0.034357428550720215, 0.006873786449432373, 0.00196152925491333, 0.0219002366065979, 0.05635809898376465, 0.0005742311477661133, 0.011726200580596924, 0.0485500693321228, 0.03365063667297363, 0.05548989772796631, 0.019155919551849365, 0.016780197620391846, 0.10016059875488281, 0.03508877754211426, 0.08722710609436035, 0.00022357702255249023, 0.008081912994384766, 0.3295361399650574, 0.03693664073944092, 0.20196354389190674, 0.009910047054290771, 0.002073824405670166, 0.00862044095993042, 0.027362585067749023, 0.058519721031188965, 0.011780798435211182, 0.018064022064208984, 0.010296821594238281, 0.10912621021270752, 0.14547985792160034, 0.007101237773895264, 0.03648000955581665, 0.0331154465675354, 0.05765223503112793, 0.019481003284454346, 0.038284361362457275, 0.025132954120635986, 0.004118502140045166, 0.004791080951690674, 0.023099780082702637, 0.032817304134368896, 0.0387687087059021, 0.008988916873931885, 0.06586164236068726, 0.007800161838531494, 0.06624215841293335, 0.01585441827774048, 0.09520101547241211, 0.01427614688873291, 0.037878334522247314, 0.022573530673980713, 0.10118812322616577, 0.03251945972442627, 0.04100513458251953, 0.04701423645019531, 0.020786583423614502, 0.029936254024505615, 0.022612333297729492, 0.03532165288925171, 0.03548091650009155, 0.004267215728759766, 0.019004881381988525, 0.0320737361907959, 0.0021055936813354492, 0.019758880138397217, 0.12370383739471436, 0.009139418601989746, 0.0432513952255249, 0.03723180294036865, 0.01187598705291748, 0.033710360527038574, 0.02243560552597046, 0.02567112445831299, 0.06947362422943115, 0.003076016902923584, 0.043351590633392334, 0.057204246520996094, 0.03879004716873169, 0.02092444896697998, 0.027376115322113037, 0.08328086137771606, 0.015694022178649902, 0.04090076684951782, 0.05009192228317261, 0.020884454250335693, 0.014188408851623535, 0.04258990287780762]
error_signed : [0.031240642070770264, 0.007444202899932861, -0.032122910022735596, -0.03660619258880615, -0.04051858186721802, -0.02080535888671875, -0.009167253971099854, -0.06514132022857666, -0.03497999906539917, 0.06560564041137695, -0.16918787360191345, 0.08281928300857544, 0.011073589324951172, 0.039635300636291504, -0.0403711199760437, 0.035177648067474365, -0.025763869285583496, 0.10623717308044434, -0.009370982646942139, -0.005437731742858887, 0.04926955699920654, 0.03776043653488159, -0.044331371784210205, -0.08593660593032837, 0.12010905146598816, -0.010431170463562012, -0.028711795806884766, 0.0233919620513916, 0.017057359218597412, -0.015969693660736084, 0.056376099586486816, -0.019335806369781494, -0.019508540630340576, 0.03152495622634888, -0.08222037553787231, -0.05277341604232788, 0.05124855041503906, -0.08129352331161499, 0.00979393720626831, -0.005469202995300293, -0.03321683406829834, -0.008496463298797607, 0.027791619300842285, -0.021620333194732666, -0.07789397239685059, 7.051229476928711e-05, -0.03484344482421875, -0.02343076467514038, -0.010195672512054443, 0.004562795162200928, 0.03456765413284302, 0.003677546977996826, 0.09885519742965698, 0.0564960241317749, 0.0664861798286438, -0.006868720054626465, -0.051843464374542236, -0.08294481039047241, -0.032966673374176025, -0.050579726696014404, 0.018065810203552246, 0.05748873949050903, 0.009045124053955078, -0.04768425226211548, 0.008762896060943604, -0.03869575262069702, -0.017501235008239746, 0.012807011604309082, -0.1326187551021576, 0.04212033748626709, -0.0037540793418884277, 0.020271778106689453, 0.07512444257736206, 0.232072651386261, -0.0008884668350219727, -0.039640069007873535, 0.09154665470123291, -0.002713620662689209, 0.004227578639984131, 0.04783332347869873, 0.002191483974456787, 0.03929787874221802, -0.01023930311203003, -0.05193537473678589, 0.02775859832763672, 0.05313390493392944, 0.014545559883117676, -0.00601273775100708, -0.033895790576934814, 0.002989053726196289, -0.06862568855285645, -0.0028092265129089355, -0.007297873497009277, 0.0032381415367126465, -0.026972472667694092, -0.0869101881980896, -0.02905583381652832, -0.12086948752403259, 0.028088927268981934, -0.011209547519683838, 0.012737572193145752, 0.019226789474487305, -0.033851027488708496, 0.09228676557540894, 0.0031273961067199707, 0.00916433334350586, 0.018228769302368164, -0.027433276176452637, 0.010596811771392822, 0.02005147933959961, 0.010568976402282715, 0.053491055965423584, -0.034082889556884766, -0.0061473846435546875, -0.049285173416137695, -0.01012510061264038, -0.023920714855194092, -0.01217949390411377, -0.02018284797668457, -0.02140939235687256, 0.0017185807228088379, -0.016280710697174072, 0.04800307750701904, -0.018760621547698975, 0.19532400369644165, -0.05969959497451782, -0.004488945007324219, -0.021920442581176758, -0.045621275901794434, -0.025863289833068848, 0.042513906955718994, -0.04114961624145508, 0.005315721035003662, 0.029242515563964844, -0.025349557399749756, 0.07484942674636841, -0.02240169048309326, 0.0012524127960205078, 0.025147080421447754, 0.00399172306060791, -0.0027280449867248535, -0.13432759046554565, 0.005065619945526123, 0.03251004219055176, -0.049786150455474854, -0.024875342845916748, 0.08355699479579926, 0.027695834636688232, -0.008174240589141846, 0.12172704935073853, 0.04997605085372925, -0.0017281174659729004, 0.031253695487976074, 0.015771985054016113, -0.014114618301391602, 0.011824846267700195, -0.01318657398223877, -0.01947098970413208, 0.0046122074127197266, 0.0005058050155639648, 0.03500312566757202, 0.03880178928375244, -0.08243578672409058, 0.05662411451339722, -0.03601431846618652, -0.033375442028045654, 0.011167824268341064, -0.028812646865844727, -0.0025764107704162598, -0.0018414855003356934, 0.019710123538970947, -0.03367960453033447, -0.029908418655395508, -0.06377530097961426, 0.007199466228485107, -0.03927767276763916, -0.018016517162322998, 0.014755606651306152, -0.030288219451904297, -0.021308302879333496, -0.17213961482048035, 0.029169082641601562, 0.015454351902008057, -0.01911187171936035, -0.02404254674911499, 0.07814931869506836, 0.002595961093902588, 0.022786498069763184, -0.0021448731422424316, -0.018709301948547363, -0.00035893917083740234, 0.011707186698913574, -0.006856858730316162, 0.020666837692260742, 0.01104193925857544, 0.0211450457572937, 0.06728637218475342, -0.029332339763641357, 0.051060378551483154, 0.04415827989578247, 0.00036895275115966797, -0.021348893642425537, -0.021760940551757812, 0.025562524795532227, 0.06810218095779419, -0.03976738452911377, 0.12136143445968628, -0.05422651767730713, 0.13880324363708496, -0.04591977596282959, 0.05316811800003052, -0.07655489444732666, 0.0014514923095703125, 0.037290215492248535, -0.013905227184295654, 0.0065683722496032715, 0.014772772789001465, -0.018739700317382812, 0.014671921730041504, 0.04765355587005615, 0.00631183385848999, 0.011659204959869385, 0.015497028827667236, -0.010746419429779053, 0.08158385753631592, 0.022086501121520996, 0.04954028129577637, -0.014919877052307129, -0.02294135093688965, 0.0069945454597473145, 0.009283065795898438, -0.047009408473968506, -0.0422358512878418, -0.021684885025024414, 0.0186769962310791, 0.02940577268600464, -0.011216223239898682, -0.03614234924316406, 0.025319278240203857, 0.015615880489349365, -0.029124557971954346, -0.03630721569061279, 0.05170363187789917, -0.04605424404144287, -0.12694251537322998, -0.012926697731018066, 0.014745950698852539, 0.03576302528381348, -0.024827301502227783, 0.012102842330932617, 0.012711763381958008, -0.035813331604003906, 0.016827523708343506, -0.002057194709777832, 0.011322438716888428, 0.08521085977554321, -0.059127867221832275, 0.004793345928192139, 0.022710442543029785, 0.004625082015991211, 0.08265829086303711, -0.025507807731628418, -0.027244389057159424, -0.027257144451141357, -0.009066462516784668, -0.03934192657470703, -0.01947718858718872, -0.09283477067947388, 0.023145318031311035, 0.009753167629241943, -0.0011644363403320312, 0.056669652462005615, 0.08028531074523926, 0.04182475805282593, 0.024810373783111572, -0.02046489715576172, 0.05232429504394531, -0.03489363193511963, -0.010989487171173096, -0.009214937686920166, 0.04669684171676636, -0.05017411708831787, 0.0466991662979126, -0.0527796745300293, -0.05360841751098633, 0.047231972217559814, -0.0074675679206848145, -0.03366571664810181, 0.04410099983215332, -0.025299251079559326, -0.0372958779335022, 0.1614254117012024, 0.019142091274261475, 0.09730702638626099, -0.01529473066329956, -0.0030042529106140137, -0.010580599308013916, 0.03517121076583862, -0.07029843330383301, -0.0006489753723144531, 0.018182218074798584, 0.034053266048431396, 0.039331018924713135, -0.01590549945831299, 0.04660236835479736, -0.008695244789123535, 0.047583937644958496, 0.026662886142730713, -0.03281885385513306, -0.04158443212509155, 0.027498483657836914, 0.11893099546432495, 0.22098815441131592, 0.022008836269378662, -0.0047882795333862305, 0.02484947443008423, 0.00018703937530517578, -0.02705693244934082, -0.006808280944824219, -0.00019669532775878906, -0.012550592422485352, -0.011186480522155762, -0.03675675392150879, -0.04739391803741455, -0.01085817813873291, 0.0030956268310546875, 0.013065814971923828, 0.029241085052490234, 0.03269249200820923, 0.015456318855285645, -0.00935518741607666, 0.0024580955505371094, 0.014621555805206299, -0.010955572128295898, -0.07618743181228638, 0.01574307680130005, -0.12133270502090454, -0.04233628511428833, 0.026822924613952637, 0.022225499153137207, -0.052258968353271484, 0.01754927635192871, 0.053842902183532715, 0.028638482093811035, 0.05366450548171997, -0.04303944110870361, -0.05717825889587402, 0.01633387804031372, -0.026365041732788086, 0.04742401838302612, 0.11652606725692749, 0.09461265802383423, 0.023864388465881348, -0.017232656478881836, 0.03346836566925049, -0.001186966896057129, -0.018245041370391846, 0.034667253494262695, -0.07561326026916504, 0.04994702339172363, 0.06760281324386597, -0.013583183288574219, -0.03231590986251831, 0.07354515790939331, 0.02166759967803955, 0.44227829575538635, 0.04842972755432129, -0.028018057346343994, -0.05938512086868286, -0.04188424348831177, -0.022188246250152588, 0.009183049201965332, -0.023660898208618164, 0.0039656758308410645, 0.05347251892089844, -0.06814146041870117, -0.005103349685668945, -0.006181776523590088, 0.033971309661865234, -0.026950299739837646, 0.11070162057876587, -0.027438700199127197, -0.000804603099822998, -0.04709768295288086, 0.2819311320781708, -0.028827786445617676, -0.06989318132400513, 0.044281959533691406, -0.045065104961395264, -0.061791181564331055, 0.019801735877990723, 0.05099165439605713, 0.029597699642181396, -0.00414043664932251, -0.006214320659637451, -0.10504227876663208, -0.021562814712524414, -0.016899704933166504, -0.07095342874526978, -0.02102440595626831, -0.013122856616973877, -0.02447056770324707, 0.04240679740905762, 0.05808830261230469, -0.009124934673309326, -0.04650193452835083, 0.06205481290817261, -0.05249696969985962, 0.003700554370880127, -0.018163442611694336, 0.036525189876556396, -0.003922581672668457, -0.02055525779724121, -0.034357428550720215, 0.006873786449432373, 0.00196152925491333, 0.0219002366065979, -0.05635809898376465, 0.0005742311477661133, 0.011726200580596924, 0.0485500693321228, -0.03365063667297363, 0.05548989772796631, 0.019155919551849365, 0.016780197620391846, 0.10016059875488281, -0.03508877754211426, -0.08722710609436035, 0.00022357702255249023, 0.008081912994384766, 0.3295361399650574, 0.03693664073944092, 0.20196354389190674, 0.009910047054290771, 0.002073824405670166, -0.00862044095993042, -0.027362585067749023, -0.058519721031188965, -0.011780798435211182, -0.018064022064208984, 0.010296821594238281, -0.10912621021270752, 0.14547985792160034, 0.007101237773895264, -0.03648000955581665, 0.0331154465675354, 0.05765223503112793, -0.019481003284454346, -0.038284361362457275, 0.025132954120635986, 0.004118502140045166, 0.004791080951690674, -0.023099780082702637, -0.032817304134368896, -0.0387687087059021, -0.008988916873931885, -0.06586164236068726, -0.007800161838531494, -0.06624215841293335, 0.01585441827774048, 0.09520101547241211, -0.01427614688873291, -0.037878334522247314, -0.022573530673980713, 0.10118812322616577, -0.03251945972442627, 0.04100513458251953, 0.04701423645019531, -0.020786583423614502, -0.029936254024505615, -0.022612333297729492, -0.03532165288925171, -0.03548091650009155, -0.004267215728759766, 0.019004881381988525, -0.0320737361907959, 0.0021055936813354492, -0.019758880138397217, 0.12370383739471436, -0.009139418601989746, -0.0432513952255249, 0.03723180294036865, 0.01187598705291748, 0.033710360527038574, 0.02243560552597046, 0.02567112445831299, -0.06947362422943115, 0.003076016902923584, -0.043351590633392334, -0.057204246520996094, -0.03879004716873169, -0.02092444896697998, -0.027376115322113037, 0.08328086137771606, 0.015694022178649902, 0.04090076684951782, -0.05009192228317261, -0.020884454250335693, 0.014188408851623535, -0.04258990287780762]
error_mean : 3.748610070347786
error_mse : 0.14052077459512832
error_max : 44.227829575538635
error_min : 0.007051229476928711