LCPredict(
  (lin1): Linear(in_features=8, out_features=16, bias=True)
  (sig1): Sigmoid()
  (drp1): Dropout(p=0.3, inplace=False)
  (lin2): Linear(in_features=16, out_features=8, bias=True)
  (sig2): Sigmoid()
  (drp2): Dropout(p=0.2, inplace=False)
  (lin3): Linear(in_features=8, out_features=1, bias=True)
  (sig3): Sigmoid()
)
optimizer : adam, lr : 0.002
epochs : 100
batch size : 8
loss : [0.0712050348520279, 0.024447936564683914, 0.013751177117228508, 0.030303940176963806, 0.017590681090950966, 0.009475549682974815, 0.009134124964475632, 0.014111168682575226, 0.01891183666884899, 0.00905103050172329, 0.014381262473762035, 0.007437227293848991, 0.013334005139768124, 0.007489011622965336, 0.010493805631995201, 0.008494392037391663, 0.0093533331528306, 0.009264767169952393, 0.0075182924047112465, 0.005970945581793785, 0.007347919978201389, 0.0039060127455741167, 0.008341683074831963, 0.007635689340531826, 0.004272793419659138, 0.004259472247213125, 0.004057306330651045, 0.004165641497820616, 0.004753265529870987, 0.0037208562716841698, 0.0048385984264314175, 0.002964898245409131, 0.002440882381051779, 0.004744799342006445, 0.0037643159739673138, 0.0024185050278902054, 0.0020512030459940434, 0.006552445236593485, 0.001446075038984418, 0.004834683611989021, 0.0030600728932768106, 0.00400876346975565, 0.004664309788495302, 0.00337146851234138, 0.002833097241818905, 0.007672293111681938, 0.0028163057286292315, 0.001173842465505004, 0.0042618634179234505, 0.0006212933221831918, 0.005626417696475983, 0.006967115681618452, 0.004966006148606539, 0.0021185721270740032, 0.0013987480197101831, 0.004037671722471714, 0.0011236753780394793, 0.005733761470764875, 0.0019213504856452346, 0.003376249223947525, 0.0023422720842063427, 0.002046700567007065, 0.004064552485942841, 0.0004010502016171813, 0.0038780849426984787, 0.0024199257604777813, 0.0035403643269091845, 0.004643659573048353, 0.004762444645166397, 0.0028506158851087093, 0.002330079674720764, 0.0029485775157809258, 0.0019006130751222372, 0.003589834086596966, 0.005421503912657499, 0.0022738727275282145, 0.003448768751695752, 0.0015993876149877906, 0.0037510981783270836, 0.0029422719962894917, 0.0016292257932946086, 0.0016214026836678386, 0.0016034810105338693, 0.0018067427445203066, 0.001762100262567401, 0.0025870760437101126, 0.00089971290435642, 0.0018477466655895114, 0.00231044739484787, 0.0029515798669308424, 0.00308376457542181, 0.0018574119312688708, 0.0010834303684532642, 0.0026894628535956144, 0.0031839506700634956, 0.0033594160340726376, 0.002995084272697568, 0.001245812512934208, 0.0014033683110028505, 0.003932487685233355]
error_abs : [0.05374276638031006, 0.055206477642059326, 0.028296053409576416, 0.021054863929748535, 0.03563106060028076, 0.016684532165527344, 0.058276593685150146, 0.037659525871276855, 0.03821456432342529, 0.11105573177337646, 0.09761738777160645, 0.07799422740936279, 0.002344369888305664, 0.018803715705871582, 0.06878840923309326, 0.01743990182876587, 0.04408997297286987, 0.13601261377334595, 0.01639336347579956, 0.014703810214996338, 0.06280887126922607, 0.10788315534591675, 0.030503153800964355, 0.047387659549713135, 0.15867015719413757, 0.028518855571746826, 0.036704838275909424, 0.026337802410125732, 0.015736103057861328, 0.027628183364868164, 0.016402125358581543, 0.06050199270248413, 0.05284315347671509, 0.027416586875915527, 0.012896716594696045, 0.04865753650665283, 0.07191932201385498, 0.022219359874725342, 0.017967522144317627, 0.02009207010269165, 0.011579751968383789, 0.014754295349121094, 0.03634887933731079, 0.05523961782455444, 0.003050684928894043, 0.04145914316177368, 0.020569324493408203, 0.026113808155059814, 0.039557456970214844, 0.03587818145751953, 0.08395826816558838, 0.033532559871673584, 0.09645628929138184, 0.07532459497451782, 0.056604623794555664, 0.07150644063949585, 0.03851974010467529, 0.02151024341583252, 0.05356043577194214, 0.0377536416053772, 0.0405580997467041, 0.05276757478713989, 0.05042630434036255, 0.03046548366546631, 0.046320438385009766, 0.01654130220413208, 0.05635881423950195, 0.003197312355041504, 0.22211360931396484, 0.04205876588821411, 0.041230738162994385, 0.005217194557189941, 0.06824600696563721, 0.050919532775878906, 0.034889936447143555, 0.03590285778045654, 0.22697889804840088, 0.08643925189971924, 0.08683782815933228, 0.09142255783081055, 0.031773507595062256, 0.015439450740814209, 0.0699763298034668, 0.008937954902648926, 0.037073373794555664, 0.04864293336868286, 0.009195387363433838, 0.005114376544952393, 0.010118484497070312, 0.06356853246688843, 0.02204418182373047, 0.016171753406524658, 0.03170323371887207, 0.08732366561889648, 0.07670581340789795, 0.01255124807357788, 0.22916662693023682, 0.41611233353614807, 0.003823578357696533, 0.04285159707069397, 0.018350303173065186, 0.03716617822647095, 0.07489973306655884, 0.0575675368309021, 0.006612420082092285, 0.06155353784561157, 0.02389615774154663, 0.031355321407318115, 0.06262040138244629, 0.014764785766601562, 0.08730417490005493, 0.7336688041687012, 0.07569915056228638, 0.13855773210525513, 0.01040869951248169, 0.04995417594909668, 0.0004788041114807129, 0.033457159996032715, 0.05452525615692139, 0.00632929801940918, 0.018169879913330078, 0.07877665758132935, 0.12629276514053345, 0.012558698654174805, 0.16724133491516113, 0.024770498275756836, 0.006646633148193359, 0.0059702396392822266, 0.07912147045135498, 0.028807461261749268, 0.03910660743713379, 0.054890215396881104, 0.025479912757873535, 0.02328890562057495, 0.01859426498413086, 0.13270527124404907, 0.0258064866065979, 0.0582890510559082, 0.06825178861618042, 0.007153987884521484, 0.0046610236167907715, 0.04647696018218994, 0.040584027767181396, 0.03486371040344238, 0.06724703311920166, 0.011731088161468506, 0.18499110639095306, 0.036232173442840576, 0.06407541036605835, 0.015847742557525635, 0.0016483068466186523, 0.013905763626098633, 0.02565622329711914, 0.025974750518798828, 0.03572958707809448, 0.005275726318359375, 0.020338356494903564, 0.026254236698150635, 0.019061267375946045, 0.06215089559555054, 0.032465577125549316, 0.0660557746887207, 0.06455326080322266, 0.058830082416534424, 0.057612717151641846, 0.05833083391189575, 0.056151628494262695, 0.025597214698791504, 0.024154722690582275, 0.020882606506347656, 0.025619208812713623, 0.007818758487701416, 0.12752091884613037, 0.08354306221008301, 0.014261782169342041, 0.005169034004211426, 0.009382128715515137, 0.009942471981048584, 0.0028505325317382812, 0.017250418663024902, 0.1314515471458435, 0.12431848049163818, 0.05067455768585205, 0.0441095232963562, 0.024201273918151855, 0.10434597730636597, 0.031078577041625977, 0.06285107135772705, 0.005911886692047119, 0.04037350416183472, 0.0009918212890625, 0.03789973258972168, 0.06203413009643555, 0.2597759962081909, 0.0254707932472229, 0.00824582576751709, 0.03917139768600464, 0.0013646483421325684, 0.010810315608978271, 0.05065727233886719, 0.06346935033798218, 0.01328188180923462, 0.027602791786193848, 0.019639194011688232, 0.04521894454956055, 0.01805812120437622, 0.08709007501602173, 0.008081197738647461, 0.1030580997467041, 0.031836867332458496, 0.011461913585662842, 0.11434173583984375, 0.027392089366912842, 0.04309278726577759, 0.008348464965820312, 0.05248314142227173, 0.032785892486572266, 0.02474874258041382, 0.012269914150238037, 0.04936903715133667, 0.06349551677703857, 0.020161807537078857, 0.03012639284133911, 0.003148674964904785, 0.08653008937835693, 0.005387663841247559, 0.03229248523712158, 0.006866097450256348, 0.04879570007324219, 0.06936734914779663, 0.06791889667510986, 0.019037365913391113, 0.05687856674194336, 0.005361497402191162, 0.012100458145141602, 0.26608771085739136, 0.03594714403152466, 0.013003647327423096, 0.07126259803771973, 0.0357624888420105, 0.019517183303833008, 0.074221670627594, 0.10594433546066284, 0.00017386674880981445, 0.021150171756744385, 0.020658791065216064, 0.00685882568359375, 0.06743216514587402, 0.04494297504425049, 0.07361817359924316, 0.007672011852264404, 0.08773207664489746, 0.05228233337402344, 0.017552554607391357, 0.01205587387084961, 0.1268579363822937, 0.01700448989868164, 0.0487554669380188, 0.048778414726257324, 0.025351345539093018, 0.009576141834259033, 0.023939192295074463, 0.00021469593048095703, 0.02261531352996826, 0.03284025192260742, 0.010386407375335693, 0.02405327558517456, 0.2877159118652344, 0.05938255786895752, 0.04310423135757446, 0.0108528733253479, 0.02438652515411377, 0.029599666595458984, 0.05692601203918457, 0.06022912263870239, 0.0055155158042907715, 0.005282878875732422, 0.005088925361633301, 0.06297427415847778, 0.04410666227340698, 0.04703199863433838, 0.02439969778060913, 0.08378094434738159, 0.0250931978225708, 0.019228994846343994, 0.026402056217193604, 0.003877103328704834, 0.05205214023590088, 0.009072363376617432, 0.009829998016357422, 0.04333597421646118, 0.20627862215042114, 0.01961660385131836, 0.07785278558731079, 0.014116287231445312, 0.023621737957000732, 0.01089489459991455, 0.0073348283767700195, 0.040373921394348145, 0.05670905113220215, 0.07273268699645996, 0.04032343626022339, 0.09965425729751587, 0.02124965190887451, 0.150021493434906, 0.02222764492034912, 0.048139750957489014, 0.0283968448638916, 0.01046055555343628, 0.00803309679031372, 0.011900484561920166, 0.06902956962585449, 0.15440279245376587, 0.04639863967895508, 0.003934919834136963, 0.030313313007354736, 0.022117197513580322, 0.021997272968292236, 0.03077763319015503, 0.0427861213684082, 0.005954623222351074, 0.1443687081336975, 0.024654269218444824, 0.04050344228744507, 0.0393216609954834, 0.0336570143699646, 0.08741742372512817, 0.06792402267456055, 0.03778046369552612, 0.036315321922302246, 0.028846561908721924, 0.03536200523376465, 0.0442618727684021, 0.0075980424880981445, 0.04269009828567505, 0.04873877763748169, 0.004745006561279297, 0.010583877563476562, 0.0314866304397583, 0.044480741024017334, 0.04425323009490967, 0.03551530838012695, 0.024485647678375244, 0.011181354522705078, 0.12312233448028564, 0.011401593685150146, 0.0014202594757080078, 0.03226196765899658, 0.03233778476715088, 0.02670300006866455, 0.10487645864486694, 0.19775313138961792, 0.027030885219573975, 0.043451130390167236, 0.004808962345123291, 0.04276108741760254, 0.06944513320922852, 0.039509356021881104, 0.06505882740020752, 0.06574892997741699, 0.03354191780090332, 0.04672133922576904, 0.005270242691040039, 0.02241593599319458, 0.0017732977867126465, 0.18478354811668396, 0.03358280658721924, 0.044701457023620605, 0.011396408081054688, 0.011324524879455566, 0.039664268493652344, 0.019371867179870605, 0.022124111652374268, 0.02239382266998291, 0.006419360637664795, 0.02792799472808838, 0.004133045673370361, 0.11461126804351807, 0.005372822284698486, 0.015117645263671875, 0.03005039691925049, 0.0771302580833435, 0.010180175304412842, 0.0035194754600524902, 0.09247821569442749, 0.07574015855789185, 0.0034735798835754395, 0.08210831880569458, 0.03345286846160889, 0.019579172134399414, 0.007794380187988281, 0.024471402168273926, 0.029023289680480957, 0.012257754802703857, 0.03575056791305542, 0.05929434299468994, 0.0055735111236572266, 0.04737579822540283, 0.003445923328399658, 0.014105558395385742, 0.02421247959136963, 0.02652716636657715, 0.022986412048339844, 0.2134392261505127, 0.04784524440765381, 0.0447840690612793, 0.05920380353927612, 0.039636313915252686, 0.0231553316116333, 0.06910490989685059, 0.06710243225097656, 0.03695482015609741, 0.09074801206588745, 0.1025005578994751, 0.04740172624588013, 0.028155982494354248, 0.05717581510543823, 0.040091872215270996, 0.0008188486099243164, 0.03285890817642212, 0.05067408084869385, 0.02960723638534546, 0.13864290714263916, 0.02221018075942993, 0.038969576358795166, 0.07676076889038086, 0.02176201343536377, 0.03318983316421509, 0.0594521164894104, 0.013255834579467773, 0.2086857557296753, 0.003806889057159424, 0.13704484701156616, 0.0456995964050293, 0.014224529266357422, 0.04627901315689087, 0.00046116113662719727, 0.019663870334625244, 0.02953636646270752, 0.04361659288406372, 0.029735684394836426, 0.053736090660095215, 0.09748941659927368, 0.0526043176651001, 0.031076908111572266, 0.004309594631195068, 0.11390233039855957, 0.017376184463500977, 0.034477293491363525, 0.03042125701904297, 0.0035196542739868164, 0.055809855461120605, 0.037264466285705566, 0.011976778507232666, 0.0002525448799133301, 0.00561147928237915, 0.019199669361114502, 0.002679288387298584, 0.02985513210296631, 0.09906524419784546, 0.0782352089881897, 0.021974563598632812, 0.02438253164291382, 0.0012467503547668457, 0.1461074948310852, 0.02805715799331665, 0.01904118061065674, 0.09464704990386963, 0.010894238948822021, 0.005289137363433838, 0.08164018392562866, 0.013054728507995605, 0.04046279191970825, 0.004086494445800781, 0.0029432177543640137, 0.038622498512268066, 0.018037617206573486, 0.028994083404541016, 0.05366784334182739, 0.0072585344314575195, 0.08777576684951782, 0.048351287841796875, 0.053588807582855225, 0.07158643007278442, 0.042147278785705566, 0.006593048572540283, 0.037426888942718506, 0.06168490648269653, 0.044636428356170654, 0.029899120330810547, 0.07852065563201904, 0.017842233180999756, 0.06475728750228882, 0.012974202632904053, 0.06000441312789917, 0.015315830707550049, 0.18388211727142334, 0.016896426677703857, 0.0745115876197815, 0.002485811710357666]
error_signed : [-0.05374276638031006, -0.055206477642059326, -0.028296053409576416, -0.021054863929748535, 0.03563106060028076, 0.016684532165527344, -0.058276593685150146, -0.037659525871276855, 0.03821456432342529, 0.11105573177337646, -0.09761738777160645, 0.07799422740936279, -0.002344369888305664, -0.018803715705871582, 0.06878840923309326, 0.01743990182876587, -0.04408997297286987, 0.13601261377334595, -0.01639336347579956, 0.014703810214996338, -0.06280887126922607, 0.10788315534591675, 0.030503153800964355, -0.047387659549713135, 0.15867015719413757, 0.028518855571746826, 0.036704838275909424, 0.026337802410125732, 0.015736103057861328, 0.027628183364868164, -0.016402125358581543, 0.06050199270248413, -0.05284315347671509, -0.027416586875915527, -0.012896716594696045, 0.04865753650665283, -0.07191932201385498, 0.022219359874725342, 0.017967522144317627, 0.02009207010269165, 0.011579751968383789, -0.014754295349121094, 0.03634887933731079, -0.05523961782455444, -0.003050684928894043, -0.04145914316177368, -0.020569324493408203, 0.026113808155059814, -0.039557456970214844, 0.03587818145751953, -0.08395826816558838, -0.033532559871673584, 0.09645628929138184, 0.07532459497451782, 0.056604623794555664, -0.07150644063949585, -0.03851974010467529, 0.02151024341583252, 0.05356043577194214, -0.0377536416053772, -0.0405580997467041, 0.05276757478713989, 0.05042630434036255, 0.03046548366546631, 0.046320438385009766, 0.01654130220413208, -0.05635881423950195, -0.003197312355041504, 0.22211360931396484, 0.04205876588821411, 0.041230738162994385, -0.005217194557189941, 0.06824600696563721, -0.050919532775878906, 0.034889936447143555, 0.03590285778045654, 0.22697889804840088, 0.08643925189971924, -0.08683782815933228, 0.09142255783081055, 0.031773507595062256, 0.015439450740814209, 0.0699763298034668, 0.008937954902648926, -0.037073373794555664, 0.04864293336868286, -0.009195387363433838, -0.005114376544952393, -0.010118484497070312, 0.06356853246688843, 0.02204418182373047, -0.016171753406524658, -0.03170323371887207, 0.08732366561889648, 0.07670581340789795, -0.01255124807357788, 0.22916662693023682, 0.41611233353614807, 0.003823578357696533, -0.04285159707069397, -0.018350303173065186, 0.03716617822647095, -0.07489973306655884, 0.0575675368309021, 0.006612420082092285, 0.06155353784561157, -0.02389615774154663, 0.031355321407318115, 0.06262040138244629, 0.014764785766601562, 0.08730417490005493, 0.7336688041687012, -0.07569915056228638, 0.13855773210525513, -0.01040869951248169, 0.04995417594909668, 0.0004788041114807129, 0.033457159996032715, -0.05452525615692139, -0.00632929801940918, -0.018169879913330078, 0.07877665758132935, 0.12629276514053345, -0.012558698654174805, 0.16724133491516113, -0.024770498275756836, 0.006646633148193359, -0.0059702396392822266, 0.07912147045135498, 0.028807461261749268, 0.03910660743713379, -0.054890215396881104, -0.025479912757873535, 0.02328890562057495, -0.01859426498413086, 0.13270527124404907, 0.0258064866065979, -0.0582890510559082, 0.06825178861618042, 0.007153987884521484, 0.0046610236167907715, -0.04647696018218994, 0.040584027767181396, -0.03486371040344238, 0.06724703311920166, -0.011731088161468506, 0.18499110639095306, 0.036232173442840576, -0.06407541036605835, -0.015847742557525635, -0.0016483068466186523, 0.013905763626098633, 0.02565622329711914, -0.025974750518798828, -0.03572958707809448, 0.005275726318359375, 0.020338356494903564, -0.026254236698150635, -0.019061267375946045, 0.06215089559555054, 0.032465577125549316, 0.0660557746887207, 0.06455326080322266, -0.058830082416534424, 0.057612717151641846, -0.05833083391189575, 0.056151628494262695, 0.025597214698791504, -0.024154722690582275, -0.020882606506347656, -0.025619208812713623, -0.007818758487701416, 0.12752091884613037, -0.08354306221008301, -0.014261782169342041, -0.005169034004211426, -0.009382128715515137, -0.009942471981048584, 0.0028505325317382812, -0.017250418663024902, -0.1314515471458435, 0.12431848049163818, 0.05067455768585205, -0.0441095232963562, 0.024201273918151855, 0.10434597730636597, 0.031078577041625977, 0.06285107135772705, 0.005911886692047119, -0.04037350416183472, -0.0009918212890625, -0.03789973258972168, 0.06203413009643555, 0.2597759962081909, -0.0254707932472229, -0.00824582576751709, 0.03917139768600464, -0.0013646483421325684, 0.010810315608978271, -0.05065727233886719, -0.06346935033798218, -0.01328188180923462, 0.027602791786193848, -0.019639194011688232, 0.04521894454956055, -0.01805812120437622, 0.08709007501602173, -0.008081197738647461, 0.1030580997467041, 0.031836867332458496, 0.011461913585662842, -0.11434173583984375, -0.027392089366912842, 0.04309278726577759, -0.008348464965820312, 0.05248314142227173, -0.032785892486572266, 0.02474874258041382, 0.012269914150238037, 0.04936903715133667, 0.06349551677703857, 0.020161807537078857, 0.03012639284133911, -0.003148674964904785, 0.08653008937835693, 0.005387663841247559, -0.03229248523712158, 0.006866097450256348, -0.04879570007324219, 0.06936734914779663, -0.06791889667510986, -0.019037365913391113, -0.05687856674194336, 0.005361497402191162, 0.012100458145141602, 0.26608771085739136, 0.03594714403152466, -0.013003647327423096, -0.07126259803771973, 0.0357624888420105, -0.019517183303833008, -0.074221670627594, 0.10594433546066284, 0.00017386674880981445, -0.021150171756744385, 0.020658791065216064, 0.00685882568359375, 0.06743216514587402, 0.04494297504425049, 0.07361817359924316, -0.007672011852264404, -0.08773207664489746, 0.05228233337402344, -0.017552554607391357, 0.01205587387084961, 0.1268579363822937, -0.01700448989868164, -0.0487554669380188, -0.048778414726257324, -0.025351345539093018, -0.009576141834259033, 0.023939192295074463, -0.00021469593048095703, -0.02261531352996826, -0.03284025192260742, -0.010386407375335693, -0.02405327558517456, -0.2877159118652344, 0.05938255786895752, 0.04310423135757446, -0.0108528733253479, 0.02438652515411377, 0.029599666595458984, 0.05692601203918457, 0.06022912263870239, -0.0055155158042907715, 0.005282878875732422, -0.005088925361633301, 0.06297427415847778, 0.04410666227340698, 0.04703199863433838, -0.02439969778060913, 0.08378094434738159, -0.0250931978225708, 0.019228994846343994, -0.026402056217193604, 0.003877103328704834, 0.05205214023590088, -0.009072363376617432, -0.009829998016357422, -0.04333597421646118, 0.20627862215042114, 0.01961660385131836, 0.07785278558731079, 0.014116287231445312, -0.023621737957000732, -0.01089489459991455, -0.0073348283767700195, 0.040373921394348145, 0.05670905113220215, 0.07273268699645996, -0.04032343626022339, 0.09965425729751587, -0.02124965190887451, 0.150021493434906, -0.02222764492034912, 0.048139750957489014, -0.0283968448638916, 0.01046055555343628, 0.00803309679031372, -0.011900484561920166, 0.06902956962585449, 0.15440279245376587, 0.04639863967895508, 0.003934919834136963, 0.030313313007354736, 0.022117197513580322, 0.021997272968292236, 0.03077763319015503, 0.0427861213684082, 0.005954623222351074, -0.1443687081336975, -0.024654269218444824, -0.04050344228744507, -0.0393216609954834, 0.0336570143699646, -0.08741742372512817, 0.06792402267456055, 0.03778046369552612, 0.036315321922302246, 0.028846561908721924, -0.03536200523376465, 0.0442618727684021, 0.0075980424880981445, 0.04269009828567505, 0.04873877763748169, 0.004745006561279297, 0.010583877563476562, 0.0314866304397583, 0.044480741024017334, 0.04425323009490967, 0.03551530838012695, 0.024485647678375244, 0.011181354522705078, 0.12312233448028564, 0.011401593685150146, 0.0014202594757080078, 0.03226196765899658, -0.03233778476715088, 0.02670300006866455, 0.10487645864486694, 0.19775313138961792, 0.027030885219573975, -0.043451130390167236, -0.004808962345123291, -0.04276108741760254, 0.06944513320922852, 0.039509356021881104, 0.06505882740020752, 0.06574892997741699, 0.03354191780090332, 0.04672133922576904, -0.005270242691040039, 0.02241593599319458, -0.0017732977867126465, 0.18478354811668396, -0.03358280658721924, -0.044701457023620605, 0.011396408081054688, 0.011324524879455566, 0.039664268493652344, -0.019371867179870605, -0.022124111652374268, 0.02239382266998291, 0.006419360637664795, 0.02792799472808838, -0.004133045673370361, -0.11461126804351807, 0.005372822284698486, -0.015117645263671875, 0.03005039691925049, -0.0771302580833435, -0.010180175304412842, -0.0035194754600524902, 0.09247821569442749, -0.07574015855789185, 0.0034735798835754395, 0.08210831880569458, -0.03345286846160889, -0.019579172134399414, 0.007794380187988281, 0.024471402168273926, -0.029023289680480957, 0.012257754802703857, 0.03575056791305542, -0.05929434299468994, 0.0055735111236572266, -0.04737579822540283, -0.003445923328399658, 0.014105558395385742, 0.02421247959136963, 0.02652716636657715, -0.022986412048339844, 0.2134392261505127, -0.04784524440765381, -0.0447840690612793, -0.05920380353927612, 0.039636313915252686, 0.0231553316116333, -0.06910490989685059, 0.06710243225097656, 0.03695482015609741, 0.09074801206588745, -0.1025005578994751, 0.04740172624588013, 0.028155982494354248, -0.05717581510543823, -0.040091872215270996, 0.0008188486099243164, 0.03285890817642212, 0.05067408084869385, 0.02960723638534546, 0.13864290714263916, 0.02221018075942993, -0.038969576358795166, 0.07676076889038086, -0.02176201343536377, -0.03318983316421509, -0.0594521164894104, -0.013255834579467773, 0.2086857557296753, -0.003806889057159424, 0.13704484701156616, -0.0456995964050293, -0.014224529266357422, 0.04627901315689087, -0.00046116113662719727, -0.019663870334625244, -0.02953636646270752, 0.04361659288406372, 0.029735684394836426, -0.053736090660095215, 0.09748941659927368, 0.0526043176651001, -0.031076908111572266, 0.004309594631195068, 0.11390233039855957, 0.017376184463500977, 0.034477293491363525, -0.03042125701904297, -0.0035196542739868164, 0.055809855461120605, 0.037264466285705566, -0.011976778507232666, 0.0002525448799133301, 0.00561147928237915, -0.019199669361114502, -0.002679288387298584, -0.02985513210296631, 0.09906524419784546, 0.0782352089881897, 0.021974563598632812, 0.02438253164291382, 0.0012467503547668457, 0.1461074948310852, 0.02805715799331665, -0.01904118061065674, 0.09464704990386963, -0.010894238948822021, -0.005289137363433838, -0.08164018392562866, 0.013054728507995605, 0.04046279191970825, -0.004086494445800781, 0.0029432177543640137, -0.038622498512268066, -0.018037617206573486, -0.028994083404541016, 0.05366784334182739, -0.0072585344314575195, 0.08777576684951782, -0.048351287841796875, 0.053588807582855225, 0.07158643007278442, -0.042147278785705566, 0.006593048572540283, 0.037426888942718506, 0.06168490648269653, -0.044636428356170654, 0.029899120330810547, 0.07852065563201904, 0.017842233180999756, 0.06475728750228882, 0.012974202632904053, -0.06000441312789917, 0.015315830707550049, -0.18388211727142334, 0.016896426677703857, 0.0745115876197815, -0.002485811710357666]
error_mean : 4.666963228583336
error_mse : 0.21780545776948992
error_max : 73.36688041687012
error_min : 0.017386674880981445