LCPredict(
  (lin1): Linear(in_features=8, out_features=16, bias=True)
  (sig1): Sigmoid()
  (drp1): Dropout(p=0.3, inplace=False)
  (lin2): Linear(in_features=16, out_features=8, bias=True)
  (sig2): Sigmoid()
  (drp2): Dropout(p=0.2, inplace=False)
  (lin3): Linear(in_features=8, out_features=1, bias=True)
  (sig3): Sigmoid()
)
optimizer : adam, lr : 0.002
epochs : 100
batch size : 8
loss : [0.05427529290318489, 0.014205296523869038, 0.027956869453191757, 0.01975996419787407, 0.03856240212917328, 0.016100265085697174, 0.024347107857465744, 0.015370027162134647, 0.012711199931800365, 0.009353048168122768, 0.007242241874337196, 0.011064598336815834, 0.007976383902132511, 0.015734683722257614, 0.0014460098464041948, 0.004896152764558792, 0.009544549509882927, 0.00850573368370533, 0.010182999074459076, 0.003562022466212511, 0.0038704294711351395, 0.004012121353298426, 0.0036258939653635025, 0.0023201024159789085, 0.006766900420188904, 0.005103420466184616, 0.00399877829477191, 0.001946320291608572, 0.00443238066509366, 0.003971483092755079, 0.0023007988929748535, 0.003949818667024374, 0.0038715440314263105, 0.002050029346719384, 0.005495457910001278, 0.004670615773648024, 0.002192889805883169, 0.009450532495975494, 0.001601445022970438, 0.0076615954749286175, 0.0025016283616423607, 0.0013559645740315318, 0.003949373494833708, 0.004306180868297815, 0.004753178916871548, 0.0028881337493658066, 0.009026938118040562, 0.0006759940879419446, 0.0024803401902318, 0.002668134169653058, 0.0012819768162444234, 0.002010033931583166, 0.0039056986570358276, 0.0028345161117613316, 0.003842897480353713, 0.0013423734344542027, 0.001994456397369504, 0.0022514648735523224, 0.001666178461164236, 0.0015197312459349632, 0.003094799816608429, 0.003164604539051652, 0.0005756668979302049, 0.006286061368882656, 0.003882691729813814, 0.0006546528893522918, 0.0018082688329741359, 0.001967362593859434, 0.002748359926044941, 0.0011425090488046408, 0.0021374926436692476, 0.004187897313386202, 0.0010594554478302598, 0.0011253644479438663, 0.0015158441383391619, 0.0015364126302301884, 0.0023125107400119305, 0.0007869970286265016, 0.0020475115161389112, 0.002910355105996132, 0.0021635538432747126, 0.0033170259557664394, 0.001957113156095147, 0.0028243446722626686, 0.0038698301650583744, 0.002628747373819351, 0.0033764438703656197, 0.0015638279728591442, 0.0028558538760989904, 0.003386671422049403, 0.005345678888261318, 0.008840720169246197, 0.0009348418097943068, 0.002449026331305504, 0.0026223266031593084, 0.00558952521532774, 0.0012022567680105567, 0.0013643507845699787, 0.0012002720031887293, 0.004417962394654751]
error_abs : [0.1082601547241211, 0.03423810005187988, 0.012638390064239502, 0.07062399387359619, 0.04620248079299927, 0.018710613250732422, 0.08239161968231201, 0.0330348014831543, 0.12975621223449707, 0.0071492791175842285, 0.0533604621887207, 0.1343401074409485, 0.02140098810195923, 0.026066958904266357, 0.058867692947387695, 0.04679960012435913, 0.03280746936798096, 0.16673994064331055, 0.018259644508361816, 0.023024678230285645, 0.039145708084106445, 0.04437905550003052, 0.029628396034240723, 0.06178957223892212, 0.1731722056865692, 0.052886784076690674, 0.027810633182525635, 0.019215762615203857, 0.02053779363632202, 0.03322124481201172, 0.09879803657531738, 0.07380717992782593, 0.0052217841148376465, 0.02273404598236084, 0.057386934757232666, 0.037869811058044434, 0.025142014026641846, 0.06671744585037231, 0.047390520572662354, 0.10233688354492188, 0.03949105739593506, 0.0734260082244873, 0.08895856142044067, 0.08256542682647705, 0.014224529266357422, 0.010578453540802002, 0.05687248706817627, 0.020344197750091553, 0.07448184490203857, 0.07656878232955933, 0.024583399295806885, 0.010210156440734863, 0.07498717308044434, 0.06564384698867798, 0.11654651165008545, 0.06646567583084106, 0.0021046996116638184, 0.08097374439239502, 0.0013073086738586426, 0.029878318309783936, 0.07610225677490234, 0.011553704738616943, 0.013200998306274414, 0.022600650787353516, 0.08251988887786865, 0.0311853289604187, 0.009550034999847412, 0.019701600074768066, 0.08755451440811157, 0.031542837619781494, 0.0625838041305542, 0.020804286003112793, 0.04129594564437866, 0.04159444570541382, 0.026412367820739746, 0.10707169771194458, 0.10671067237854004, 0.01657235622406006, 0.09845936298370361, 0.022901713848114014, 0.029550671577453613, 0.0250818133354187, 0.03423452377319336, 0.01979464292526245, 0.10224646329879761, 0.11153191328048706, 0.021476387977600098, 0.009004831314086914, 0.06494605541229248, 0.1124381422996521, 0.07701534032821655, 0.017683804035186768, 0.03463029861450195, 0.005924403667449951, 0.010467350482940674, 0.06994640827178955, 0.0504755973815918, 0.2675801217556, 0.044466614723205566, 0.10126221179962158, 0.011983096599578857, 0.118527352809906, 0.0358586311340332, 0.12861990928649902, 0.0103837251663208, 0.11952859163284302, 0.04996657371520996, 0.025829732418060303, 0.06226104497909546, 0.03362619876861572, 0.05653113126754761, 0.5874760150909424, 0.0404396653175354, 0.16026407480239868, 0.02835613489151001, 0.029151439666748047, 0.11936157941818237, 0.02742934226989746, 0.0006039738655090332, 0.023512065410614014, 0.059381067752838135, 0.03327852487564087, 0.008793532848358154, 0.04027169942855835, 0.14114171266555786, 0.06377863883972168, 0.006079554557800293, 0.037642836570739746, 0.03105151653289795, 0.004025638103485107, 0.04228144884109497, 0.034375667572021484, 0.021845638751983643, 0.026010990142822266, 0.002098560333251953, 0.032203733921051025, 0.03764408826828003, 0.04404294490814209, 0.03639721870422363, 0.019736289978027344, 0.004543781280517578, 0.04174727201461792, 0.11217939853668213, 0.025298774242401123, 0.015624284744262695, 0.09555011987686157, 0.502498671412468, 0.025382399559020996, 0.07687795162200928, 0.027884960174560547, 0.07362943887710571, 0.08027017116546631, 0.06981652975082397, 0.04131627082824707, 0.025012195110321045, 0.014551281929016113, 0.0977553129196167, 0.11702162027359009, 0.0373651385307312, 0.13130682706832886, 0.0060822367668151855, 0.05774158239364624, 0.01625460386276245, 0.09003335237503052, 0.060501158237457275, 0.0376473069190979, 0.08019614219665527, 0.08560967445373535, 0.1606234312057495, 0.038345515727996826, 0.007346034049987793, 0.09423559904098511, 0.08808577060699463, 0.11819791793823242, 0.03365778923034668, 0.022773325443267822, 0.010968804359436035, 0.12896007299423218, 0.05258786678314209, 0.0950843095779419, 0.09386515617370605, 0.12483006715774536, 0.02042841911315918, 0.0013605952262878418, 0.08244305849075317, 0.13547676801681519, 0.026142776012420654, 0.08257776498794556, 0.05580049753189087, 0.023716986179351807, 0.02715015411376953, 0.046074628829956055, 0.10811805725097656, 0.11612695455551147, 0.09660643339157104, 0.008277297019958496, 0.0680587887763977, 0.013604998588562012, 0.022594928741455078, 0.029696941375732422, 0.06309682130813599, 0.08851337432861328, 0.08760172128677368, 0.006213843822479248, 0.03529900312423706, 0.10694342851638794, 0.08738040924072266, 0.04532879590988159, 0.028806746006011963, 0.1263580322265625, 0.022029340267181396, 0.07831317186355591, 0.021694839000701904, 0.015280604362487793, 0.08281886577606201, 0.006728053092956543, 0.016249537467956543, 0.008472263813018799, 0.029612362384796143, 0.02568209171295166, 0.07606106996536255, 0.00010228157043457031, 0.08984333276748657, 0.026602745056152344, 0.007680654525756836, 0.07759004831314087, 0.05494880676269531, 0.041394591331481934, 0.02851247787475586, 0.012385785579681396, 0.07895994186401367, 0.06716525554656982, 0.02321702241897583, 0.018705010414123535, 0.1493971347808838, 0.08936381340026855, 0.02013617753982544, 0.08247482776641846, 0.0416378378868103, 0.0182802677154541, 0.06431162357330322, 0.006951630115509033, 0.035986363887786865, 0.021954476833343506, 0.0670514702796936, 0.022364675998687744, 0.035422682762145996, 0.021380126476287842, 0.023329079151153564, 0.05573141574859619, 0.021331071853637695, 0.013454318046569824, 0.04877990484237671, 0.10135489702224731, 0.034458935260772705, 0.06954532861709595, 0.04477107524871826, 0.010045945644378662, 0.0026559829711914062, 0.00745922327041626, 0.00162506103515625, 0.0056191086769104, 0.0514865517616272, 0.03661984205245972, 0.07123434543609619, 0.03539353609085083, 0.06538254022598267, 0.060350775718688965, 0.03615677356719971, 0.011074423789978027, 0.01503843069076538, 0.018474996089935303, 0.023687362670898438, 0.08952605724334717, 0.030673086643218994, 0.05050903558731079, 0.08366334438323975, 0.0302545428276062, 0.08332693576812744, 0.040589749813079834, 0.0077721476554870605, 0.05611157417297363, 0.0730818510055542, 0.08976572751998901, 0.026337623596191406, 0.05958503484725952, 0.05869501829147339, 0.007052481174468994, 0.021887660026550293, 0.03008824586868286, 0.09413832426071167, 0.07599645853042603, 0.08917760848999023, 0.03299170732498169, 0.022455275058746338, 0.04708939790725708, 0.023717164993286133, 0.04074209928512573, 0.03829777240753174, 0.08156991004943848, 0.05016046762466431, 0.028164446353912354, 0.12198573350906372, 0.0716937780380249, 0.018825531005859375, 0.07664138078689575, 0.08648616075515747, 0.030824482440948486, 0.054950833320617676, 0.03483283519744873, 0.011684417724609375, 0.024611055850982666, 0.0520474910736084, 0.012163639068603516, 0.021887123584747314, 0.003493070602416992, 0.0508384108543396, 0.10721784830093384, 0.07056170701980591, 0.01415717601776123, 0.0234413743019104, 0.04078817367553711, 0.023463547229766846, 0.07417988777160645, 0.03817671537399292, 0.0934860110282898, 0.02112334966659546, 0.0661502480506897, 0.0063748955726623535, 0.009183108806610107, 0.020201563835144043, 0.049677133560180664, 0.003695070743560791, 0.011960625648498535, 0.02453845739364624, 0.0677521824836731, 0.013204336166381836, 0.028681278228759766, 0.02948319911956787, 0.032697081565856934, 0.01604849100112915, 0.043365418910980225, 0.046475887298583984, 0.10971593856811523, 0.05753141641616821, 0.03832578659057617, 0.06175774335861206, 0.007838189601898193, 0.07239609956741333, 0.05294215679168701, 0.2554415464401245, 0.06670248508453369, 0.013319313526153564, 0.039852261543273926, 0.033431947231292725, 0.022863030433654785, 0.13512474298477173, 0.04562860727310181, 0.023608922958374023, 0.03058987855911255, 0.02861034870147705, 0.06395387649536133, 0.021619975566864014, 0.01611804962158203, 0.0966525673866272, 0.2596243917942047, 0.10624188184738159, 0.04265904426574707, 0.022402465343475342, 0.02087944746017456, 0.09271889925003052, 0.1070551872253418, 0.08286917209625244, 0.012146592140197754, 0.004172921180725098, 0.039200425148010254, 0.032093822956085205, 0.16263586282730103, 0.05818891525268555, 0.014757275581359863, 0.10934364795684814, 0.04032278060913086, 0.06405025720596313, 0.07976889610290527, 0.24788108468055725, 0.08290630578994751, 0.031938791275024414, 0.042763590812683105, 0.015998899936676025, 0.040070533752441406, 0.02763819694519043, 0.0232885479927063, 0.09969395399093628, 0.09900623559951782, 0.02382361888885498, 0.0741204023361206, 0.04334390163421631, 0.03423184156417847, 0.0036484599113464355, 0.05542820692062378, 0.014128386974334717, 0.044290900230407715, 0.12622374296188354, 0.1400781273841858, 0.06664705276489258, 0.07266169786453247, 0.028575778007507324, 0.10697627067565918, 0.048826634883880615, 0.014196455478668213, 0.0228193998336792, 0.005685746669769287, 0.05290877819061279, 0.01128917932510376, 0.04327589273452759, 0.05231881141662598, 0.05574381351470947, 0.061903536319732666, 0.09198641777038574, 0.025456488132476807, 0.04608875513076782, 0.06449323892593384, 0.08357912302017212, 0.08569419384002686, 0.06356745958328247, 0.0869627594947815, 0.11349654197692871, 0.04877656698226929, 0.16787827014923096, 0.01658320426940918, 0.19764673709869385, 0.028119802474975586, 0.10001033544540405, 0.03582257032394409, 0.15459877252578735, 0.025600671768188477, 0.11678874492645264, 0.03464055061340332, 0.013919949531555176, 0.13794177770614624, 0.06303638219833374, 0.0034444332122802734, 0.07569944858551025, 0.02368265390396118, 0.1351647973060608, 0.012145519256591797, 0.015061914920806885, 0.000962674617767334, 0.020880281925201416, 0.027704060077667236, 0.011651933193206787, 0.03504401445388794, 0.06017512083053589, 0.04191333055496216, 0.04011720418930054, 0.019034087657928467, 0.0322604775428772, 0.020295143127441406, 0.03512698411941528, 0.03239941596984863, 0.07930368185043335, 0.03405100107192993, 0.06731081008911133, 0.10385650396347046, 0.0633959174156189, 0.008147895336151123, 0.09468382596969604, 0.0785144567489624, 0.008509218692779541, 0.05316007137298584, 0.14080196619033813, 0.02137964963912964, 0.049163639545440674, 0.0346217155456543, 0.089480459690094, 0.060834288597106934, 0.075092613697052, 0.06292808055877686, 0.14931821823120117, 0.0005608797073364258, 0.008781194686889648, 0.04619753360748291, 0.06491953134536743, 0.02099454402923584, 0.08244472742080688, 0.07924187183380127, 0.01046067476272583, 0.1025654673576355, 0.08745777606964111, 0.017472267150878906, 0.04371732473373413, 0.031660377979278564, 0.010851383209228516, 0.007884085178375244, 0.015379726886749268, 0.0230025053024292, 0.1193091869354248, 0.07529056072235107, 0.03687006235122681, 0.0507473349571228]
error_signed : [0.1082601547241211, 0.03423810005187988, -0.012638390064239502, 0.07062399387359619, -0.04620248079299927, -0.018710613250732422, -0.08239161968231201, -0.0330348014831543, -0.12975621223449707, 0.0071492791175842285, 0.0533604621887207, 0.1343401074409485, 0.02140098810195923, -0.026066958904266357, -0.058867692947387695, -0.04679960012435913, 0.03280746936798096, 0.16673994064331055, -0.018259644508361816, 0.023024678230285645, -0.039145708084106445, -0.04437905550003052, 0.029628396034240723, -0.06178957223892212, 0.1731722056865692, -0.052886784076690674, 0.027810633182525635, -0.019215762615203857, 0.02053779363632202, -0.03322124481201172, 0.09879803657531738, -0.07380717992782593, -0.0052217841148376465, -0.02273404598236084, 0.057386934757232666, 0.037869811058044434, 0.025142014026641846, 0.06671744585037231, 0.047390520572662354, 0.10233688354492188, 0.03949105739593506, -0.0734260082244873, 0.08895856142044067, -0.08256542682647705, -0.014224529266357422, -0.010578453540802002, 0.05687248706817627, 0.020344197750091553, -0.07448184490203857, 0.07656878232955933, -0.024583399295806885, -0.010210156440734863, 0.07498717308044434, 0.06564384698867798, 0.11654651165008545, 0.06646567583084106, -0.0021046996116638184, 0.08097374439239502, -0.0013073086738586426, -0.029878318309783936, 0.07610225677490234, 0.011553704738616943, -0.013200998306274414, 0.022600650787353516, 0.08251988887786865, -0.0311853289604187, 0.009550034999847412, 0.019701600074768066, 0.08755451440811157, 0.031542837619781494, -0.0625838041305542, 0.020804286003112793, 0.04129594564437866, 0.04159444570541382, -0.026412367820739746, 0.10707169771194458, 0.10671067237854004, 0.01657235622406006, -0.09845936298370361, 0.022901713848114014, -0.029550671577453613, 0.0250818133354187, 0.03423452377319336, -0.01979464292526245, -0.10224646329879761, 0.11153191328048706, 0.021476387977600098, -0.009004831314086914, -0.06494605541229248, 0.1124381422996521, 0.07701534032821655, -0.017683804035186768, 0.03463029861450195, 0.005924403667449951, -0.010467350482940674, 0.06994640827178955, 0.0504755973815918, 0.2675801217556, 0.044466614723205566, 0.10126221179962158, 0.011983096599578857, 0.118527352809906, -0.0358586311340332, 0.12861990928649902, -0.0103837251663208, -0.11952859163284302, -0.04996657371520996, -0.025829732418060303, 0.06226104497909546, 0.03362619876861572, 0.05653113126754761, 0.5874760150909424, -0.0404396653175354, 0.16026407480239868, 0.02835613489151001, 0.029151439666748047, -0.11936157941818237, -0.02742934226989746, 0.0006039738655090332, -0.023512065410614014, -0.059381067752838135, 0.03327852487564087, -0.008793532848358154, -0.04027169942855835, 0.14114171266555786, -0.06377863883972168, 0.006079554557800293, 0.037642836570739746, -0.03105151653289795, -0.004025638103485107, 0.04228144884109497, -0.034375667572021484, 0.021845638751983643, -0.026010990142822266, 0.002098560333251953, 0.032203733921051025, -0.03764408826828003, 0.04404294490814209, -0.03639721870422363, -0.019736289978027344, 0.004543781280517578, 0.04174727201461792, -0.11217939853668213, 0.025298774242401123, 0.015624284744262695, 0.09555011987686157, 0.502498671412468, 0.025382399559020996, -0.07687795162200928, -0.027884960174560547, 0.07362943887710571, -0.08027017116546631, 0.06981652975082397, -0.04131627082824707, -0.025012195110321045, -0.014551281929016113, -0.0977553129196167, -0.11702162027359009, 0.0373651385307312, 0.13130682706832886, -0.0060822367668151855, 0.05774158239364624, 0.01625460386276245, 0.09003335237503052, 0.060501158237457275, 0.0376473069190979, -0.08019614219665527, 0.08560967445373535, -0.1606234312057495, 0.038345515727996826, 0.007346034049987793, -0.09423559904098511, 0.08808577060699463, -0.11819791793823242, 0.03365778923034668, -0.022773325443267822, 0.010968804359436035, -0.12896007299423218, 0.05258786678314209, 0.0950843095779419, 0.09386515617370605, 0.12483006715774536, 0.02042841911315918, 0.0013605952262878418, 0.08244305849075317, 0.13547676801681519, 0.026142776012420654, -0.08257776498794556, 0.05580049753189087, -0.023716986179351807, -0.02715015411376953, -0.046074628829956055, -0.10811805725097656, 0.11612695455551147, -0.09660643339157104, 0.008277297019958496, -0.0680587887763977, -0.013604998588562012, 0.022594928741455078, 0.029696941375732422, -0.06309682130813599, -0.08851337432861328, 0.08760172128677368, 0.006213843822479248, -0.03529900312423706, -0.10694342851638794, 0.08738040924072266, 0.04532879590988159, -0.028806746006011963, -0.1263580322265625, -0.022029340267181396, -0.07831317186355591, -0.021694839000701904, 0.015280604362487793, -0.08281886577606201, 0.006728053092956543, 0.016249537467956543, -0.008472263813018799, -0.029612362384796143, 0.02568209171295166, 0.07606106996536255, 0.00010228157043457031, 0.08984333276748657, -0.026602745056152344, -0.007680654525756836, 0.07759004831314087, 0.05494880676269531, -0.041394591331481934, 0.02851247787475586, -0.012385785579681396, 0.07895994186401367, -0.06716525554656982, 0.02321702241897583, -0.018705010414123535, -0.1493971347808838, 0.08936381340026855, -0.02013617753982544, -0.08247482776641846, -0.0416378378868103, -0.0182802677154541, 0.06431162357330322, -0.006951630115509033, 0.035986363887786865, 0.021954476833343506, -0.0670514702796936, -0.022364675998687744, 0.035422682762145996, 0.021380126476287842, 0.023329079151153564, 0.05573141574859619, -0.021331071853637695, -0.013454318046569824, 0.04877990484237671, -0.10135489702224731, 0.034458935260772705, 0.06954532861709595, 0.04477107524871826, 0.010045945644378662, -0.0026559829711914062, 0.00745922327041626, 0.00162506103515625, -0.0056191086769104, -0.0514865517616272, -0.03661984205245972, 0.07123434543609619, 0.03539353609085083, -0.06538254022598267, 0.060350775718688965, 0.03615677356719971, 0.011074423789978027, 0.01503843069076538, -0.018474996089935303, 0.023687362670898438, 0.08952605724334717, -0.030673086643218994, -0.05050903558731079, -0.08366334438323975, 0.0302545428276062, 0.08332693576812744, 0.040589749813079834, -0.0077721476554870605, -0.05611157417297363, 0.0730818510055542, -0.08976572751998901, 0.026337623596191406, -0.05958503484725952, 0.05869501829147339, 0.007052481174468994, -0.021887660026550293, 0.03008824586868286, -0.09413832426071167, 0.07599645853042603, -0.08917760848999023, 0.03299170732498169, 0.022455275058746338, 0.04708939790725708, 0.023717164993286133, 0.04074209928512573, 0.03829777240753174, 0.08156991004943848, 0.05016046762466431, -0.028164446353912354, 0.12198573350906372, -0.0716937780380249, 0.018825531005859375, 0.07664138078689575, 0.08648616075515747, -0.030824482440948486, 0.054950833320617676, -0.03483283519744873, 0.011684417724609375, -0.024611055850982666, 0.0520474910736084, -0.012163639068603516, 0.021887123584747314, -0.003493070602416992, -0.0508384108543396, 0.10721784830093384, -0.07056170701980591, 0.01415717601776123, 0.0234413743019104, -0.04078817367553711, 0.023463547229766846, -0.07417988777160645, -0.03817671537399292, 0.0934860110282898, 0.02112334966659546, 0.0661502480506897, 0.0063748955726623535, -0.009183108806610107, 0.020201563835144043, -0.049677133560180664, 0.003695070743560791, 0.011960625648498535, 0.02453845739364624, -0.0677521824836731, -0.013204336166381836, 0.028681278228759766, -0.02948319911956787, 0.032697081565856934, 0.01604849100112915, -0.043365418910980225, 0.046475887298583984, -0.10971593856811523, 0.05753141641616821, 0.03832578659057617, 0.06175774335861206, -0.007838189601898193, -0.07239609956741333, 0.05294215679168701, 0.2554415464401245, 0.06670248508453369, 0.013319313526153564, 0.039852261543273926, -0.033431947231292725, -0.022863030433654785, -0.13512474298477173, 0.04562860727310181, 0.023608922958374023, 0.03058987855911255, 0.02861034870147705, 0.06395387649536133, -0.021619975566864014, -0.01611804962158203, -0.0966525673866272, 0.2596243917942047, -0.10624188184738159, -0.04265904426574707, -0.022402465343475342, 0.02087944746017456, 0.09271889925003052, -0.1070551872253418, -0.08286917209625244, 0.012146592140197754, 0.004172921180725098, -0.039200425148010254, 0.032093822956085205, -0.16263586282730103, -0.05818891525268555, -0.014757275581359863, 0.10934364795684814, 0.04032278060913086, -0.06405025720596313, -0.07976889610290527, 0.24788108468055725, -0.08290630578994751, 0.031938791275024414, 0.042763590812683105, 0.015998899936676025, 0.040070533752441406, -0.02763819694519043, -0.0232885479927063, -0.09969395399093628, 0.09900623559951782, 0.02382361888885498, 0.0741204023361206, -0.04334390163421631, -0.03423184156417847, -0.0036484599113464355, 0.05542820692062378, 0.014128386974334717, 0.044290900230407715, -0.12622374296188354, 0.1400781273841858, -0.06664705276489258, 0.07266169786453247, 0.028575778007507324, -0.10697627067565918, 0.048826634883880615, -0.014196455478668213, 0.0228193998336792, 0.005685746669769287, 0.05290877819061279, -0.01128917932510376, 0.04327589273452759, 0.05231881141662598, -0.05574381351470947, -0.061903536319732666, 0.09198641777038574, 0.025456488132476807, -0.04608875513076782, 0.06449323892593384, 0.08357912302017212, 0.08569419384002686, 0.06356745958328247, 0.0869627594947815, -0.11349654197692871, -0.04877656698226929, -0.16787827014923096, 0.01658320426940918, 0.19764673709869385, -0.028119802474975586, 0.10001033544540405, 0.03582257032394409, 0.15459877252578735, 0.025600671768188477, -0.11678874492645264, -0.03464055061340332, -0.013919949531555176, 0.13794177770614624, -0.06303638219833374, -0.0034444332122802734, 0.07569944858551025, 0.02368265390396118, -0.1351647973060608, -0.012145519256591797, -0.015061914920806885, 0.000962674617767334, -0.020880281925201416, 0.027704060077667236, 0.011651933193206787, 0.03504401445388794, 0.06017512083053589, -0.04191333055496216, -0.04011720418930054, -0.019034087657928467, 0.0322604775428772, -0.020295143127441406, -0.03512698411941528, 0.03239941596984863, 0.07930368185043335, 0.03405100107192993, 0.06731081008911133, -0.10385650396347046, 0.0633959174156189, -0.008147895336151123, 0.09468382596969604, -0.0785144567489624, 0.008509218692779541, 0.05316007137298584, -0.14080196619033813, -0.02137964963912964, -0.049163639545440674, -0.0346217155456543, 0.089480459690094, -0.060834288597106934, -0.075092613697052, -0.06292808055877686, 0.14931821823120117, -0.0005608797073364258, -0.008781194686889648, 0.04619753360748291, 0.06491953134536743, -0.02099454402923584, -0.08244472742080688, -0.07924187183380127, -0.01046067476272583, 0.1025654673576355, -0.08745777606964111, -0.017472267150878906, 0.04371732473373413, -0.031660377979278564, 0.010851383209228516, 0.007884085178375244, 0.015379726886749268, 0.0230025053024292, -0.1193091869354248, -0.07529056072235107, 0.03687006235122681, -0.0507473349571228]
error_mean : 5.448840841650963
error_mse : 0.2968986651764357
error_max : 58.74760150909424
error_min : 0.010228157043457031