LCPredict(
  (lin1): Linear(in_features=8, out_features=16, bias=True)
  (sig1): Sigmoid()
  (drp1): Dropout(p=0.3, inplace=False)
  (lin2): Linear(in_features=16, out_features=8, bias=True)
  (sig2): Sigmoid()
  (drp2): Dropout(p=0.2, inplace=False)
  (lin3): Linear(in_features=8, out_features=1, bias=True)
  (sig3): Sigmoid()
)
optimizer : adam, lr : 0.002
epochs : 100
batch size : 8
loss : [0.18352732062339783, 0.09083174914121628, 0.04773852974176407, 0.1253572255373001, 0.07475945353507996, 0.05482585355639458, 0.05277131497859955, 0.0652182400226593, 0.05347909405827522, 0.026911994442343712, 0.0492406040430069, 0.019757859408855438, 0.03448242321610451, 0.010705544613301754, 0.018277525901794434, 0.01912127248942852, 0.014550036750733852, 0.01682545244693756, 0.01575230062007904, 0.013288290239870548, 0.009937744587659836, 0.006775685586035252, 0.01231617946177721, 0.009654485620558262, 0.0090932073071599, 0.008670180104672909, 0.005296485498547554, 0.005171600729227066, 0.011218607425689697, 0.011265750043094158, 0.009234234690666199, 0.006492402870208025, 0.008537855930626392, 0.005609174259006977, 0.0015439941780641675, 0.0028410882223397493, 0.0021282252855598927, 0.004479001741856337, 0.005044029094278812, 0.0059378482401371, 0.004206313285976648, 0.0029097362421453, 0.0033544893376529217, 0.004213808570057154, 0.00435249600559473, 0.004876870661973953, 0.004759521223604679, 0.0015038314741104841, 0.0025558220222592354, 0.004490623250603676, 0.002837694250047207, 0.0023537282831966877, 0.0013995454646646976, 0.0018106296192854643, 0.002141050063073635, 0.002559301909059286, 0.0036124142352491617, 0.0021063960157334805, 0.0012599880574271083, 0.0021840815898030996, 0.0006173005676828325, 0.004182653035968542, 0.0034213713370263577, 0.005091066472232342, 0.004095383919775486, 0.0024876375682651997, 0.0035144600551575422, 0.0020337668247520924, 0.003253188682720065, 0.0026259124279022217, 0.001967216609045863, 0.0028227262664586306, 0.002509460784494877, 0.0028420891612768173, 0.0032368828542530537, 0.005657966248691082, 0.0030667949467897415, 0.003090220270678401, 0.002918568206951022, 0.002135274466127157, 0.0021458500996232033, 0.0009511890821158886, 0.000687844236381352, 0.0012670072028413415, 0.0026610256172716618, 0.0026932384353131056, 0.0038731731474399567, 0.003145085647702217, 0.002319859340786934, 0.007502412423491478, 0.0009562845807522535, 0.003274553921073675, 0.0025173549074679613, 0.0023650131188333035, 0.005013805348426104, 0.0025465930812060833, 0.002872126642614603, 0.00199058186262846, 0.0019499375484883785, 0.006293978542089462]
error_abs : [0.0574607253074646, 0.02622610330581665, 0.0630078911781311, 0.0820850133895874, 0.029416024684906006, 0.0942842960357666, 0.10046190023422241, 0.05539768934249878, 0.1087789535522461, 0.22691839933395386, 0.051831841468811035, 0.013963401317596436, 0.06667262315750122, 0.04638546705245972, 0.0018302202224731445, 0.0902819037437439, 0.07130050659179688, 0.13652795553207397, 0.01845163106918335, 0.06842547655105591, 0.05520284175872803, 0.1352357268333435, 0.04734373092651367, 0.07942116260528564, 0.18606480956077576, 0.051906704902648926, 0.03907430171966553, 0.0050392746925354, 0.04112929105758667, 0.04942309856414795, 0.12091577053070068, 0.04594922065734863, 0.037316977977752686, 0.09085285663604736, 0.060090065002441406, 0.2221432328224182, 0.04704958200454712, 0.0011395812034606934, 0.02451145648956299, 0.03415966033935547, 0.023275136947631836, 0.007175564765930176, 0.04032844305038452, 0.03038877248764038, 0.0324745774269104, 0.05606579780578613, 0.07037395238876343, 0.016001760959625244, 0.0727090835571289, 0.02604961395263672, 0.19396179914474487, 0.04485368728637695, 0.008350968360900879, 0.002349257469177246, 0.15334558486938477, 0.049565792083740234, 0.036320507526397705, 0.030183255672454834, 0.007233858108520508, 0.04074209928512573, 0.0003248453140258789, 0.03816264867782593, 0.01633131504058838, 0.05167728662490845, 0.05444282293319702, 0.07581943273544312, 0.007851243019104004, 0.10336863994598389, 0.08002299070358276, 0.005653560161590576, 0.008839726448059082, 0.03865492343902588, 0.02310281991958618, 0.04588449001312256, 0.07808959484100342, 0.058539509773254395, 0.16082823276519775, 0.06740844249725342, 0.04211777448654175, 0.11145156621932983, 0.007852256298065186, 0.07360202074050903, 0.0629422664642334, 0.1054149866104126, 0.013242900371551514, 0.00021857023239135742, 0.05921655893325806, 0.03633385896682739, 0.0729643702507019, 0.005087673664093018, 0.03984135389328003, 0.01645272970199585, 0.00998067855834961, 0.04053986072540283, 0.001870274543762207, 0.10788309574127197, 0.04104667901992798, 0.2704971134662628, 0.03863447904586792, 0.09117919206619263, 0.07199311256408691, 0.06278705596923828, 0.05048114061355591, 0.11768341064453125, 0.07333153486251831, 0.008604705333709717, 0.03498125076293945, 0.028855323791503906, 0.0790058970451355, 0.13216400146484375, 0.056121885776519775, 0.5895423889160156, 0.05832391977310181, 0.1101536750793457, 0.053139448165893555, 0.09741556644439697, 0.043916523456573486, 0.013929367065429688, 0.054133474826812744, 0.04885685443878174, 0.08222591876983643, 0.015181124210357666, 0.05424433946609497, 0.010137379169464111, 0.15593719482421875, 0.03784310817718506, 0.04167652130126953, 0.0403437614440918, 0.009692609310150146, 0.010388791561126709, 0.04954195022583008, 0.02927863597869873, 0.0027498602867126465, 0.04739832878112793, 0.0064945220947265625, 0.10806792974472046, 0.005159258842468262, 0.06188851594924927, 0.026653051376342773, 0.040322303771972656, 0.004061222076416016, 0.038002967834472656, 0.04782670736312866, 0.029299259185791016, 0.0023429393768310547, 0.03986048698425293, 0.5045850723981857, 0.005377829074859619, 0.0835997462272644, 0.025364935398101807, 0.03354376554489136, 0.03542357683181763, 0.08474475145339966, 0.09393376111984253, 0.05303758382797241, 0.07319438457489014, 0.06990683078765869, 0.05404996871948242, 0.03852468729019165, 0.08460652828216553, 0.07151675224304199, 0.052637457847595215, 0.017621397972106934, 0.041378021240234375, 0.012578487396240234, 0.005142092704772949, 0.0526544451713562, 0.08614426851272583, 0.10493314266204834, 0.044836223125457764, 0.023914992809295654, 0.06230217218399048, 0.0018602609634399414, 0.04226952791213989, 0.06902569532394409, 0.09837883710861206, 0.12040078639984131, 0.029239535331726074, 0.06698489189147949, 0.05280327796936035, 0.07803040742874146, 0.06312453746795654, 0.05542021989822388, 0.0012243986129760742, 0.09971517324447632, 0.14186090230941772, 0.039601802825927734, 0.04641157388687134, 0.09551757574081421, 0.033653974533081055, 0.00836789608001709, 0.05070894956588745, 0.0442737340927124, 0.11689025163650513, 0.15045732259750366, 0.000720977783203125, 0.009701430797576904, 0.050937116146087646, 0.013481855392456055, 0.03322690725326538, 0.02899324893951416, 0.038792192935943604, 0.030525803565979004, 0.09922021627426147, 0.02529686689376831, 0.06707620620727539, 0.07628780603408813, 0.0258331298828125, 0.018063843250274658, 0.021147608757019043, 0.045512855052948, 0.11087554693222046, 0.007247745990753174, 0.08825057744979858, 0.011337816715240479, 0.06435966491699219, 0.012022793292999268, 0.0015137195587158203, 0.039940595626831055, 0.041110336780548096, 0.03333926200866699, 0.15217387676239014, 0.08031433820724487, 0.0010263919830322266, 0.0024033188819885254, 0.007911264896392822, 0.0641661286354065, 0.008675813674926758, 0.0020564794540405273, 0.008706390857696533, 0.03695535659790039, 0.03293699026107788, 0.12232577800750732, 0.09082412719726562, 0.027937352657318115, 0.13187956809997559, 0.11643731594085693, 0.07343196868896484, 0.037915825843811035, 0.029255926609039307, 0.017876923084259033, 0.012329459190368652, 0.027307450771331787, 0.049487411975860596, 0.05886578559875488, 0.05414670705795288, 0.04791665077209473, 0.03446000814437866, 0.014775097370147705, 0.016065478324890137, 0.016984105110168457, 0.03420543670654297, 0.022746801376342773, 0.044884562492370605, 0.04557746648788452, 0.07756388187408447, 0.0005920529365539551, 0.032321155071258545, 0.09012144804000854, 0.03225952386856079, 0.02861720323562622, 0.01867532730102539, 0.04679757356643677, 0.012906014919281006, 0.03239172697067261, 0.09168416261672974, 0.062249600887298584, 0.05381476879119873, 0.007506251335144043, 0.04968756437301636, 0.007136225700378418, 0.02014225721359253, 0.11657881736755371, 0.014830708503723145, 0.04327964782714844, 0.020478665828704834, 0.09865331649780273, 0.03484499454498291, 0.061237215995788574, 0.020197033882141113, 0.12278801202774048, 0.18740904331207275, 0.11453127861022949, 0.014386534690856934, 0.0039841532707214355, 0.04213780164718628, 0.04201275110244751, 0.07532840967178345, 0.03683888912200928, 0.10119861364364624, 0.07032418251037598, 0.06266283988952637, 0.0888141393661499, 0.03260535001754761, 0.04743170738220215, 0.020800769329071045, 0.05005723237991333, 0.08414971828460693, 0.09856534004211426, 0.10315418243408203, 0.10495883226394653, 0.05891096591949463, 0.07348698377609253, 0.01662832498550415, 0.0994688868522644, 0.03210550546646118, 0.11038780212402344, 0.046570777893066406, 0.08859807252883911, 0.07587367296218872, 0.015878498554229736, 0.08321338891983032, 0.107391357421875, 0.027417659759521484, 0.024596989154815674, 0.03199279308319092, 0.047856807708740234, 0.03484529256820679, 0.0070648193359375, 0.03886222839355469, 0.02248513698577881, 0.03500574827194214, 0.03355848789215088, 0.037703514099121094, 0.006578266620635986, 0.09719592332839966, 0.05736726522445679, 0.03674507141113281, 0.06733345985412598, 0.06915479898452759, 0.05257284641265869, 0.058165669441223145, 0.049707889556884766, 0.04324901103973389, 0.05862283706665039, 0.10174989700317383, 0.09095263481140137, 0.08865022659301758, 0.0511782169342041, 0.1338217854499817, 0.049777090549468994, 0.03821516036987305, 0.154521644115448, 0.04468816518783569, 0.03585183620452881, 0.04265695810317993, 0.00727003812789917, 0.026178061962127686, 0.0435335636138916, 0.0037412047386169434, 0.09036380052566528, 0.07606738805770874, 0.03009474277496338, 0.012939393520355225, 0.03579014539718628, 0.027446866035461426, 0.0019608139991760254, 0.17713844776153564, 0.002379775047302246, 0.03511315584182739, 0.020629942417144775, 0.0011355876922607422, 0.03379279375076294, 0.016402244567871094, 0.09571927785873413, 0.2744561731815338, 0.053050220012664795, 0.06597477197647095, 0.04112511873245239, 0.12899142503738403, 0.020069003105163574, 0.05840921401977539, 0.10036730766296387, 0.025072157382965088, 0.06321585178375244, 0.01628720760345459, 0.022546887397766113, 0.06326985359191895, 0.050193190574645996, 0.02146899700164795, 0.040130555629730225, 0.013004302978515625, 0.006366610527038574, 0.02343684434890747, 0.2715577781200409, 0.06762981414794922, 0.0743948221206665, 0.06074070930480957, 0.07851904630661011, 0.028824985027313232, 0.035285353660583496, 0.04656141996383667, 0.012224018573760986, 0.025344669818878174, 0.01591789722442627, 0.005037784576416016, 0.0174790620803833, 0.023137450218200684, 0.09746921062469482, 0.05383330583572388, 0.004199504852294922, 0.0009397268295288086, 0.008511781692504883, 0.09042251110076904, 0.06318128108978271, 0.060231149196624756, 0.04732036590576172, 0.014931082725524902, 0.10653769969940186, 0.12591701745986938, 0.060445189476013184, 0.04030191898345947, 0.01494300365447998, 0.12802213430404663, 0.09762042760848999, 0.09339773654937744, 0.03688329458236694, 0.0747101902961731, 0.12368863821029663, 0.03507870435714722, 0.09544259309768677, 0.04075336456298828, 0.12098664045333862, 0.022427141666412354, 0.03294110298156738, 0.031216859817504883, 0.019383728504180908, 0.06344014406204224, 0.03171205520629883, 0.03676581382751465, 0.21831631660461426, 0.07910400629043579, 0.1124994158744812, 0.040886521339416504, 0.13859713077545166, 0.011599302291870117, 0.029348433017730713, 0.023153483867645264, 0.047654032707214355, 0.11874735355377197, 0.09675008058547974, 0.008685111999511719, 0.03842926025390625, 0.031187891960144043, 0.0084686279296875, 0.0628545880317688, 0.027201473712921143, 0.09115171432495117, 0.04512357711791992, 0.02043938636779785, 0.1085919737815857, 0.04843437671661377, 0.07343786954879761, 0.058217644691467285, 0.09163999557495117, 0.08481401205062866, 0.07186931371688843, 0.06049579381942749, 0.03435313701629639, 0.15136313438415527, 0.1173090934753418, 0.002542555332183838, 0.10022920370101929, 0.012693643569946289, 0.08230346441268921, 0.08690494298934937, 0.04243326187133789, 0.01703941822052002, 0.03708416223526001, 0.043028831481933594, 0.05814307928085327, 0.1383885145187378, 0.00016421079635620117, 0.04405695199966431, 0.07099920511245728, 0.07654541730880737, 0.043519556522369385, 0.017900824546813965, 0.06335502862930298, 0.005168318748474121, 0.05557960271835327, 0.05876880884170532, 0.043743133544921875, 0.028391480445861816, 0.050123512744903564, 0.07486552000045776, 0.011111080646514893, 0.04211217164993286, 0.02742016315460205, 0.05885523557662964, 0.009671926498413086, 0.041166841983795166, 0.07622718811035156, 0.040730834007263184, 0.011026978492736816, 0.045023202896118164, 0.0663684606552124, 0.04990178346633911, 0.09722936153411865, 0.055240750312805176]
error_signed : [0.0574607253074646, 0.02622610330581665, -0.0630078911781311, 0.0820850133895874, -0.029416024684906006, 0.0942842960357666, 0.10046190023422241, -0.05539768934249878, 0.1087789535522461, 0.22691839933395386, 0.051831841468811035, 0.013963401317596436, -0.06667262315750122, 0.04638546705245972, -0.0018302202224731445, -0.0902819037437439, 0.07130050659179688, 0.13652795553207397, 0.01845163106918335, -0.06842547655105591, 0.05520284175872803, 0.1352357268333435, -0.04734373092651367, -0.07942116260528564, 0.18606480956077576, -0.051906704902648926, 0.03907430171966553, 0.0050392746925354, 0.04112929105758667, 0.04942309856414795, 0.12091577053070068, 0.04594922065734863, -0.037316977977752686, 0.09085285663604736, 0.060090065002441406, -0.2221432328224182, 0.04704958200454712, 0.0011395812034606934, -0.02451145648956299, -0.03415966033935547, -0.023275136947631836, -0.007175564765930176, 0.04032844305038452, 0.03038877248764038, 0.0324745774269104, 0.05606579780578613, -0.07037395238876343, -0.016001760959625244, -0.0727090835571289, 0.02604961395263672, -0.19396179914474487, 0.04485368728637695, -0.008350968360900879, 0.002349257469177246, 0.15334558486938477, 0.049565792083740234, 0.036320507526397705, 0.030183255672454834, -0.007233858108520508, 0.04074209928512573, 0.0003248453140258789, 0.03816264867782593, 0.01633131504058838, 0.05167728662490845, 0.05444282293319702, -0.07581943273544312, 0.007851243019104004, 0.10336863994598389, 0.08002299070358276, -0.005653560161590576, 0.008839726448059082, -0.03865492343902588, -0.02310281991958618, 0.04588449001312256, -0.07808959484100342, -0.058539509773254395, 0.16082823276519775, 0.06740844249725342, -0.04211777448654175, 0.11145156621932983, -0.007852256298065186, -0.07360202074050903, -0.0629422664642334, 0.1054149866104126, 0.013242900371551514, -0.00021857023239135742, -0.05921655893325806, 0.03633385896682739, 0.0729643702507019, -0.005087673664093018, 0.03984135389328003, -0.01645272970199585, 0.00998067855834961, -0.04053986072540283, -0.001870274543762207, 0.10788309574127197, 0.04104667901992798, 0.2704971134662628, 0.03863447904586792, 0.09117919206619263, 0.07199311256408691, 0.06278705596923828, 0.05048114061355591, 0.11768341064453125, 0.07333153486251831, -0.008604705333709717, 0.03498125076293945, -0.028855323791503906, 0.0790058970451355, 0.13216400146484375, 0.056121885776519775, 0.5895423889160156, 0.05832391977310181, 0.1101536750793457, 0.053139448165893555, 0.09741556644439697, 0.043916523456573486, -0.013929367065429688, -0.054133474826812744, -0.04885685443878174, -0.08222591876983643, -0.015181124210357666, 0.05424433946609497, 0.010137379169464111, 0.15593719482421875, -0.03784310817718506, 0.04167652130126953, -0.0403437614440918, 0.009692609310150146, -0.010388791561126709, -0.04954195022583008, -0.02927863597869873, 0.0027498602867126465, -0.04739832878112793, 0.0064945220947265625, 0.10806792974472046, -0.005159258842468262, -0.06188851594924927, 0.026653051376342773, 0.040322303771972656, -0.004061222076416016, 0.038002967834472656, 0.04782670736312866, -0.029299259185791016, 0.0023429393768310547, 0.03986048698425293, 0.5045850723981857, 0.005377829074859619, -0.0835997462272644, 0.025364935398101807, 0.03354376554489136, 0.03542357683181763, 0.08474475145339966, -0.09393376111984253, 0.05303758382797241, 0.07319438457489014, 0.06990683078765869, 0.05404996871948242, 0.03852468729019165, -0.08460652828216553, 0.07151675224304199, -0.052637457847595215, -0.017621397972106934, 0.041378021240234375, 0.012578487396240234, -0.005142092704772949, 0.0526544451713562, 0.08614426851272583, -0.10493314266204834, 0.044836223125457764, 0.023914992809295654, -0.06230217218399048, 0.0018602609634399414, -0.04226952791213989, 0.06902569532394409, 0.09837883710861206, -0.12040078639984131, -0.029239535331726074, -0.06698489189147949, 0.05280327796936035, 0.07803040742874146, 0.06312453746795654, -0.05542021989822388, 0.0012243986129760742, 0.09971517324447632, 0.14186090230941772, 0.039601802825927734, 0.04641157388687134, 0.09551757574081421, 0.033653974533081055, -0.00836789608001709, -0.05070894956588745, 0.0442737340927124, 0.11689025163650513, -0.15045732259750366, 0.000720977783203125, 0.009701430797576904, 0.050937116146087646, 0.013481855392456055, 0.03322690725326538, -0.02899324893951416, -0.038792192935943604, -0.030525803565979004, 0.09922021627426147, 0.02529686689376831, -0.06707620620727539, 0.07628780603408813, 0.0258331298828125, -0.018063843250274658, -0.021147608757019043, 0.045512855052948, -0.11087554693222046, 0.007247745990753174, 0.08825057744979858, -0.011337816715240479, 0.06435966491699219, -0.012022793292999268, -0.0015137195587158203, -0.039940595626831055, 0.041110336780548096, 0.03333926200866699, 0.15217387676239014, 0.08031433820724487, 0.0010263919830322266, -0.0024033188819885254, 0.007911264896392822, 0.0641661286354065, -0.008675813674926758, -0.0020564794540405273, -0.008706390857696533, -0.03695535659790039, 0.03293699026107788, -0.12232577800750732, 0.09082412719726562, -0.027937352657318115, 0.13187956809997559, 0.11643731594085693, -0.07343196868896484, -0.037915825843811035, 0.029255926609039307, 0.017876923084259033, 0.012329459190368652, 0.027307450771331787, -0.049487411975860596, -0.05886578559875488, 0.05414670705795288, -0.04791665077209473, 0.03446000814437866, -0.014775097370147705, -0.016065478324890137, -0.016984105110168457, 0.03420543670654297, 0.022746801376342773, -0.044884562492370605, 0.04557746648788452, 0.07756388187408447, 0.0005920529365539551, 0.032321155071258545, -0.09012144804000854, 0.03225952386856079, 0.02861720323562622, -0.01867532730102539, -0.04679757356643677, 0.012906014919281006, 0.03239172697067261, 0.09168416261672974, 0.062249600887298584, -0.05381476879119873, -0.007506251335144043, 0.04968756437301636, 0.007136225700378418, 0.02014225721359253, 0.11657881736755371, -0.014830708503723145, 0.04327964782714844, -0.020478665828704834, -0.09865331649780273, -0.03484499454498291, -0.061237215995788574, -0.020197033882141113, 0.12278801202774048, -0.18740904331207275, 0.11453127861022949, 0.014386534690856934, -0.0039841532707214355, -0.04213780164718628, 0.04201275110244751, -0.07532840967178345, 0.03683888912200928, 0.10119861364364624, -0.07032418251037598, 0.06266283988952637, 0.0888141393661499, 0.03260535001754761, 0.04743170738220215, -0.020800769329071045, 0.05005723237991333, -0.08414971828460693, 0.09856534004211426, 0.10315418243408203, 0.10495883226394653, -0.05891096591949463, 0.07348698377609253, 0.01662832498550415, 0.0994688868522644, 0.03210550546646118, 0.11038780212402344, 0.046570777893066406, -0.08859807252883911, -0.07587367296218872, -0.015878498554229736, 0.08321338891983032, 0.107391357421875, 0.027417659759521484, 0.024596989154815674, -0.03199279308319092, -0.047856807708740234, 0.03484529256820679, 0.0070648193359375, -0.03886222839355469, -0.02248513698577881, -0.03500574827194214, 0.03355848789215088, 0.037703514099121094, 0.006578266620635986, -0.09719592332839966, -0.05736726522445679, -0.03674507141113281, 0.06733345985412598, 0.06915479898452759, -0.05257284641265869, -0.058165669441223145, 0.049707889556884766, 0.04324901103973389, -0.05862283706665039, 0.10174989700317383, 0.09095263481140137, 0.08865022659301758, 0.0511782169342041, 0.1338217854499817, 0.049777090549468994, 0.03821516036987305, 0.154521644115448, 0.04468816518783569, 0.03585183620452881, 0.04265695810317993, -0.00727003812789917, -0.026178061962127686, -0.0435335636138916, 0.0037412047386169434, 0.09036380052566528, 0.07606738805770874, 0.03009474277496338, -0.012939393520355225, -0.03579014539718628, -0.027446866035461426, 0.0019608139991760254, 0.17713844776153564, -0.002379775047302246, 0.03511315584182739, 0.020629942417144775, -0.0011355876922607422, -0.03379279375076294, -0.016402244567871094, -0.09571927785873413, 0.2744561731815338, -0.053050220012664795, -0.06597477197647095, -0.04112511873245239, -0.12899142503738403, 0.020069003105163574, -0.05840921401977539, -0.10036730766296387, 0.025072157382965088, 0.06321585178375244, -0.01628720760345459, -0.022546887397766113, -0.06326985359191895, -0.050193190574645996, -0.02146899700164795, 0.040130555629730225, -0.013004302978515625, 0.006366610527038574, -0.02343684434890747, 0.2715577781200409, -0.06762981414794922, -0.0743948221206665, 0.06074070930480957, -0.07851904630661011, 0.028824985027313232, 0.035285353660583496, 0.04656141996383667, 0.012224018573760986, -0.025344669818878174, -0.01591789722442627, -0.005037784576416016, 0.0174790620803833, 0.023137450218200684, -0.09746921062469482, 0.05383330583572388, -0.004199504852294922, -0.0009397268295288086, 0.008511781692504883, 0.09042251110076904, -0.06318128108978271, -0.060231149196624756, 0.04732036590576172, 0.014931082725524902, -0.10653769969940186, -0.12591701745986938, 0.060445189476013184, -0.04030191898345947, 0.01494300365447998, -0.12802213430404663, 0.09762042760848999, 0.09339773654937744, -0.03688329458236694, -0.0747101902961731, -0.12368863821029663, -0.03507870435714722, -0.09544259309768677, -0.04075336456298828, 0.12098664045333862, 0.022427141666412354, -0.03294110298156738, 0.031216859817504883, -0.019383728504180908, -0.06344014406204224, -0.03171205520629883, 0.03676581382751465, 0.21831631660461426, 0.07910400629043579, 0.1124994158744812, 0.040886521339416504, 0.13859713077545166, -0.011599302291870117, 0.029348433017730713, 0.023153483867645264, 0.047654032707214355, 0.11874735355377197, -0.09675008058547974, 0.008685111999511719, 0.03842926025390625, -0.031187891960144043, 0.0084686279296875, 0.0628545880317688, 0.027201473712921143, 0.09115171432495117, -0.04512357711791992, 0.02043938636779785, 0.1085919737815857, 0.04843437671661377, -0.07343786954879761, -0.058217644691467285, 0.09163999557495117, -0.08481401205062866, -0.07186931371688843, 0.06049579381942749, 0.03435313701629639, 0.15136313438415527, 0.1173090934753418, -0.002542555332183838, 0.10022920370101929, 0.012693643569946289, 0.08230346441268921, -0.08690494298934937, -0.04243326187133789, 0.01703941822052002, 0.03708416223526001, 0.043028831481933594, 0.05814307928085327, -0.1383885145187378, -0.00016421079635620117, -0.04405695199966431, 0.07099920511245728, 0.07654541730880737, 0.043519556522369385, 0.017900824546813965, 0.06335502862930298, -0.005168318748474121, -0.05557960271835327, 0.05876880884170532, 0.043743133544921875, -0.028391480445861816, -0.050123512744903564, 0.07486552000045776, 0.011111080646514893, 0.04211217164993286, 0.02742016315460205, 0.05885523557662964, 0.009671926498413086, 0.041166841983795166, -0.07622718811035156, 0.040730834007263184, -0.011026978492736816, -0.045023202896118164, -0.0663684606552124, -0.04990178346633911, 0.09722936153411865, 0.055240750312805176]
error_mean : 5.633597204089165
error_mse : 0.3173741745792125
error_max : 58.95423889160156
error_min : 0.016421079635620117